
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第四章 论文范文 · 系统架构设计师</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Lacuz">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="历年真题/总览.html" />
    
    
    <link rel="prev" href="../readme.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../readme.html">
            
                <a href="../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3" data-path="09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="历年真题/总览.html">
            
                <a href="历年真题/总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="历年真题/总览.html">
            
                <a href="历年真题/总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="历年真题/2009.html">
            
                <a href="历年真题/2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="历年真题/2010.html">
            
                <a href="历年真题/2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="历年真题/2011.html">
            
                <a href="历年真题/2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="历年真题/2012.html">
            
                <a href="历年真题/2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="历年真题/2013.html">
            
                <a href="历年真题/2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="历年真题/2014.html">
            
                <a href="历年真题/2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="历年真题/2015.html">
            
                <a href="历年真题/2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="历年真题/2016.html">
            
                <a href="历年真题/2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="历年真题/2017.html">
            
                <a href="历年真题/2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="历年真题/2018.html">
            
                <a href="历年真题/2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="历年真题/2019.html">
            
                <a href="历年真题/2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="历年真题/2020.html">
            
                <a href="历年真题/2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="历年真题/2021.html">
            
                <a href="历年真题/2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="16-题2-论软件设计模式及其应用.html">
            
                <a href="16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >第四章 论文范文</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8BBA;&#x57FA;&#x4E8E;rest&#x670D;&#x52A1;&#x7684;web&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;"><a href="https://blog.csdn.net/weixin_34077371/article/details/86469807" target="_blank">&#x8BBA;&#x57FA;&#x4E8E;REST&#x670D;&#x52A1;&#x7684;Web&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;</a></h1>
<h2 id="&#x3010;&#x6458;&#x8981;&#x3011;">&#x3010;&#x6458;&#x8981;&#x3011;</h2>
<p>2011 &#x5E74;&#x4E0A;&#x534A;&#x5E74;&#xFF0C;&#x6211;&#x5728;&#x4E0A;&#x6D77;&#x4E2D;&#x8F6F;&#x8D44;&#x6E90;&#x8F6F;&#x4EF6;&#x6709;&#x9650;&#x516C;&#x53F8;(ICSS)&#xFF0C;&#x4F5C;&#x4E3A;&#x9879;&#x76EE;&#x7EC4;&#x957F;&#x53C2;&#x4E0E;&#x4E86;&#x516C;&#x53F8;&#x4EBA;&#x4E8B;&#x7BA1;&#x7406;(HR)&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x3002;&#x5728;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x524D;&#xFF0C;&#x516C;&#x53F8;&#x5728;&#x4FE1;&#x606F;&#x5316;&#x5EFA;&#x8BBE;&#x4E2D;&#xFF0C;&#x4E1A;&#x5DF2;&#x91C7;&#x7528;&#x8BF7;&#x5047;&#x6D41;&#x7A0B;&#x3001;&#x85AA;&#x8D44;&#x7BA1;&#x7406;&#x3001;&#x62DB;&#x8058;&#x7B49;&#x7CFB;&#x7EDF;&#xFF0C;&#x867D;&#x7136;&#x8F83;&#x4E3A;&#x6210;&#x719F;&#xFF0C;&#x4F46;&#x5F7C;&#x6B64;&#x95F4;&#x4E92;&#x76F8;&#x72EC;&#x7ACB;&#xFF0C;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x65E0;&#x6CD5;&#x5171;&#x4EAB;&#x3002;&#x4E14;&#x516C;&#x53F8;&#x5404;&#x4E2A;&#x5206;&#x516C;&#x53F8;&#x95F4;&#xFF0C;&#x5BF9; HR &#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#x4E5F;&#x622A;&#x7136;&#x4E0D;&#x540C;&#xFF0C;&#x6709;&#x7684;&#x5206;&#x516C;&#x53F8;&#x7531;&#x4E8E;&#x5404;&#x79CD;&#x539F;&#x56E0;&#xFF0C;&#x4ECD;&#x7136;&#x91C7;&#x7528;&#x624B;&#x5DE5;&#x7BA1;&#x7406;&#x672C;&#x5E94;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x5316;&#x7684;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x3002;&#x516C;&#x53F8;&#x662F;&#x4EE5;&#x8F6F;&#x4EF6;&#x5916;&#x5305;&#x4E1A;&#x52A1;&#x4E3A;&#x4E3B;&#xFF0C;&#x6240;&#x4EE5;&#x4EBA;&#x529B;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x5728;&#x516C;&#x53F8;&#x4FE1;&#x606F;&#x5316;&#x5EFA;&#x8BBE;&#x4E2D;&#x7684;&#x5730;&#x4F4D;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x3002;&#x8FD9;&#x6B21;&#x5F00;&#x53D1;&#x7684; HR &#x7CFB;&#x7EDF;&#xFF0C;&#x5C06;&#x6574;&#x5408;&#x73B0;&#x6709;&#x7684;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#xFF0C;&#x5728;&#x6574;&#x4E2A;&#x516C;&#x53F8;&#x5185;&#x90E8;&#x63A8;&#x884C;&#x4F7F;&#x7528;&#xFF0C;&#x4EE5;&#x89E3;&#x51B3;&#x4FE1;&#x606F;&#x5B64;&#x5C9B;&#x5E26;&#x6765;&#x7684;&#x6548;&#x7387;&#x4F4E;&#x4E0B;&#x95EE;&#x9898;&#x3002;&#x4E3A;&#x4E86;&#x4EE5;&#x540E;&#x7684;&#x6269;&#x5C55;&#x9700;&#x8981;&#xFF0C;&#x4FDD;&#x8BC1;&#x5728;&#x4E1A;&#x52A1;&#x548C;&#x7A7A;&#x95F4;&#x5C3D;&#x53EF;&#x80FD;&#x5927;&#x7684;&#x6269;&#x5C55;&#x6027;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7ECF;&#x8FC7;&#x7814;&#x8BA8;&#xFF0C;&#x51B3;&#x5B9A;&#x91C7;&#x7528; REST Web &#x670D;&#x52A1;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x7CFB;&#x7EDF;&#x5E94;&#x7528;&#x5C42;&#x3002;&#x672C;&#x6587;&#x5C06;&#x5C31;HR&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#xFF0C;&#x63CF;&#x8FF0;&#x4E00;&#x4E0B;&#x5BF9; REST &#x670D;&#x52A1;&#x7684;&#x4F7F;&#x7528;&#x548C;&#x8BA4;&#x8BC6;&#x7684;&#x4F53;&#x4F1A;&#x3002;</p>
<h2 id="&#x3010;&#x6B63;&#x6587;&#x3011;">&#x3010;&#x6B63;&#x6587;&#x3011;</h2>
<p>&#x4E0A;&#x6D77;&#x4E2D;&#x8F6F; HR &#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x6574;&#x4F53;&#x91C7;&#x7528;&#x57FA;&#x4E8E; B/S &#x7684;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x3002;
&#x6211;&#x505A;&#x4E3A;&#x9879;&#x76EE;&#x7EC4;&#x957F;&#x53C2;&#x4E0E;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x5206;&#x6790;&#x81F3;&#x6D4B;&#x8BD5;&#x548C;&#x90E8;&#x7F72;&#x7684;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x76F4;&#x63A5;&#x5411;IT &#x90E8;&#x95E8;&#x603B;&#x76D1;&#x6C47;&#x62A5;&#x3002;&#x8D1F;&#x8D23;&#x6C9F;&#x901A;&#x9700;&#x6C42;&#xFF0C;&#x5EFA;&#x7ACB;&#x9879;&#x76EE;&#x7EC4;&#xFF0C;&#x786E;&#x5B9A;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x548C;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x65B9;&#x6848;&#x3002;&#x9884;&#x5B9A;&#x5F00;&#x53D1;&#x5468;&#x671F;&#x4E3A;120 &#x5929;&#xFF0C;&#x7CFB;&#x7EDF;&#x90E8;&#x7F72;&#x540E;&#x6709;&#x4E24;&#x4E2A;&#x6708;&#x7684;&#x8BD5;&#x8FD0;&#x884C;&#x671F;&#xFF0C;&#x9879;&#x76EE;&#x7EC4;&#x4EBA;&#x6570;&#x5728; 5-10 &#x4EBA;&#x95F4;&#x53D8;&#x52A8;&#x3002;&#x7531;&#x4E8E;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x8D44;&#x6E90;&#xFF08;&#x6BD4;&#x5982;&#x65F6;&#x95F4;&#xFF09;&#x7D27;&#x5F20;&#xFF0C;&#x516C;&#x53F8; HR &#x7CFB;&#x7EDF;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x590D;&#x6742;&#xFF0C;&#x65E7;&#x7CFB;&#x7EDF;&#x6539;&#x8FDB;&#x4E0E;&#x65B0;&#x9700;&#x6C42;&#x4EA4;&#x7EC7;&#xFF0C;&#x9879;&#x76EE;&#x7EC4;&#x5BF9;&#x4E1A;&#x52A1;&#x5E76;&#x4E0D;&#x719F;&#x6089;&#xFF0C;&#x96BE;&#x4EE5;&#x5728;&#x4E00;&#x5F00;&#x59CB;&#x9884;&#x4F30;&#x5C06;&#x6240;&#x6709;&#x4E1A;&#x52A1;&#x79FB;&#x690D;&#x5230;&#x65B0;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x5F00;&#x53D1;&#x6A21;&#x578B;&#x9009;&#x62E9;&#x4E0A;&#xFF0C;&#x91C7;&#x7528;&#x87BA;&#x65CB;&#x5F0F;&#x589E;&#x91CF;&#x5F00;&#x53D1;&#x3002;&#x9996;&#x5148;&#x4E0D;&#x5FC5;&#x8FFD;&#x6C42;&#x5927;&#x800C;&#x5168;&#xFF0C;&#x5728;&#x5F00;&#x53D1;&#x5B8C;&#x7CFB;&#x7EDF;&#x57FA;&#x672C;&#x6846;&#x67B6;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x4F18;&#x5148;&#x79FB;&#x690D;&#x6700;&#x4E9F;&#x5F85;&#x6539;&#x8FDB;&#x7684;&#x4E1A;&#x52A1;&#x3002;&#x7ECF;&#x4E0E;&#x9886;&#x5BFC;&#x548C; HR &#x90E8;&#x95E8;&#x6C9F;&#x901A;&#x7814;&#x7A76;&#xFF0C; &#x9012;&#x4EA4;&#x4E86;&#x7CFB;&#x7EDF;&#x51C6;&#x5907;&#x5B9E;&#x73B0;&#x7684;&#x529F;&#x80FD;&#x5217;&#x8868;&#xFF0C;&#x6309;&#x4E0D;&#x540C;&#x5B9E;&#x73B0;&#x4F18;&#x5148;&#x7EA7;&#x6392;&#x5217;&#xFF0C;&#x6807;&#x8BB0;&#x4E3A; P1 &#x7684;&#x529F;&#x80FD;&#x4F18;&#x5148;&#x7EA7;&#x6700;&#x9AD8;&#xFF0C;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#x3002;&#x6807;&#x8BB0;&#x4E3A; P2/P3/P4 &#x7684;&#x529F;&#x80FD;&#x4F18;&#x5148;&#x7EA7;&#x4F9D;&#x6B21;&#x964D;&#x4F4E;&#xFF0C;&#x5FC5;&#x8981;&#x65F6;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8D44;&#x6E90;&#x60C5;&#x51B5;&#x9700;&#x8981;&#x8FDB;&#x884C;&#x88C1;&#x526A;&#x3002;
&#x5728;&#x5F00;&#x53D1;&#x6280;&#x672F;&#x7684;&#x9009;&#x62E9;&#x4E0A;&#xFF0C;&#x7531;&#x4E8E;&#x672C;&#x516C;&#x53F8;&#x4E1A;&#x52A1;&#x4EE5;&#x5FAE;&#x8F6F;&#x5916;&#x5305;&#x4E3A;&#x4E3B;&#xFF0C;&#x516C;&#x53F8;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5927;&#x90FD;&#x719F;&#x6089;&#x4E00;&#x9879;&#x6216;&#x591A;&#x9879;&#x5FAE;&#x8F6F;&#x5F00;&#x53D1;&#x6280;&#x672F;&#xFF0C;&#x4F5C;&#x4E3A;&#x5FAE;&#x8F6F;&#x516C;&#x53F8;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x53EF;&#x4EE5;&#x4F4E;&#x6210;&#x672C;&#x83B7;&#x53D6;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x548C;&#x7BA1;&#x7406;&#x5DE5;&#x5177;&#xFF0C;&#x65B9;&#x4FBF;&#x5730;&#x83B7;&#x53D6;&#x6280;&#x672F;&#x652F;&#x6301;&#x3002; &#x6240;&#x4EE5;&#x51B3;&#x5B9A;&#x8BE5;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;&#x5FAE;&#x8F6F;&#x6280;&#x672F;&#xFF1A;&#x8868;&#x793A;&#x5C42;&#x57FA;&#x4E8E; ASP.NET 4.0&#xFF1B;&#x4E2D;&#x95F4;&#x4E1A;&#x52A1;&#x5C42;&#x91C7;&#x7528; REST &#x670D;&#x52A1;&#x5B9E;&#x73B0;&#xFF0C;&#x57FA;&#x4E8E; WCF(Windows Communication Foundation) 4.0; &#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x57FA;&#x4E8E;&#x5FAE;&#x8F6F;&#x7684; ORM &#x6784;&#x4EF6;-AEF(ADO.Net Entity Framework) 4.0&#x3002;&#x5728;&#x6784;&#x4EF6;&#x7684;&#x9009;&#x62E9;&#x4E0A;&#xFF0C;&#x5C3D;&#x53EF;&#x80FD;&#x964D;&#x4F4E;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x63D0;&#x9AD8;&#x6548;&#x7387;&#xFF0C;&#x529B;&#x6C42;&#x907F;&#x514D;&#x628A;&#x4E3B;&#x8981;&#x7CBE;&#x529B;&#x653E;&#x5728;&#x901A;&#x7528;&#x7684;&#x6280;&#x672F;&#x7EC6;&#x8282;&#xFF0C;&#x800C;&#x662F;&#x653E;&#x5728;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x7814;&#x7A76;&#x548C;&#x5B9E;&#x73B0;&#x4E0A;&#x3002;
&#x7CFB;&#x7EDF;&#x90E8;&#x7F72;&#x5171;&#x6709;&#x4E09;&#x53F0;&#x670D;&#x52A1;&#x5668;&#xFF1A;&#x4E24;&#x53F0; Web &#x670D;&#x52A1;&#x5668; Windows Server 2008 + IIS 7.5&#xFF0C;&#x5206;&#x522B;&#x8FD0;&#x884C;&#x7CFB;&#x7EDF;&#x7F51;&#x7AD9;&#x53CA; REST &#x670D;&#x52A1;&#xFF1B;&#x4E00;&#x53F0;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#x5668; Windows Server 2008 + SQL Server 2008&#x3002;&#x7ECF;&#x8FC7;&#x8BD5;&#x8FD0;&#x884C;&#xFF0C;&#x4E8E; 7 &#x6708;&#x4EFD;&#x6295;&#x5165;&#x6B63;&#x5F0F;&#x4F7F;&#x7528;&#x3002;&#x76EE;&#x524D;&#x7CFB;&#x7EDF;&#x72B6;&#x51B5;&#x826F;&#x597D;&#xFF0C;&#x7ECF;&#x8FD0;&#x884C;&#x8BC4;&#x4F30;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x5168;&#x90E8;&#x5FC5;&#x987B;&#x529F;&#x80FD;&#xFF0C;&#x6027;&#x80FD;&#x3001;&#x5B89;&#x5168;&#x6027;&#x7B49;&#x8D28;&#x91CF;&#x5747;&#x8FBE;&#x5230;&#x4E86;&#x539F;&#x5B9A;&#x8BBE;&#x8BA1;&#x8981;&#x6C42;&#x3002;&#x76EE;&#x524D;&#x7CFB;&#x7EDF;&#x6B63;&#x5728;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x9700;&#x8981;&#xFF0C;&#x7531;&#x540E;&#x7EED;&#x9879;&#x76EE;&#x7EC4;&#x505A;&#x4E8C;&#x6B21;&#x5F00;&#x53D1;&#x4E2D;&#x3002;
&#x91C7;&#x7528; REST &#x670D;&#x52A1;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#x7CFB;&#x7EDF;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#xFF0C;&#x5B8C;&#x5168;&#x7B26;&#x5408;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x65F6;&#x8003;&#x8651;&#x7684;&#x4E24;&#x4E2A;&#x56E0;&#x7D20;&#xFF1A;&#x7B80;&#x5355;&#x548C;&#x7075;&#x6D3B;&#x3002;&#x4F20;&#x7EDF;&#x7684; Internet Web &#x670D;&#x52A1;&#x4E00;&#x822C;&#x57FA;&#x4E8E; SOAP &#x534F;&#x8BAE;&#xFF0C;&#x6784;&#x9020; SOAP &#x8BF7;&#x6C42;XML &#x867D;&#x7136;&#x76EE;&#x524D;.NETFramework &#x5DF2;&#x5B9E;&#x73B0;&#x8F83;&#x597D;&#x5730;&#x5C01;&#x88C5;&#xFF0C;&#x4F46;&#x4E0D;&#x4FBF;&#x975E;.Net &#x8BED;&#x8A00;&#x8C03;&#x7528;&#xFF0C;&#x5982;&#x5BA2;&#x6237;&#x7AEF;&#x9875;&#x9762;&#x4E2D;&#x5927;&#x91CF;&#x91C7;&#x7528;&#x4E86;Ajax&#x6280;&#x672F;&#xFF0C;&#x4F7F;&#x7528; JavaScript &#x6784;&#x9020; Soap &#x8BF7;&#x6C42;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x3002;&#x5728;&#x8C03;&#x7528;&#x670D;&#x52A1;&#x7684; Web &#x9875;&#x9762;&#x5F00;&#x53D1;&#x5B8C;&#x6210;&#x524D;&#xFF0C;&#x4E3A;&#x4E86;&#x8C03;&#x8BD5;&#x548C;&#x6D4B;&#x8BD5;&#x670D;&#x52A1;&#xFF0C;&#x5FC5;&#x987B;&#x5199;&#x5355;&#x72EC;&#x7684;&#x6D4B;&#x8BD5;&#x7A0B;&#x5E8F;&#xFF0C;&#x5341;&#x5206;&#x4E0D;&#x4FBF;&#x3002;
&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x800C; REST &#x670D;&#x52A1;&#x5177;&#x6709;&#x975E;&#x5E38;&#x51FA;&#x8272;&#x5730;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x65E2;&#x80FD;&#x88AB;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x8C03;&#x7528;&#xFF0C;&#x53C8;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x88AB;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x8C03;&#x7528;&#x3002;&#x4E5F;&#x5F88;&#x65B9;&#x4FBF;&#x7528;&#x6D4F;&#x89C8;&#x5668;&#x548C; Fiddler &#x5DE5;&#x5177;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x5E76;&#x6CA1;&#x6709;&#x5C06; REST &#x670D;&#x52A1;&#x5355;&#x7EAF;&#x89C6;&#x4E3A;&#x4E00;&#x4E32;&#x5730;&#x5740;&#x7684;&#x54CD;&#x5E94;&#xFF0C;&#x4F46;&#x57FA;&#x4E8E; HTTP &#x534F;&#x8BAE;&#xFF0C;&#x53EF;&#x4EE5;&#x6700;&#x5927;&#x5730;&#x5229;&#x7528; HTTP &#x534F; &#x8BAE; &#x7684; &#x8BED; &#x4E49; &#x7279; &#x6027; &#x3002; &#x5982; &#x6570; &#x636E; &#x7684; &#x589E; &#x5220; &#x6539; &#x67E5; &#x64CD;&#x4F5C;&#x5BF9;&#x5E94;&#x4E0D;&#x540C;HttpMethod(Put/Delete/Update/Get)&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x7528;&#x76F8;&#x540C;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x7ED3;&#x70B9;(Endpoint)&#xFF0C;&#x6839;&#x636E;&#x9700;&#x8981;&#xFF0C;&#x901A;&#x8FC7;&#x5728;&#x8BF7;&#x6C42;&#x5934;&#x4E2D;&#x8BBE;&#x7F6E;&#x4E0D;&#x540C;&#x7684; Accept-Type&#xFF0C;&#x83B7;&#x53D6;&#x4E0D;&#x540C;&#x5F62;&#x5F0F;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x679C;&#xFF0C;&#x6BD4;&#x5982;JSON&#xFF08;&#x7528;&#x4E8E;Ajax)&#x6216;XML(&#x7528;&#x4E8E;&#x540E;&#x53F0;)&#x3002;
&#x66F4;&#x597D;&#x7684;&#x6027;&#x80FD;&#x548C;&#x7F13;&#x5B58;&#x652F;&#x6301;&#x2014;&#x2014;&#x7531;&#x4E8E;&#x4E0D;&#x9700;&#x8981;&#x6784;&#x9020; Soap &#x6D88;&#x606F;&#xFF0C;&#x8BF7;&#x6C42; Rest &#x670D;&#x52A1;&#x663E;&#x7136;&#x5F00;&#x9500;&#x66F4;&#x5C0F;&#x3002;REST &#x7C7B; Web &#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x9AD8;&#x901F;&#x7F13;&#x5B58;&#x63A7;&#x5236;&#x5934;&#xFF0C;&#x4ECE;&#x800C;&#x51CF;&#x5C11;&#x5E26;&#x5BBD;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x4ECE;&#x800C;REST &#x53EF;&#x4EE5;&#x6539;&#x5584;&#x54CD;&#x5E94;&#x65F6;&#x95F4;&#x548C;&#x6539;&#x8FDB;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;
&#x53EF;&#x6269;&#x5C55;&#x6027;&#x548C;&#x65E0;&#x72B6;&#x6001;&#x6027;&#x2014;&#x2014;&#x6BCF;&#x4E2A;&#x8BF7;&#x6C42;&#x90FD;&#x662F;&#x72EC;&#x7ACB;&#x7684;&#x3002;&#x4E00;&#x65E6;&#x88AB;&#x8C03;&#x7528;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x4FDD;&#x7559;&#x4EFB;&#x4F55;&#x4F1A;&#x8BDD;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x66F4;&#x5177;&#x54CD;&#x5E94;&#x6027;&#x3002;&#x901A;&#x8FC7;&#x51CF;&#x5C11;&#x4E8B;&#x4EF6;&#x540E;&#x901A;&#x8BAF;&#x72B6;&#x6001;&#x7684;&#x7EF4;&#x62A4;&#x5DE5;&#x4F5C;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x670D;&#x52A1;&#x5668;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;&#x5728;&#x4E3A;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1; REST &#x670D;&#x52A1;&#x65F6;&#xFF0C;&#x4E5F;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#xFF1A;
&#x4E00;&#x3001;&#x5B89;&#x5168;&#x6027;&#x65B9;&#x6848;&#x3002;&#x5E76;&#x4E0D;&#x662F;&#x6307; REST &#x670D;&#x52A1;&#x5B89;&#x5168;&#x6027;&#x4E0D;&#x8DB3;&#xFF0C;&#x5176;&#x672C;&#x8EAB;&#x6CA1;&#x6709;&#x5185;&#x7F6E;&#x7684;&#x5B89;&#x5168;&#x652F;&#x6301;&#xFF0C;&#x4F46;&#x6240;&#x6709; HTTP &#x652F;&#x6301;&#x5B89;&#x5168;&#x6A21;&#x5F0F;&#x548C;&#x6846;&#x67B6;&#x51E0;&#x4E4E;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x4E8E; REST &#x670D;&#x52A1;&#x3002;&#x771F;&#x6B63;&#x6F5C;&#x5728;&#x98CE;&#x9669;&#x5B58;&#x5728;&#x4E8E;REST&#x7075;&#x6D3B;&#x7684;&#x4F7F;&#x7528;&#x65B9;&#x5F0F;&#x4E0A;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x88AB;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8C03;&#x7528;&#x53C8;&#x80FD;&#x88AB;&#x5BA2;&#x6237;&#x7AEF;&#x8C03;&#x7528;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x8981;&#x660E;&#x786E;&#x5730;&#x533A;&#x5206;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#x548C;&#x7CFB;&#x7EDF;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF0C;&#x533A;&#x5206; Web &#x9875;&#x9762;&#x6743;&#x9650;&#x548C; REST &#x670D;&#x52A1;&#x6743;&#x9650;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x5728;&#x5F00;&#x53D1;&#x4E2D;&#x7ECF;&#x5E38;&#x6DF7;&#x4E3A;&#x4E00;&#x8C08;&#xFF0C;&#x6240;&#x4EE5;&#x8981;&#x52A0;&#x5F3A;&#x8BBE;&#x8BA1;&#x9636;&#x6BB5;&#x8FD9;&#x65B9;&#x9762;&#x7684;&#x6587;&#x6863;&#x548C;&#x8BC4;&#x4F30;&#x5DE5;&#x4F5C;&#x3002;
&#x4E8C;&#x3001;&#x670D;&#x52A1;&#x63A5;&#x53E3;&#x89C4;&#x8303;&#x6027;&#x3002;REST &#x670D;&#x52A1;&#x57FA;&#x4E8E; URI &#x5730;&#x5740;&#x8BBF;&#x95EE;&#xFF0C;&#x6709;&#x975E;&#x5E38;&#x5F3A;&#x7684;&#x8BED;&#x4E49;&#x6027;&#xFF0C;&#x670D;&#x52A1;&#x63A5;&#x53E3;&#x7684;&#x6BCF;&#x4E2A;&#x64CD;&#x4F5C;&#x90FD;&#x57FA;&#x4E8E;&#x4E00;&#x4E2A; URI &#x6A21;&#x677F;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x4E1A;&#x52A1;&#x4E2D;&#xFF0C;&#x529F;&#x80FD;&#x7C7B;&#x4F3C;&#x7684;&#x64CD;&#x4F5C;&#x88AB;&#x505A;&#x6210;&#x591A;&#x4E2A;&#x91CD;&#x8F7D;&#xFF0C;&#x968F;&#x4E4B;&#x91CD;&#x8F7D;&#x7684;&#x589E;&#x591A;&#xFF0C;URI &#x6A21;&#x677F;&#x5982;&#x4F55;&#x7EA6;&#x5B9A;&#xFF0C;&#x5982;&#x4F55;&#x6269;&#x5C55;&#x4FBF;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x89C4;&#x8303;&#x6027;&#x95EE;&#x9898;&#x3002;&#x5F00;&#x59CB;&#x65F6;&#xFF0C;&#x5BF9;&#x6B64;&#x672A;&#x4E88;&#x4EE5;&#x8DB3;&#x591F;&#x91CD;&#x89C6;&#xFF0C;&#x5728;&#x591A;&#x4EBA;&#x5F00;&#x53D1;&#x670D;&#x52A1;&#xFF0C;&#x4EE5;&#x81F4;&#x4E00;&#x4E9B;&#x670D;&#x52A1;&#x64CD;&#x4F5C;&#x8BED;&#x4E49;&#x4EA7;&#x751F;&#x4E86;&#x6DF7;&#x4E71;&#xFF0C;&#x5F71;&#x54CD;&#x4E86;&#x7406;&#x89E3;&#x548C;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x3002;&#x540E;&#x6765;&#xFF0C;&#x53C8;&#x989D;&#x5916;&#x82B1;&#x8D39;&#x65F6;&#x95F4;&#x8D44;&#x6E90;&#x7EDF;&#x4E00;&#x4E86;&#x89C4;&#x5B9A;&#x4E86;&#x64CD;&#x4F5C; Uri &#x683C;&#x5F0F;&#x3002;&#x8FD9;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x6E90;&#x4E8E;&#x4E1A;&#x5185;&#x5C1A;&#x65E0;&#x660E;&#x786E;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x662F;&#xFF0C;&#x5E94;&#x8BE5;&#x4ECE;&#x8BBE;&#x8BA1;&#x65F6;&#x5C31;&#x5168;&#x9762;&#x8003;&#x8651;&#x5C06;&#x6765;&#x5982;&#x679C;&#x9700;&#x8981;&#x91CD;&#x8F7D;&#x7B49;&#x529F;&#x80FD;&#x6269;&#x5C55;&#xFF0C;URI &#x6A21;&#x677F;&#x7684;&#x8BED;&#x4E49;&#x6269;&#x5C55;&#x65B9;&#x5F0F;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x5176;&#x4ED6;&#x7684;&#x89C4;&#x8303;&#x95EE;&#x9898;&#xFF0C;&#x8BF8;&#x5982;&#x4E00;&#x4E9B;&#x64CD;&#x4F5C;&#x5305;&#x62EC;&#x589E;&#x5220;&#x6539;&#x67E5;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x4EE5;&#x4E0A;&#x7684;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#xFF0C;HttpMethod &#x5982;&#x4F55;&#x5B9A;&#x4E49;&#xFF0C;&#x4E5F;&#x5E94;&#x8BE5;&#x4E00;&#x5E76;&#x8003;&#x8651;&#x3002;
&#x4E09;&#x3001;WCF REST &#x81EA;&#x8EAB;&#x9650;&#x5236;&#x3002;WCF &#x4ECE; 3.0 &#x53D1;&#x5C55;&#x5230; 4.0&#xFF0C;&#x5DF2;&#x7ECF;&#x662F;&#x8F83;&#x4E3A;&#x6210;&#x719F;&#x3002;&#x800C;WCF &#x7684;REST&#x6784;&#x4EF6;&#xFF0C;&#x5219;&#x662F;&#x5168;&#x65B0;&#x7684;&#x6280;&#x672F;&#xFF0C;WCF &#x4F5C;&#x4E3A;.NET &#x5E73;&#x53F0; Web Service &#x7684;&#x66FF;&#x4EE3;&#x8005;&#xFF0C;&#x65E0;&#x8BBA;&#x5728;&#x5F00;&#x53D1;&#x8FD8;&#x662F;&#x7BA1;&#x7406;&#x4E0A;&#xFF0C;&#x90FD;&#x6781;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x800C; WCF REST &#x7684;&#x7075;&#x6D3B;&#x4F53;&#x73B0;&#x5728;&#x5F00;&#x53D1;&#x548C;&#x4F7F;&#x7528;&#x4E0A;&#xFF0C;&#x5728;&#x7BA1;&#x7406;&#x7EF4;&#x62A4;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;WCFREST &#x670D;&#x52A1;&#x63A5;&#x53E3;&#x64CD;&#x4F5C;&#x672A;&#x63D0;&#x4F9B;&#x5982; WCF &#x4E00;&#x6837;&#x7684;&#x7075;&#x6D3B;&#x7684;&#x914D;&#x7F6E;&#x529F;&#x80FD;&#xFF0C;URI &#x6A21;&#x677F;&#x7B49;&#x5143;&#x7D20;&#x5FC5;&#x987B;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x8BBE;&#x7F6E;&#xFF0C;&#x6D88;&#x606F;&#x683C;&#x5F0F;&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5BA2;&#x6237;&#x7AEF;&#x8BF7;&#x6C42;&#x8F93;&#x51FA;&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x5728;&#x914D;&#x7F6E;&#x6587;&#x4EF6;&#x4E2D;&#x8BBE;&#x7F6E;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x867D;&#x7136; REST &#x670D;&#x52A1;&#x4ECD;&#x7136;&#x5728;&#x53D1;&#x5C55;&#x4E2D;&#xFF0C;&#x7ECF;&#x9A8C;&#x4E0E;&#x6280;&#x672F;&#x8FD8;&#x6709;&#x5F88;&#x5927;&#x8FDB;&#x6B65;&#x7A7A;&#x95F4;&#x3002;&#x4F46;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x57FA;&#x4E8E; REST &#x670D;&#x52A1;&#x7684; WEB &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x62E5;&#x6709;&#x5F88;&#x591A;&#x4F18;&#x52BF;&#xFF0C;&#x672A;&#x5728;&#x5728; WEB &#x7CFB;&#x7EDF;&#xFF0C;&#x5C06;&#x6709;&#x66F4;&#x5149;&#x660E;&#x7684;&#x5E94;&#x7528;&#x524D;&#x666F;&#x3002;</p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Lacuz 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2022-10-24
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="../readme.html" class="navigation navigation-prev " aria-label="Previous page: 前言">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="历年真题/总览.html" class="navigation navigation-next " aria-label="Next page: 历年真题">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第四章 论文范文","level":"1.3","depth":1,"next":{"title":"历年真题","level":"1.3.1","depth":2,"path":"4论文范文/历年真题/总览.md","ref":"4论文范文/历年真题/总览.md","articles":[{"title":"总览","level":"1.3.1.1","depth":3,"path":"4论文范文/历年真题/总览.md","ref":"4论文范文/历年真题/总览.md","articles":[]},{"title":"2009","level":"1.3.1.2","depth":3,"path":"4论文范文/历年真题/2009.md","ref":"4论文范文/历年真题/2009.md","articles":[]},{"title":"2010","level":"1.3.1.3","depth":3,"path":"4论文范文/历年真题/2010.md","ref":"4论文范文/历年真题/2010.md","articles":[]},{"title":"2011","level":"1.3.1.4","depth":3,"path":"4论文范文/历年真题/2011.md","ref":"4论文范文/历年真题/2011.md","articles":[]},{"title":"2012","level":"1.3.1.5","depth":3,"path":"4论文范文/历年真题/2012.md","ref":"4论文范文/历年真题/2012.md","articles":[]},{"title":"2013","level":"1.3.1.6","depth":3,"path":"4论文范文/历年真题/2013.md","ref":"4论文范文/历年真题/2013.md","articles":[]},{"title":"2014","level":"1.3.1.7","depth":3,"path":"4论文范文/历年真题/2014.md","ref":"4论文范文/历年真题/2014.md","articles":[]},{"title":"2015","level":"1.3.1.8","depth":3,"path":"4论文范文/历年真题/2015.md","ref":"4论文范文/历年真题/2015.md","articles":[]},{"title":"2016","level":"1.3.1.9","depth":3,"path":"4论文范文/历年真题/2016.md","ref":"4论文范文/历年真题/2016.md","articles":[]},{"title":"2017","level":"1.3.1.10","depth":3,"path":"4论文范文/历年真题/2017.md","ref":"4论文范文/历年真题/2017.md","articles":[]},{"title":"2018","level":"1.3.1.11","depth":3,"path":"4论文范文/历年真题/2018.md","ref":"4论文范文/历年真题/2018.md","articles":[]},{"title":"2019","level":"1.3.1.12","depth":3,"path":"4论文范文/历年真题/2019.md","ref":"4论文范文/历年真题/2019.md","articles":[]},{"title":"2020","level":"1.3.1.13","depth":3,"path":"4论文范文/历年真题/2020.md","ref":"4论文范文/历年真题/2020.md","articles":[]},{"title":"2021","level":"1.3.1.14","depth":3,"path":"4论文范文/历年真题/2021.md","ref":"4论文范文/历年真题/2021.md","articles":[]}]},"previous":{"title":"前言","level":"1.2","depth":1,"path":"readme.md","ref":"readme.md","articles":[]},"dir":"ltr"},"config":{"plugins":["expandable-chapters-small","splitter","code","hide-element","pageview-count","popup","tbfed-pagefooter","-sharing","sharing-plus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Lacuz 2020","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"pageview-count":{},"expandable-chapters-small":{},"sharing":{"qq":true,"qzone":true,"weibo":true,"all":["weibo","qq","qzone"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Lacuz","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"系统架构设计师","language":"zh-hans","gitbook":"*","description":"系统架构设计师考试"},"file":{"path":"4论文范文/09-题3-论基于REST服务的Web应用系统设计.md","mtime":"2022-10-24T06:28:55.561Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-25T03:33:23.984Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

