
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>16-题2-论软件设计模式及其应用 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../5考试心得/如何跨专业考计算机高级证书.html" />
    
    
    <link rel="prev" href="09-题3-论基于REST服务的Web应用系统设计.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../readme.html">
            
                <a href="../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="16-题2-论软件设计模式及其应用.html">
            
                <a href="16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >16-题2-论软件设计模式及其应用</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8BBA;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53CA;&#x5176;&#x5E94;&#x7528;">&#x8BBA;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53CA;&#x5176;&#x5E94;&#x7528;</h1>
<h2 id="&#x6458;&#x8981;&#xFF1A;">&#x6458;&#x8981;&#xFF1A;</h2>
<p>&#x672C;&#x4EBA;&#x4E8E; 2018 &#x5E74; 1 &#x6708;&#x53C2;&#x4E0E;&#x4E86;&#x4E2D;&#x77F3;&#x5316; XX &#x6CB9;&#x7530; XX &#x91C7;&#x6CB9;&#x5382;&#x201C;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x201D;&#x7684;&#x9879;&#x76EE;&#x5EFA;&#x8BBE;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x5EFA;&#x8BBE;&#x76EE;&#x6807;&#x662F;&#x5B9E;&#x73B0;&#x5206;&#x5355;&#x4F4D;&#x3001;&#x5206;&#x7EBF;&#x8DEF;&#x3001;&#x5206;&#x7CFB;&#x7EDF;&#x8BC4;&#x4EF7;&#x3001;&#x4F18;&#x5316;&#x3001;&#x8003;&#x6838;&#xFF0C;&#x5168;&#x9762;&#x63D0;&#x5347;&#x91C7;&#x6CB9;&#x5382;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x6C34;&#x5E73;&#x3002;&#x5728;&#x8BE5;&#x9879;&#x76EE;&#x7EC4;&#x4E2D;&#x6211;&#x62C5;&#x4EFB;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x4E00;&#x804C;&#xFF0C;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x7CFB;&#x7EDF;&#x6574;&#x4F53;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x3002;&#x672C;&#x6587;&#x4EE5;&#x8BE5;&#x9879;&#x76EE;&#x4E3A;&#x4F8B;&#xFF0C;&#x8BA8;&#x8BBA;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x578B;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5305;&#x62EC;&#x95EE;&#x9898;&#x7684;&#x5206;&#x6790;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x548C;&#x5E94;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;&#x4E86; MVC &#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x4F5C;&#x4E3A;&#x4E3B;&#x4F53;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4EE5;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x3001;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x3001;&#x8FED;&#x4EE3;&#x5668;&#x6A21;&#x5F0F;&#x3001;&#x7B56;&#x7565;&#x6A21;&#x5F0F;&#x7B49;&#x591A;&#x79CD;&#x6A21;&#x5F0F;&#x4F5C;&#x4E3A;&#x8F85;&#x52A9;&#x6A21;&#x5F0F;&#xFF0C;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x4F7F;&#x8BE5;&#x7CFB;&#x7EDF;&#x5177;&#x5907;&#x826F;&#x597D;&#x7684;&#x7A33;&#x5B9A;&#x6027;&#x3001;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3001;&#x53EF;&#x4FEE;&#x6539;&#x6027;&#xFF0C;&#x6700;&#x7EC8;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x53D6;&#x5F97;&#x5706;&#x6EE1;&#x6210;&#x529F;&#x3002;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x5386;&#x65F6; 10 &#x4E2A;&#x6708;&#xFF0C;&#x76EE;&#x524D;&#x5DF2;&#x4E0A;&#x7EBF;&#x7A33;&#x5B9A;&#x8FD0;&#x884C;&#x4E00;&#x5E74;&#x591A;&#xFF0C;&#x83B7;&#x5F97;&#x7528;&#x6237;&#x7684;&#x4E00;&#x81F4;&#x597D;&#x8BC4;&#xFF0C;&#x8BE5;&#x9879;&#x76EE;&#x4E5F;&#x6210;&#x529F;&#x83B7;&#x5F97;&#x4E86;&#x5F53;&#x5E74;&#x5EA6;&#x5206;&#x516C;&#x53F8;&#x79D1;&#x6280;&#x8FDB;&#x6B65;&#x521B;&#x65B0;&#x4E00;&#x7B49;&#x5956;&#x3002;</p>
<h2 id="&#x6B63;&#x6587;&#xFF1A;">&#x6B63;&#x6587;&#xFF1A;</h2>
<p>&#x201C;
&#x7528;&#x7535;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x201D;&#x9879;&#x76EE;&#x662F;&#x91C7;&#x6CB9;&#x5382;&#x80FD;&#x6E90;&#x7BA1;&#x63A7;&#x4E2D;&#x5FC3;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x3002;&#x80FD;&#x6E90;&#x7BA1;&#x63A7;&#x4E2D;&#x5FC3;&#x662F;&#x4E2D;&#x77F3;&#x5316;&#x96C6;&#x56E2;&#x516C;&#x53F8;&#x5341;&#x4E09;&#x4E94;&#x89C4;&#x5212;&#x4E2D;&#x7684;&#x201C;&#x80FD;&#x6548;&#x500D;&#x589E;&#x201D;&#x8BA1;&#x5212;&#x5728;&#x80DC;&#x5229;&#x6CB9;&#x7530;&#x5206;&#x516C;&#x53F8;&#x7684;&#x793A;&#x8303;&#x5E94;&#x7528;&#x9879;&#x76EE;&#xFF0C;&#x8BE5;&#x793A;&#x8303;&#x9879;&#x76EE;&#x80FD;&#x591F;&#x5728;&#x5B9E;&#x73B0;&#x4F01;&#x4E1A;&#x8282;&#x80FD;&#x76EE;&#x6807;&#x7BA1;&#x7406;&#x3001;&#x80FD;&#x6E90;&#x8BA1;&#x91CF;&#x7EDF;&#x8BA1;&#x3001;&#x8282;&#x80FD;&#x6F5C;&#x529B;&#x8BC6;&#x522B;&#x3001;&#x80FD;&#x6548;&#x5206;&#x6790;&#x4F18;&#x5316;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x6709;&#x6548;&#x652F;&#x6491;&#x4F01;&#x4E1A;&#x5B9E;&#x65BD;&#x8282;&#x80FD;&#x6280;&#x672F;&#x6539;&#x9020;&#x3001;&#x4FC3;&#x8FDB;&#x4F01;&#x4E1A;&#x7528;&#x80FD;&#x6C34;&#x5E73;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#x3002;&#x201C;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x201D;&#x7684;&#x5EFA;&#x8BBE;&#x76EE;&#x6807;&#x662F;&#x5EFA;&#x7ACB;&#x8986;&#x76D6;&#x5382;&#x3001;&#x533A;&#x4E24;&#x7EA7;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x4E00;&#x4F53;&#x5316;&#x4F53;&#x7CFB;&#xFF0C;&#x5B9E;&#x73B0;&#x5206;&#x5355;&#x4F4D;&#x3001;&#x5206;&#x7EBF;&#x8DEF;&#x3001;&#x5206;&#x7CFB;&#x7EDF;&#x8BC4;&#x4EF7;&#x3001;&#x4F18;&#x5316;&#x3001;&#x8003;&#x6838;&#xFF0C;&#x8FBE;&#x5230;&#x7535;&#x7F51;&#x8FD0;&#x884C;&#x8D28;&#x91CF;&#x5B9E;&#x65F6;&#x76D1;&#x63A7;&#x3001;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x7CBE;&#x51C6;&#x7BA1;&#x63A7;&#x3001;&#x80FD;&#x8017;&#x603B;&#x91CF;&#x5168;&#x9762;&#x53D7;&#x63A7;&#xFF0C;&#x6309;&#x7167;&#x8FD0;&#x884C;&#x4EA7;&#x91CF;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#x7535;&#x91CF;&#xFF0C;&#x5168;&#x9762;&#x63D0;&#x5347;&#x91C7;&#x6CB9;&#x5382;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x6C34;&#x5E73;&#x3002;&#x8BE5;&#x9879;&#x76EE;&#x529F;&#x80FD;&#x8BBE;&#x8BA1;&#x53C2;&#x8003; PDCA &#x95ED;&#x73AF;&#x7BA1;&#x7406;&#x7684;&#x7406;&#x5FF5;&#xFF0C;&#x5171;&#x8BBE;&#x8BA1;&#x5305;&#x62EC;&#x7528;&#x7535;&#x8BA1;&#x5212;&#x3001;&#x7528;&#x7535;&#x5206;&#x6790;&#x3001;&#x7528;&#x7535;&#x4F18;&#x5316;&#x3001;&#x7528;&#x7535;&#x8003;&#x6838;&#x3001;&#x8BBE;&#x5907;&#x7BA1;&#x7406;&#x7B49;&#x4E94;&#x5927;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x3002;</p>
<p>&#x6211;&#x4F5C;&#x4E3A;&#x5355;&#x4F4D;&#x6280;&#x672F;&#x9AA8;&#x5E72;&#x4E4B;&#x4E00;&#xFF0C;&#x4E3B;&#x6301;&#x5E76;&#x53C2;&#x4E0E;&#x4E86;&#x9879;&#x76EE;&#x8BA1;&#x5212;&#x5236;&#x5B9A;&#x3001;&#x9700;&#x6C42;&#x5206;&#x6790;&#x3001;&#x6574;&#x4F53;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0E;&#x6280;&#x672F;&#x9009;&#x578B;&#x3001;&#x5E95;&#x5C42;&#x8BBE;&#x8BA1;&#x3001;&#x90E8;&#x5206;&#x7F16;&#x7801;&#x7B49;&#x591A;&#x9879;&#x5DE5;&#x4F5C;&#x3002;&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x5C06;&#x9996;&#x5148;&#x4ECB;&#x7ECD;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3001;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x7279;&#x70B9;&#x53CA;&#x5176;&#x6240;&#x5305;&#x542B;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5177;&#x4F53;&#x542B;&#x4E49;&#xFF0C;&#x7136;&#x540E;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x201C;&#x7528;
&#x7535;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x201D;&#x7684;&#x5206;&#x6790;&#x548C;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x91C7;&#x7528;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53CA;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x3002;</p>
<p>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF08;Design Pattern&#xFF09;&#x662F;&#x524D;&#x8F88;&#x4EEC;&#x5BF9;&#x4EE3;&#x7801;&#x5F00;&#x53D1;&#x7ECF;&#x9A8C;&#x7684;&#x603B;&#x7ED3;&#xFF0C;&#x662F;&#x89E3;&#x51B3;&#x7279;&#x5B9A;&#x95EE;&#x9898;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x5957;&#x8DEF;&#x3002;&#x5B83;&#x4E0D;&#x662F;&#x8BED;&#x6CD5;&#x89C4;&#x5B9A;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x5957;&#x7528;&#x6765;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x53EF;&#x590D;&#x7528;&#x6027;&#x3001;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3001;&#x53EF;&#x8BFB;&#x6027;&#x3001;&#x7A33;&#x5065;&#x6027;&#x4EE5;&#x53CA;&#x5B89;&#x5168;&#x6027;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x6839;&#x636E;&#x76EE;&#x7684;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;&#x3001;&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;&#x548C;&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F; 3 &#x79CD;&#xFF0C;&#x5176;&#x4E2D;&#x521B;&#x5EFA;&#x578B;&#x6A21;&#x5F0F;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x201C;&#x600E;&#x6837;&#x521B;&#x5EFA;&#x5BF9;&#x8C61;&#x201D;&#xFF0C;&#x5B83;&#x7684;&#x4E3B;&#x8981;&#x7279;&#x70B9;&#x662F;&#x201C;&#x5C06;&#x5BF9;&#x8C61;&#x7684;&#x521B;&#x5EFA;&#x4E0E;&#x4F7F;&#x7528;&#x5206;&#x79BB;&#x201D;&#x3002;GoF &#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x5355;&#x4F8B;&#x3001;&#x539F;&#x578B;&#x3001;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x3001;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x3001;&#x5EFA;&#x9020;&#x8005;&#x7B49; 5 &#x79CD;&#x3002;&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x5982;&#x4F55;&#x5C06;&#x7C7B;&#x6216;&#x5BF9;&#x8C61;&#x6309;&#x67D0;&#x79CD;&#x5E03;&#x5C40;&#x7EC4;&#x6210;&#x66F4;&#x5927;&#x7684;&#x7ED3;&#x6784;&#xFF0C;GoF &#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x4EE3;&#x7406;&#x3001;&#x9002;&#x914D;&#x5668;&#x3001;&#x6865;&#x63A5;&#x3001;&#x88C5;&#x9970;&#x3001;&#x5916;&#x89C2;&#x3001;&#x4EAB;&#x5143;&#x3001;&#x7EC4;&#x5408;&#x7B49; 7 &#x79CD;&#x7ED3;&#x6784;&#x578B;&#x6A21;&#x5F0F;&#x3002;&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F;&#x7528;&#x4E8E;&#x63CF;&#x8FF0;&#x7C7B;&#x6216;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x600E;&#x6837;&#x76F8;&#x4E92;&#x534F;&#x4F5C;&#x5171;&#x540C;&#x5B8C;&#x6210;&#x5355;&#x4E2A;&#x5BF9;&#x8C61;&#x90FD;&#x65E0;&#x6CD5;&#x5355;&#x72EC;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4EE5;&#x53CA;&#x600E;&#x6837;&#x5206;&#x914D;&#x804C;&#x8D23;&#x3002;
GoF &#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#x3001;&#x7B56;&#x7565;&#x3001;&#x547D;&#x4EE4;&#x3001;&#x804C;&#x8D23;&#x94FE;&#x3001;&#x72B6;&#x6001;&#x3001;&#x89C2;&#x5BDF;&#x8005;&#x3001;&#x4E2D;&#x4ECB;&#x8005;&#x3001;&#x8FED;&#x4EE3;&#x5668;&#x3001;&#x8BBF;&#x95EE;&#x8005;&#x3001;&#x5907;&#x5FD8;&#x5F55;&#x3001;&#x89E3;&#x91CA;&#x5668;&#x7B49; 11 &#x79CD;&#x884C;&#x4E3A;&#x578B;&#x6A21;&#x5F0F;&#x3002;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x8FD8;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x4F5C;&#x7528;&#x8303;&#x56F4;&#x5206;&#x4E3A;&#x7C7B;&#x6A21;&#x5F0F;&#x548C;&#x5BF9;&#x8C61;&#x6A21;&#x5F0F;&#xFF0C;&#x5176;&#x4E2D;&#x7C7B;&#x6A21;&#x5F0F;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x7C7B;&#x4E0E;&#x5B50;&#x7C7B;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x4E9B;&#x5173;&#x7CFB;&#x901A;&#x8FC7;&#x7EE7;&#x627F;&#x6765;&#x5EFA;&#x7ACB;&#xFF0C;&#x662F;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x523B;&#x4FBF;&#x786E;&#x5B9A;&#x4E0B;&#x6765;&#x4E86;&#x3002;GoF &#x4E2D;&#x7684;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x3001;&#xFF08;&#x7C7B;&#xFF09;&#x9002;&#x914D;&#x5668;&#x3001;&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#x3001;&#x89E3;&#x91CA;&#x5668;&#x5C5E;&#x4E8E;&#x8BE5;&#x6A21;&#x5F0F;&#x3002;&#x5BF9;&#x8C61;&#x6A21;&#x5F0F;&#x7528;&#x4E8E;&#x5904;&#x7406;&#x5BF9;&#x8C61;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x4E9B;&#x5173;&#x7CFB;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7EC4;&#x5408;&#x6216;&#x805A;&#x5408;&#x6765;&#x5B9E;&#x73B0;&#xFF0C;
&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x523B;&#x662F;&#x53EF;&#x4EE5;&#x53D8;&#x5316;&#x7684;&#xFF0C;&#x66F4;&#x5177;&#x52A8;&#x6001;&#x6027;&#x3002;GoF &#x4E2D;&#x9664;&#x4E86;&#x4EE5;&#x4E0A; 4 &#x79CD;&#xFF0C;&#x5176;&#x4ED6;&#x7684;&#x90FD;&#x662F;&#x5BF9;&#x8C61;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x9879;&#x76EE;&#x542F;&#x52A8;&#x540E;&#xFF0C;&#x7531;&#x4E8E;&#x6CB9;&#x7530;&#x7CFB;&#x7EDF;&#x5BF9;&#x5B89;&#x5168;&#x6027;&#x3001;&#x53EF;&#x9760;&#x6027;&#x3001;&#x53EF;&#x7528;&#x6027;&#x548C;&#x6269;&#x5C55;&#x6027;&#x8981;&#x6C42;&#x5F88;&#x9AD8;&#xFF0C;&#x5728;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5DE5;&#x4F5C;&#x7684;&#x5F00;&#x59CB;&#x9636;&#x6BB5;&#xFF0C;&#x5728;&#x516C;&#x53F8;&#x6280;&#x672F;&#x987E;&#x95EE;&#x7684;&#x5EFA;&#x8BAE;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x51B3;&#x5B9A;&#x91C7;&#x7528;&#x4E09;&#x5C42;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x4F5C;&#x4E3A;&#x8BE5;&#x7CFB;&#x7EDF;&#x7684;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x6A21;&#x5F0F;&#xFF0C;&#x5C06;&#x7CFB;&#x7EDF;&#x5206;&#x4E3A;&#x5E94;&#x7528;&#x5C42;&#xFF0C;&#x4E2D;&#x95F4;&#x5C42;&#xFF0C;&#x6570;&#x636E;&#x5C42;&#x3002;&#x5728;&#x4E09;&#x5C42;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x5177;&#x4F53;&#x8BBE;&#x8BA1;&#x548C;
&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x9009;&#x62E9;&#x4E86;&#x8BB8;&#x591A;&#x7ECF;&#x5178;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4EE5;&#x63D0;&#x9AD8;&#x4EE3;&#x7801;&#x53EF;&#x590D;&#x7528;&#x6027;&#x3001;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3001;&#x53EF;&#x8BFB;&#x6027;&#x3001;&#x7A33;&#x5065;&#x6027;&#x4EE5;&#x53CA;&#x5B89;&#x5168;&#x6027;&#x3002;&#x5176;&#x4E2D;&#x5E94;&#x7528;&#x5C42;&#x8D1F;&#x8D23;&#x5177;&#x4F53;&#x4E1A;&#x52A1;&#x548C;&#x89C6;&#x56FE;&#x5C55;&#x793A;&#xFF0C;&#x5982;&#x7CFB;&#x7EDF;&#x9996;&#x9875;&#x7684;&#x7535;&#x7F51;&#x62D3;&#x6251;&#x5C55;&#x793A;&#x3001;&#x5355;&#x4F4D;&#x7528;&#x7535;&#x3001;&#x7EBF;&#x8DEF;&#x7528;&#x7535;&#x7B49;&#xFF0C;&#x5176;&#x53C8;&#x5206;&#x4E3A;&#x89C6;&#x56FE;&#x5C42;&#x4E0E;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#xFF0C;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x4E86; MVC &#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x3001;&#x663E;&#x793A;&#x548C;&#x5904;&#x7406;&#x5206;&#x79BB;&#xFF0C;&#x4E2D;&#x95F4;&#x5C42;&#x9664;&#x8D1F;&#x8D23;&#x4E3A;&#x5E94;&#x7528;&#x5C42;&#x63D0;&#x4F9B;&#x901A;&#x7528;&#x670D;&#x52A1;&#x652F;&#x6301;&#x5982;&#x7CFB;&#x7EDF;&#x7BA1;&#x7406;&#x670D;&#x52A1;&#xFF0C;session &#x7BA1;&#x7406;&#x670D;&#x52A1;&#x7B49;&#x4E4B;&#x5916;&#xFF0C;&#x8FD8;&#x63D0;&#x4F9B;&#x9884;&#x62A5;&#x8B66;&#x6A21;&#x578B;&#x3001;&#x80FD;&#x6548;&#x4F18;&#x5316;&#x6A21;&#x578B;&#x3001;&#x4F18;&#x5316;&#x65B9;&#x6848;&#x63A8;&#x9001;&#x6A21;&#x578B;&#x7B49;&#x4E2D;&#x95F4;&#x4EF6;&#x652F;&#x6301;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x5355;&#x4F8B;&#x3001;&#x8FED;&#x4EE3;&#x5668;&#x3001;&#x7B56;&#x7565;&#x3001;&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#x7B49;&#x591A;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x6570;&#x636E;&#x5C42;&#x8D1F;&#x8D23;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#xFF0C;&#x5982;&#x6570;&#x636E;&#x5E93;&#x670D;&#x52A1;&#xFF0C;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#xFF0C;&#x6587;&#x4EF6;&#x670D;&#x52A1;&#xFF0C;&#x641C;&#x7D22;&#x670D;&#x52A1;&#x7B49;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;&#x5355;&#x4F8B;&#x3001;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x3001;&#x7B56;&#x7565;&#x7B49;&#x591A;&#x79CD;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x5C06;&#x5206;&#x5C42;&#x6B21;&#x8BE6;&#x7EC6;&#x5BF9;&#x51E0;&#x79CD;&#x4E3B;&#x8981;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x8BBE;&#x8BA1;&#x8FC7;
&#x7A0B;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<p>&#x9996;&#x5148;&#x662F;&#x5E94;&#x7528;&#x5C42;&#x3002;&#x5E94;&#x7528;&#x5C42;&#x91C7;&#x7528;&#x4E86; SpringMVC &#x8FD9;&#x4E00;&#x57FA;&#x4E8E; J2EE &#x5E73;&#x53F0;&#x7684; MVC &#x6846;&#x67B6;&#xFF0C;&#x4E3B;&#x8981;&#x901A;&#x8FC7; Vue+BootStrap &#x6280;&#x672F;&#x5B9E;&#x73B0;SpringMVC &#x662F;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x4E86; Web MVC &#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x8BF7;&#x6C42;&#x9A71;&#x52A8;&#x7C7B;&#x578B;&#x7684;&#x8F7B;&#x91CF;&#x7EA7; Web &#x6846;&#x67B6;&#x3002;&#x901A;&#x8FC7; MVC &#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x4E13;&#x6CE8;&#x4E8E;&#x8868;&#x793A;&#x903B;&#x8F91;&#x548C;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x6570;&#x636E;&#x3001;&#x663E;&#x793A;&#x548C;&#x5904;&#x7406;&#x7684;&#x5206;&#x79BB;&#xFF0C;&#x7F29;&#x77ED;&#x4E86;&#x5F00;&#x53D1;&#x5468;&#x671F;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x5F00;&#x53D1;&#x8D39;&#x7528;&#x548C;&#x7EF4;&#x62A4;&#x8D39;&#x7528;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x5F00;&#x53D1;&#x7684;&#x6210;&#x529F;&#x7387;&#x3002;&#x53E6;&#x5916;&#x6211;&#x4EEC;&#x5C06;&#x7CFB;&#x7EDF;&#x6839;&#x636E;&#x5E94;&#x7528;&#x8FDB;&#x884C;&#x6C34;&#x5E73;&#x5212;&#x5206;&#xFF0C;&#x8FD9;&#x6709;&#x52A9;&#x4E8E;&#x4EE3;&#x7801;&#x7BA1;&#x7406;&#x4E0E;&#x7EF4;&#x62A4;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x7CFB;&#x7EDF;&#x5206;&#x4E3A;&#x7528;&#x7535;&#x5206;&#x6790;&#xFF0C;&#x7528;&#x7535;&#x4F18;&#x5316;&#xFF0C;&#x7528;&#x7535;&#x8003;&#x6838;&#xFF0C;&#x7528;&#x7535;&#x8BA1;&#x5212;&#x7B49;&#x5341;&#x4F59;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x8FD9;&#x91CC;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x3002;</p>
<p>&#x5176;&#x6B21;&#x662F;&#x4E2D;&#x95F4;&#x5C42;&#x3002;&#x4E2D;&#x95F4;&#x5C42;&#x91C7;&#x7528;&#x4E86; Spring&#x3001;Shiro &#x7B49;&#x670D;&#x52A1;&#x6846;&#x67B6;&#x5B9E;&#x73B0;&#x3002;Spring &#x6846;&#x67B6;&#x672C;&#x8EAB;&#x5C31;&#x4F7F;&#x7528;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x4F8B;&#x5982;&#x5DE5;&#x5382;&#x65B9;&#x6CD5;&#x3001;&#x5355;&#x4F8B;&#x3001;&#x9002;&#x914D;&#x5668;&#x3001;&#x88C5;&#x9970;&#x5668;&#x3001;&#x4EE3;&#x7406;&#x3001;&#x89C2;&#x5BDF;&#x8005;&#x3001;&#x7B56;&#x7565;&#x3001;&#x6A21;&#x677F;&#x65B9;&#x6CD5;&#x7B49;&#x3002;&#x5728;&#x5B9E;&#x9645;&#x7F16;&#x7801;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4E5F;&#x91C7;&#x7528;&#x4E86;&#x8F83;&#x591A;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x5982;&#x5355;&#x4F8B;&#x3001;&#x4EE3;&#x7406;&#x3001;&#x7B56;&#x7565;&#x7B49;&#x3002;&#x5982;&#x7AD9;&#x5E93;&#x4FE1;&#x606F;&#x67E5;&#x8BE2;&#x7B49;&#x9700;&#x8981;&#x7EDF;&#x8BA1;&#x5728;&#x7EBF;&#x4EBA;&#x6570;&#x7684;&#x529F;&#x80FD;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x8BA1;&#x6570;&#x5668;&#x529F;&#x80FD;&#x6765;&#x7EDF;&#x8BA1;&#x6A21;&#x5757;&#x7684;&#x4F7F;&#x7528;&#x4EBA;&#x6570;&#xFF0C;&#x5728;&#x6B64;&#x7C7B;&#x5BF9;&#x8C61;&#x9700;&#x8981;&#x88AB;&#x5171;&#x4EAB;&#x7684;&#x573A;&#x5408;&#xFF0C;&#x91C7;&#x7528;&#x5355;&#x4F8B;&#x6A21;&#x5F0F;&#x8BBE;&#x8BA1;&#x7684;&#x8BDD;&#x53EA;&#x5141;&#x8BB8;&#x521B;&#x5EFA;&#x4E00;
&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x901A;&#x8FC7;&#x5171;&#x4EAB;&#x8BE5;&#x5BF9;&#x8C61;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x5185;&#x5B58;&#xFF0C;&#x5E76;&#x52A0;&#x5FEB;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x901F;&#x5EA6;&#x3002;&#x901A;&#x8FC7; Spring &#x6846;&#x67B6;&#x4E0E;&#x5408;&#x7406;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x7EC4;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x7F29;&#x77ED;&#x4E86;&#x5F00;&#x53D1;&#x5468;&#x671F;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x5F00;&#x53D1;&#x8D39;&#x7528;&#x548C;&#x7EF4;&#x62A4;&#x8D39;&#x7528;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x5F00;&#x53D1;&#x7684;&#x6210;&#x529F;&#x7387;&#x3002;</p>
<p>&#x6700;&#x540E;&#x662F;&#x6570;&#x636E;&#x5C42;&#x3002;&#x7531;&#x4E8E;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x8BBF;&#x95EE; Oracle&#x3001;SqlServer&#x3001;Mysql &#x7B49;&#x591A;&#x79CD;&#x5F02;&#x6784;&#x6570;&#x636E;&#x5E93;&#x5E73;&#x53F0;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x9700;&#x8981;&#x6EE1;&#x8DB3;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x7BA1;&#x7406;&#x9700;&#x6C42;&#xFF0C;&#x9488;&#x5BF9;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E86;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#x6A21;&#x5F0F;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x63A5;&#x53E3;&#xFF0C;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x7CFB;&#x5217;&#x76F8;&#x5173;&#x6216;&#x76F8;&#x4E92;&#x4F9D;&#x8D56;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;Oracle&#x3001;MySQL&#x3001;SQLServer &#x5206;&#x522B;&#x5EFA;&#x7ACB;&#x62BD;&#x8C61;&#x5DE5;&#x5382;&#xFF0C;&#x5982;&#x6307;&#x5B9A;&#x5F53;&#x524D;&#x5DE5;&#x5382;&#x4E3A; Oracle &#x5DE5;&#x5382;&#xFF0C;&#x5219;&#x521B;&#x5EFA;&#x51FA;&#x6765;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8FDE;&#x63A5;&#xFF0C;&#x6570;&#x636E;&#x96C6;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x5BF9;&#x8C61;&#x90FD;&#x662F;&#x7B26;&#x5408; Oracle &#x64CD;&#x4F5C;&#x8981;&#x6C42;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x4FBF;&#x4E8E;&#x6570;&#x636E;&#x5E93;&#x4E4B;&#x95F4;&#x7684;&#x5207;&#x6362;&#x3002;&#x53E6;&#x5916;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E86; MyBatis &#x4F5C;&#x4E3A;&#x6301;&#x4E45;&#x5C42;&#x6846;&#x67B6;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x548C;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x903B;&#x8F91;&#x5206;&#x79BB;&#xFF0C;&#x4F7F;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x66F4;&#x6613;&#x7EF4;&#x62A4;&#xFF0C;&#x66F4;&#x6613;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#xFF0C;&#x6781;&#x5927;&#x63D0;&#x9AD8;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x9009;&#x62E9; Redis &#x7F13;&#x5B58;&#x63D0;&#x9AD8;&#x4E86;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x548C;&#x8BBF;&#x95EE;&#x6548;&#x7387;&#x3002;&#x9650;&#x4E8E;&#x7BC7;&#x5E45;&#xFF0C;&#x4E0D;&#x518D;&#x8D58;&#x8FF0;&#x3002;
&#x6700;&#x7EC8;&#x9879;&#x76EE;&#x6210;&#x529F;&#x4E0A;&#x7EBF;&#xFF0C;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x4E86;&#x8FD1;&#x4E00;&#x5E74;&#xFF0C;&#x6536;&#x5230;&#x5404;&#x65B9;&#x597D;&#x8BC4;&#x3002;&#x5C24;&#x5176;&#x662F;&#x6807;&#x6746;&#x4E95;&#x63A8;&#x8350;&#x4E0E;&#x8017;&#x7535;&#x91CF;&#x63A8;&#x7B97;&#x529F;&#x80FD;&#xFF0C;&#x4E3A;&#x91C7;&#x6CB9;&#x5382;&#x7684;&#x8282;&#x80FD;&#x5DE5;&#x4F5C;&#x63D0;&#x4F9B;&#x4E86;&#x826F;&#x597D;&#x7684;&#x6280;&#x672F;&#x548C;&#x6570;&#x636E;&#x652F;&#x6301;&#x3002;&#x8BE5;&#x9879;&#x76EE;&#x4E5F;&#x6210;&#x529F;&#x83B7;&#x5F97;&#x4E86;&#x5F53;&#x5E74;&#x5EA6;&#x5206;&#x516C;&#x53F8;&#x79D1;&#x6280;&#x8FDB;&#x6B65;&#x521B;&#x65B0;&#x4E00;&#x7B49;&#x5956;&#x3002;&#x5728;&#x7CFB;&#x7EDF;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5F15;&#x5165;&#x4E86;&#x5C42;&#x6B21;&#x67B6;&#x6784;&#x7684;&#x8BBE;&#x8BA1;
&#x601D;&#x60F3;&#xFF0C;&#x6709;&#x6548;&#x5730;&#x964D;&#x4F4E;&#x4E86;&#x7EF4;&#x62A4;&#x6210;&#x672C;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x653E;&#x6027;&#xFF0C;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x53EF;&#x91CD;&#x7528;&#x6027;&#x4EE5;&#x53CA;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x3002;&#x5F53;&#x7136;&#x8FD8;&#x662F;&#x5B58;&#x5728;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x3002;&#x5982;&#x7CFB;&#x7EDF;&#x91C7;&#x7528; http &#x534F;&#x8BAE;&#xFF0C;&#x6613;&#x88AB;&#x975E;&#x6CD5;&#x52AB;&#x6301;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x534F;&#x8BAE;&#x4FEE;&#x6539;&#x4E3A;https&#x6765;&#x89E3;&#x51B3;&#x3002;&#x8FD8;&#x6709;&#x5C31;&#x662F;&#x65E7;&#x7CFB;&#x7EDF;&#x5728;&#x6570;&#x636E;&#x5E93;&#x5C42;&#x9762;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x65E0;&#x6548;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E0E;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x6027;&#x80FD;&#x9020;&#x6210;&#x4E86;&#x5F71;&#x54CD;&#x3002;&#x5BF9;&#x8FD9;&#x79CD;&#x9AD8;&#x6C34;&#x5E73;&#x9AD8;&#x4EF7;&#x503C;&#x7684;&#x9057;&#x7559;&#x7CFB;&#x7EDF;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x4E86;&#x91CD;&#x6784;&#x6574;&#x5408;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x4E86;&#x6539;&#x9020;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x5EF6;&#x7EED;&#x6027;&#x3002;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x6211;&#x5728;&#x4ECA;&#x540E;&#x7684;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5DE5;&#x4F5C;&#x4E2D;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x4E0E;&#x6539;&#x8FDB;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E5F;&#x662F;&#x65E5;&#x540E;&#x6211;&#x5E94;&#x8BE5;&#x52AA;&#x529B;&#x7684;&#x65B9;&#x5411;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="09-题3-论基于REST服务的Web应用系统设计.html" class="navigation navigation-prev " aria-label="Previous page: 09-题3-论基于REST服务的Web应用系统设计">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../5考试心得/如何跨专业考计算机高级证书.html" class="navigation navigation-next " aria-label="Next page: 第五章 考试心得">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"16-题2-论软件设计模式及其应用","level":"1.3.2","depth":2,"next":{"title":"第五章 考试心得","level":"1.4","depth":1,"path":"5考试心得/如何跨专业考计算机高级证书.md","ref":"5考试心得/如何跨专业考计算机高级证书.md","articles":[{"title":"如何跨专业考计算机高级证书","level":"1.4.1","depth":2,"path":"5考试心得/如何跨专业考计算机高级证书.md","ref":"5考试心得/如何跨专业考计算机高级证书.md","articles":[]},{"title":"系统架构设计师之备考攻略","level":"1.4.2","depth":2,"path":"5考试心得/系统架构设计师之备考攻略.md","ref":"5考试心得/系统架构设计师之备考攻略.md","articles":[]}]},"previous":{"title":"09-题3-论基于REST服务的Web应用系统设计","level":"1.3.1","depth":2,"path":"4论文范文/09-题3-论基于REST服务的Web应用系统设计.md","ref":"4论文范文/09-题3-论基于REST服务的Web应用系统设计.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"4论文范文/16-题2-论软件设计模式及其应用.md","mtime":"2022-10-19T02:12:08.428Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-19T02:43:11.181Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

