
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>论软件三层架构设计 · 系统架构设计师</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Lacuz">
        
        
    
    <link rel="stylesheet" href="../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="09-题3-论基于REST服务的Web应用系统设计.html" />
    
    
    <link rel="prev" href="历年真题/2021.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../">
            
                <a href="../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../readme.html">
            
                <a href="../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="历年真题/总览.html">
            
                <a href="历年真题/总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="历年真题/总览.html">
            
                <a href="历年真题/总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="历年真题/2009.html">
            
                <a href="历年真题/2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="历年真题/2010.html">
            
                <a href="历年真题/2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="历年真题/2011.html">
            
                <a href="历年真题/2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="历年真题/2012.html">
            
                <a href="历年真题/2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="历年真题/2013.html">
            
                <a href="历年真题/2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="历年真题/2014.html">
            
                <a href="历年真题/2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="历年真题/2015.html">
            
                <a href="历年真题/2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="历年真题/2016.html">
            
                <a href="历年真题/2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="历年真题/2017.html">
            
                <a href="历年真题/2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="历年真题/2018.html">
            
                <a href="历年真题/2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="历年真题/2019.html">
            
                <a href="历年真题/2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="历年真题/2020.html">
            
                <a href="历年真题/2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="历年真题/2021.html">
            
                <a href="历年真题/2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter active" data-level="1.3.2" data-path="论软件三层架构设计.html">
            
                <a href="论软件三层架构设计.html">
            
                    
                    论软件三层架构设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="16-题2-论软件设计模式及其应用.html">
            
                <a href="16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href=".." >论软件三层架构设计</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x8BBA;&#x8F6F;&#x4EF6;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;">&#x8BBA;&#x8F6F;&#x4EF6;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;</h1>
<p><strong>&#x6458;&#x8981;&#xFF1A;</strong></p>
<p>&#x672C;&#x4EBA;&#x4E8E; 2018 &#x5E74; 1 &#x6708;&#x53C2;&#x4E0E;&#x4E86;&#x4E2D;&#x77F3;&#x5316; XX &#x6CB9;&#x7530; XX &#x91C7;&#x6CB9;&#x5382;&#x201C;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x201D;&#x7684;&#x9879;&#x76EE;&#x5EFA;&#x8BBE;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x5EFA;&#x8BBE;&#x76EE;&#x6807;&#x662F;&#x5B9E;&#x73B0;&#x5206;&#x5355;&#x4F4D;&#x3001;&#x5206;&#x7EBF;&#x8DEF;&#x3001;&#x5206;&#x7CFB;&#x7EDF;&#x8BC4;&#x4EF7;&#x3001;&#x4F18;&#x5316;&#x3001;&#x8003;&#x6838;&#xFF0C;&#x5168;&#x9762;&#x63D0;&#x5347;&#x91C7;&#x6CB9;&#x5382;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x6C34;&#x5E73;&#x3002;&#x5728;&#x8BE5;&#x9879;&#x76EE;&#x7EC4;&#x4E2D;&#x6211;&#x62C5;&#x4EFB;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x4E00;&#x804C;&#xFF0C;&#x4E3B;&#x8981;&#x8D1F;&#x8D23;&#x7CFB;&#x7EDF;&#x6574;&#x4F53;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x3002;&#x672C;&#x6587;&#x4EE5;&#x8BE5;&#x9879;&#x76EE;&#x4E3A;&#x4F8B;&#xFF0C;&#x8BA8;&#x8BBA;&#x7CFB;&#x7EDF;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x7684;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#xFF0C;&#x91CD;&#x70B9;&#x8BA8;&#x8BBA;&#x7CFB;&#x7EDF;&#x5728;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x548C;&#x5728;&#x8BBE;&#x8BA1;&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x4E2D;&#x78B0;&#x5230;&#x7684;&#x4E00;&#x4E9B;&#x95EE;&#x9898;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x6700;&#x540E;&#x8BF4;&#x660E;&#x91C7;&#x7528;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x6240;&#x5E26;&#x6765;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x4EE5;&#x53CA;&#x53EF;&#x4EE5;&#x6539;&#x8FDB;&#x7684;&#x5730;&#x65B9;&#x3002;&#x5728;&#x6211;&#x7684;&#x5E26;&#x9886;&#x4E0B;&#xFF0C;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x975E;&#x5E38;&#x987A;&#x5229;&#xFF0C;&#x5E76;&#x83B7;&#x5F97;&#x91C7;&#x6CB9;&#x5382;&#x9886;&#x5BFC;&#x53CA;&#x5382;&#x3001;&#x533A;&#x591A;&#x7EA7;&#x7528;&#x6237;&#x7684;&#x4E00;&#x81F4;&#x597D;&#x8BC4;&#xFF0C;&#x8BE5;&#x9879;&#x76EE;&#x4E5F;&#x6210;&#x529F;&#x83B7;&#x5F97;&#x4E86;&#x5F53;&#x5E74;&#x5EA6;&#x5206;&#x516C;&#x53F8;&#x79D1;&#x6280;&#x8FDB;&#x6B65;&#x521B;&#x65B0;&#x4E00;&#x7B49;&#x5956;&#x3002;</p>
<p><strong>&#x6B63;&#x6587;&#xFF1A;</strong></p>
<p>&#x201C;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x201D;&#x9879;&#x76EE;&#x662F;&#x91C7;&#x6CB9;&#x5382;&#x80FD;&#x6E90;&#x7BA1;&#x63A7;&#x4E2D;&#x5FC3;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E2A;&#x5B50;&#x7CFB;&#x7EDF;&#x3002;&#x80FD;&#x6E90;&#x7BA1;&#x63A7;&#x4E2D;&#x5FC3;&#x662F;&#x4E2D;&#x77F3;&#x5316;&#x96C6;&#x56E2;&#x516C;&#x53F8;&#x5341;&#x4E09;&#x4E94;&#x89C4;&#x5212;&#x4E2D;&#x7684;&#x201C;&#x80FD;&#x6548;&#x500D;&#x589E;&#x201D;&#x8BA1;&#x5212;&#x5728;&#x80DC;&#x5229;&#x6CB9;&#x7530;&#x5206;&#x516C;&#x53F8;&#x7684;&#x793A;&#x8303;&#x5E94;&#x7528;&#x9879;&#x76EE;&#xFF0C;&#x8BE5;&#x793A;&#x8303;&#x9879;&#x76EE;&#x80FD;&#x591F;&#x5728;&#x5B9E;&#x73B0;&#x4F01;&#x4E1A;&#x8282;&#x80FD;&#x76EE;&#x6807;&#x7BA1;&#x7406;&#x3001;&#x80FD;&#x6E90;&#x8BA1;&#x91CF;&#x7EDF;&#x8BA1;&#x3001;&#x8282;&#x80FD;&#x6F5C;&#x529B;&#x8BC6;&#x522B;&#x3001;&#x80FD;&#x6548;&#x5206;&#x6790;&#x4F18;&#x5316;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x6709;&#x6548;&#x652F;&#x6491;&#x4F01;&#x4E1A;&#x5B9E;&#x65BD;&#x8282;&#x80FD;&#x6280;&#x672F;&#x6539;&#x9020;&#x3001;&#x4FC3;&#x8FDB;&#x4F01;&#x4E1A;&#x7528;&#x80FD;&#x6C34;&#x5E73;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#x201C;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x201D;&#x7684;&#x5EFA;&#x8BBE;&#x76EE;&#x6807;&#x662F;&#x5EFA;&#x7ACB;&#x8986;&#x76D6;&#x5382;&#x3001;&#x533A;&#x4E24;&#x7EA7;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x4E00;&#x4F53;&#x5316;&#x4F53;&#x7CFB;&#xFF0C;&#x5B9E;&#x73B0;&#x5206;&#x5355;&#x4F4D;&#x3001;&#x5206;&#x7EBF;&#x8DEF;&#x3001;&#x5206;&#x7CFB;&#x7EDF;&#x8BC4;&#x4EF7;&#x3001;&#x4F18;&#x5316;&#x3001;&#x8003;&#x6838;&#xFF0C;&#x8FBE;&#x5230;&#x7535;&#x7F51;&#x8FD0;&#x884C;&#x8D28;&#x91CF;&#x5B9E;&#x65F6;&#x76D1;&#x63A7;&#x3001;&#x5F02;&#x5E38;&#x60C5;&#x51B5;&#x7CBE;&#x51C6;&#x7BA1;&#x63A7;&#x3001;&#x80FD;&#x8017;&#x603B;&#x91CF;&#x5168;&#x9762;&#x53D7;&#x63A7;&#xFF0C;&#x6309;&#x7167;&#x8FD0;&#x884C;&#x4EA7;&#x91CF;&#x7684;&#x65B9;&#x5F0F;&#x8FD0;&#x884C;&#x7535;&#x91CF;&#xFF0C;&#x5168;&#x9762;&#x63D0;&#x5347;&#x91C7;&#x6CB9;&#x5382;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x6C34;&#x5E73;&#x3002;&#x8BE5;&#x9879;&#x76EE;&#x529F;&#x80FD;&#x8BBE;&#x8BA1;&#x53C2;&#x8003; PDCA &#x95ED;&#x73AF;&#x7BA1;&#x7406;&#x7684;&#x7406;&#x5FF5;&#xFF0C;&#x5171;&#x8BBE;&#x8BA1;&#x5305;&#x62EC;&#x7528;&#x7535;&#x8BA1;&#x5212;&#x3001;&#x7528;&#x7535;&#x5206;&#x6790;&#x3001;&#x7528;&#x7535;&#x4F18;&#x5316;&#x3001;&#x7528;&#x7535;&#x8003;&#x6838;&#x3001;&#x8BBE;&#x5907;&#x7BA1;&#x7406;&#x7B49;&#x4E94;&#x5927;&#x529F;&#x80FD;&#x6A21;&#x5757;&#x3002;&#x6211;&#x4F5C;&#x4E3A;&#x5355;&#x4F4D;&#x6280;&#x672F;&#x9AA8;&#x5E72;&#x4E4B;&#x4E00;&#xFF0C;&#x4E3B;&#x6301;&#x5E76;&#x53C2;&#x4E0E;&#x4E86;&#x9879;&#x76EE;&#x8BA1;&#x5212;&#x5236;&#x5B9A;&#x3001;&#x9700;&#x6C42;&#x5206;&#x6790;&#x3001;&#x8BBE;&#x8BA1;&#x3001;&#x7F16;&#x7801;&#x3001;&#x8BBE;&#x8BA1;&#x3001;&#x6D4B;&#x8BD5;&#x7B49;&#x9636;&#x6BB5;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x7531;&#x4E8E;&#x6CB9;&#x7530;&#x7CFB;&#x7EDF;&#x5BF9;&#x5B89;&#x5168;&#x6027;&#x3001;&#x53EF;&#x9760;&#x6027;&#x3001;&#x53EF;&#x7528;&#x6027;&#x548C;&#x6269;&#x5C55;&#x6027;&#x8981;&#x6C42;&#x5F88;&#x9AD8;&#xFF0C;
&#x6211;&#x9009;&#x62E9;&#x4E86;&#x4E09;&#x5C42; B/S &#x67B6;&#x6784;&#x4F5C;&#x4E3A;&#x8BE5;&#x7CFB;&#x7EDF;&#x7684;&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x67B6;&#x6784;&#xFF0C;&#x4E0B;&#x9762;&#xFF0C;&#x6211;&#x5C06;&#x5206;&#x5C42;&#x6B21;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x4E09;&#x5C42; B/S&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x3002;</p>
<h3 id="&#xFF08;1&#xFF09;&#x8868;&#x793A;&#x5C42;&#x91C7;&#x7528;&#x4E86;-html5vue-bootstrap-&#x7B49;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x3002;">&#xFF08;1&#xFF09;&#x8868;&#x793A;&#x5C42;&#x91C7;&#x7528;&#x4E86; HTML5+Vue +BootStrap &#x7B49;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x3002;</h3>
<p>&#x7531;&#x4E8E;&#x7528;&#x6237;&#x63D0;&#x51FA;&#x5168;&#x5382;&#x7684;&#x7535;&#x529B;&#x7CFB;&#x7EDF;&#x62D3;&#x6251;&#x56FE;&#x80FD;&#x591F;&#x81EA;&#x7531;&#x5B9A;&#x5236;&#xFF0C;&#x6211;&#x4EEC;&#x7EFC;&#x5408;&#x8003;&#x8651;&#x591A;&#x79CD;&#x65B9;&#x6848;&#x540E;&#x9009;&#x62E9;&#x4E86;&#x4F7F;&#x7528; HTML5 Canvas &#x6280;&#x672F;&#x6765;&#x5B9E;&#x73B0;&#x7535;&#x529B;&#x7CFB;&#x7EDF;&#x62D3;&#x6251;&#x56FE;&#x7684;&#x81EA;&#x7531;&#x5B9A;&#x5236;&#x3002; HTML5 &#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4E0B;&#x4E00;&#x4EE3;&#x6807;&#x51C6;&#xFF0C;&#x662F;&#x6784;&#x5EFA;&#x4EE5;&#x53CA;&#x5448;&#x73B0;&#x4E92;&#x8054;&#x7F51;&#x5185;&#x5BB9;&#x7684;&#x4E00;&#x79CD;&#x8BED;&#x8A00;&#x65B9;&#x5F0F;&#xFF0E;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x6838;&#x5FC3;&#x6280;&#x672F;&#x4E4B;&#x4E00;&#x3002;&#x6700;&#x7EC8;&#x91C7;&#x7528; HTML5 Canvas &#x6280;&#x672F;&#x5B9E;&#x73B0;&#x7684;&#x62D3;&#x6251;&#x56FE;&#x7684;&#x975E;&#x5E38;&#x8F7B;&#x5DE7;&#xFF0C;&#x6027;&#x80FD;&#x51FA;&#x8272;&#xFF0C;&#x80FD;&#x591F;&#x652F;&#x6301;&#x4E0A;&#x4E07;&#x56FE;&#x5143;&#xFF0C;&#x64CD;&#x4F5C;&#x6D41;&#x7545;&#xFF0C;&#x5E76;&#x4E14;&#x652F;&#x6301;&#x77E2;&#x91CF;&#x56FE;&#x5F62;&#xFF0C;&#x65E0;&#x6781;&#x7F29;&#x653E;&#x7B49;&#x3002;Vue &#x662F;&#x4E00;&#x5957;&#x7528;&#x4E8E;&#x6784;&#x5EFA;&#x7528;&#x6237;&#x754C;&#x9762;&#x7684;&#x6E10;&#x8FDB;&#x5F0F;JavaScript &#x6846;&#x67B6;&#x3002;Vue &#x4E0E;&#x5176;&#x4ED6; JS &#x5E93;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x7684;&#x6838;&#x5FC3;&#x5E93;&#x53EA;&#x5173;&#x6CE8;&#x89C6;&#x56FE;&#x5C42;&#xFF0C;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x5B66;&#x4E60;,&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x4E14;&#x65B9;&#x4FBF;&#x4E0E;&#x7B2C;&#x4E09;&#x65B9;&#x5E93;&#x6216;&#x65E2;&#x6709;&#x9879;&#x76EE;&#x6574;&#x5408;&#x3002;&#x9879;&#x76EE;&#x7EC4;&#x7684;&#x4E24;&#x4E2A;&#x65B0;&#x63A5;&#x89E6; vue &#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x6781;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x5C31;&#x638C;&#x63E1;&#x4E86;&#x76F8;&#x5173;&#x5F00;&#x53D1;&#x6280;&#x5DE7;&#xFF0C;&#x4E3A;&#x9879;&#x76EE;&#x524D;&#x7AEF;&#x7684;&#x5FEB;&#x901F;&#x5F00;&#x53D1;&#x6253;&#x4E0B;&#x4E86;&#x826F;&#x597D;&#x7684;&#x57FA;&#x7840;&#x3002;Bootstrap&#x662F;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#x57FA;&#x4E8E; HTML&#x3001;CSS&#x3001;JS &#x7684;&#x6846;&#x67B6;&#x4E4B;&#x4E00;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5FEB;&#x901F;&#x5F00;&#x53D1; Web &#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x7F51;&#x7AD9;&#x7684;&#x524D;&#x7AEF;&#x6846;&#x67B6;&#x3002;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x57FA;&#x4E8E; Bootstrap &#x7684;&#x7CFB;&#x7EDF;&#x754C;&#x9762;&#x6837;&#x5F0F;&#x53CA;&#x54CD;&#x5E94;&#x5F0F;&#x7684;&#x5C55;&#x73B0;&#x5F62;&#x5F0F;&#x5F97;&#x5230;&#x4E86;&#x5BA2;&#x6237;&#x7684;&#x79F0;&#x8D5E;&#xFF0C;&#x4E3A;&#x540E;&#x7EED;&#x9879;&#x76EE;&#x5DE5;&#x4F5C;&#x7684;&#x5F00;&#x5C55;&#x6253;&#x4E0B;&#x4E86;&#x826F;&#x597D;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<h3 id="&#xFF08;2&#xFF09;&#x4E2D;&#x95F4;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#x91C7;&#x7528;-springmvcapache-shiro&#xFF0C;&#x5E76;&#x4F7F;&#x7528;-ehcache-&#x7F13;&#x5B58;&#x6280;&#x672F;&#x4EE5;&#x63D0;&#x9AD8;&#x8BBF;&#x95EE;&#x6548;&#x7387;&#x3002;">&#xFF08;2&#xFF09;&#x4E2D;&#x95F4;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#x91C7;&#x7528; SpringMVC+Apache Shiro&#xFF0C;&#x5E76;&#x4F7F;&#x7528; ehcache &#x7F13;&#x5B58;&#x6280;&#x672F;&#x4EE5;&#x63D0;&#x9AD8;&#x8BBF;&#x95EE;&#x6548;&#x7387;&#x3002;</h3>
<p>&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E86;&#x5F53;&#x524D;&#x6700;&#x4F18;&#x79C0;&#x7684; MVC &#x6846;&#x67B6;&#x4E4B;&#x4E00;&#x7684; SpringMVC &#x6765;&#x7B80;&#x5316;&#x5F00;&#x53D1;&#xFF0C;&#x4F7F;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x4E13;&#x6CE8;&#x4E8E;&#x8868;&#x793A;&#x903B;&#x8F91;&#x548C;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#xFF0C;SpringMVC &#x662F;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x4E86; Web MVC &#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x7684;&#x8BF7;&#x6C42;&#x9A71;&#x52A8;&#x7C7B;&#x578B;&#x7684;&#x8F7B;&#x91CF;&#x7EA7; Web &#x6846;&#x67B6;&#x3002;&#x901A;&#x8FC7;&#x6846;&#x67B6;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x7F29;&#x77ED;&#x4E86;&#x5F00;&#x53D1;&#x5468;&#x671F;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x5F00;&#x53D1;&#x8D39;&#x7528;
&#x548C;&#x7EF4;&#x62A4;&#x8D39;&#x7528;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x5F00;&#x53D1;&#x7684;&#x6210;&#x529F;&#x7387;&#x3002;&#x57FA;&#x4E8E;&#x5B89;&#x5168;&#x6027;&#x65B9;&#x9762;&#x8003;&#x8651;&#xFF0C;&#x6211;&#x4EEC;&#x9009;&#x62E9; Apache Shiro&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x4E14;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#x7684; Java &#x5B89;&#x5168;&#x6846;&#x67B6;&#xFF0C;&#x4E3A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x76F4;&#x89C2;&#x800C;&#x5168;&#x9762;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x7528;&#x4E8E;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#x3001;&#x6388;&#x6743;&#x3001;&#x52A0;&#x5BC6;&#x548C;&#x4F1A;&#x8BDD;&#x7BA1;&#x7406;&#x3002;&#x901A;&#x8FC7;&#x4F7F;&#x7528; SpringMVC+Apache Shiro
&#x7684;&#x5206;&#x5C42;&#x8BBE;&#x8BA1;&#xFF0C;&#x5B9E;&#x73B0;&#x4E86;&#x5404;&#x5C42;&#x6B21;&#x4F4E;&#x8026;&#x5408;&#xFF0C;&#x9AD8;&#x5185;&#x805A;,&#x5E76;&#x4E25;&#x683C;&#x9075;&#x5FAA;&#x4E86; web &#x5B89;&#x5168;&#x7684;&#x76F8;&#x5173;&#x89C4;&#x8303;&#xFF0C;&#x901A;&#x8FC7;&#x524D;&#x540E;&#x53F0;&#x53CC;&#x91CD;&#x9A8C;&#x8BC1;&#xFF0C;&#x53C2;&#x6570;&#x7F16;&#x7801;&#x4F20;&#x8F93;&#xFF0C;&#x5BC6;&#x7801; SHA-256 &#x52A0;&#x5BC6;&#x5B58;&#x50A8;&#xFF0C;shiro &#x6743;&#x9650;&#x9A8C;&#x8BC1;&#x7B49;&#x624B;&#x6BB5;&#xFF0C;&#x4ECE;&#x6839;&#x672C;&#x4E0A;&#x907F;&#x514D;&#x4E86; SQL &#x6CE8;&#x5165;&#xFF0C;XSS &#x653B;&#x51FB;&#xFF0C;CSRF &#x653B;&#x51FB;&#x7B49;&#x5E38;&#x89C1;&#x7684; web &#x653B;&#x51FB;&#x624B;&#x6BB5;&#x3002;&#x4E3A;&#x9632;&#x6B62;&#x9891;&#x7E41;&#x8BFB;&#x53D6;
&#x6570;&#x636E;&#x5E93;&#x5BFC;&#x81F4;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x4E0B;&#x964D;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x91C7;&#x7528;&#x5F00;&#x6E90;&#x7684; J2Cache &#x4E24;&#x7EA7;&#x7F13;&#x5B58;&#x6846;&#x67B6;&#xFF0C;&#x5373;&#x4E00;&#x7EA7;&#x91C7;&#x7528; Ehcache&#xFF0C;&#x4E8C;&#x7EA7;&#x91C7;&#x7528; Redis &#x7F13;&#x5B58;&#x6280;&#x672F;&#xFF0C;&#x901A;&#x8FC7;&#x8BE5;&#x6846;&#x67B6;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x548C;&#x8BBF;&#x95EE;&#x6548;&#x7387;&#x3002;</p>
<h3 id="&#xFF08;3&#xFF09;&#x6570;&#x636E;&#x5C42;&#x9009;&#x62E9;-mybatis&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x9009;&#x62E9;-oracle-11g&#x3002;">&#xFF08;3&#xFF09;&#x6570;&#x636E;&#x5C42;&#x9009;&#x62E9; MyBatis&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x9009;&#x62E9; Oracle 11g&#x3002;</h3>
<p>&#x6570;&#x636E;&#x5C42;&#x65B9;&#x9762;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E86; MyBatis &#x4F5C;&#x4E3A;&#x6301;&#x4E45;&#x5C42;&#x6846;&#x67B6;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x7B80;&#x5355;&#x7684; XML &#x6216;&#x6CE8;&#x89E3;&#x6765;&#x914D;&#x7F6E;&#x548C;&#x6620;&#x5C04;&#x539F;&#x751F;&#x4FE1;&#x606F;&#xFF0C;&#x5C06;&#x63A5;&#x53E3;&#x548C; Java &#x7684; POJOs(Plain Ordinary Java Object,&#x666E;&#x901A;&#x7684;Java &#x5BF9;&#x8C61;)&#x6620;&#x5C04;&#x6210;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x7684;&#x8BB0;&#x5F55;&#x3002;MyBatis &#x7B80;&#x5355;&#x6613;&#x5B66;&#x3001;&#x7075;&#x6D3B;&#x5E76;&#x4E14;&#x89E3;&#x9664;&#x4E86; sql &#x4E0E;&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;&#x7684;&#x8026;&#x5408;&#xFF0C;&#x901A;&#x8FC7;&#x63D0;&#x4F9B; DAO &#x5C42;&#xFF0C;&#x5C06;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x548C;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x903B;&#x8F91;&#x5206;&#x79BB;&#xFF0C;&#x4F7F;&#x7CFB;&#x7EDF;&#x7684;&#x8BBE;&#x8BA1;&#x66F4;&#x6E05;&#x6670;&#xFF0C;&#x66F4;&#x6613;&#x7EF4;&#x62A4;&#xFF0C;&#x66F4;&#x6613;&#x5355;&#x5143;&#x6D4B;&#x8BD5;&#x3002;&#x8FD9;&#x79CD; sql &#x548C;&#x4EE3;&#x7801;&#x5206;&#x79BB;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6781;&#x5927;&#x63D0;&#x9AD8;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x7EF4;&#x62A4;&#x6027;&#x3002;&#x53E6;&#x5916;&#x57FA;&#x4E8E;&#x5B89;&#x5168;&#x6027;&#x548C;&#x7A33;&#x5B9A;&#x6027;&#x65B9;&#x9762;&#x8003;&#x8651;&#xFF0C;&#x6211;&#x4EEC;&#x9009;&#x62E9;&#x4E86; Oracle 11g &#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x5E93;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5728;&#x8BBE;&#x8BA1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E5F;&#x9047;&#x5230;&#x4E86;&#x4E00;&#x4E9B;&#x56F0;&#x96BE;&#xFF0C;&#x6211;&#x4EEC;&#x4E3B;&#x8981;&#x91C7;&#x53D6;&#x4E86;&#x4EE5;&#x4E0B;&#x7684;&#x529E;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#xFF1A;</p>
<p>&#xFF08;1&#xFF09;&#x7535;&#x529B;&#x62D3;&#x6251;&#x5E93;&#x8BBE;&#x8BA1;&#x3002;&#x9879;&#x76EE;&#x542F;&#x52A8;&#x4F0A;&#x59CB;&#x6240;&#x9762;&#x4E34;&#x6700;&#x5927;&#x7684;&#x96BE;&#x9898;&#x662F;&#x5398;&#x6E05;&#x5168;&#x5382;&#x4E00;&#x767E;&#x591A;&#x6761;&#x4F9B;&#x7535;&#x7EBF;&#x8DEF;&#x53CA;&#x7EBF;&#x8DEF;&#x4E0A;&#x6240;&#x5E26;&#x7684;&#x63D0;&#x5347;&#x3001;&#x6CE8;&#x5165;&#x3001;&#x96C6;&#x8F93;&#x3001;&#x8F6C;&#x4F9B;&#x3001;&#x540E;&#x8F85;&#x7B49;&#x591A;&#x7C7B;&#x7528;&#x7535;&#x6570;&#x636E;&#xFF0C;&#x5B9E;&#x73B0;&#x7EBF;&#x8DEF;&#x7528;&#x7535;&#x6570;&#x636E;&#x7684;&#x95ED;&#x5408;&#x3002;&#x7ECF;&#x8FC7;&#x5BF9;&#x5728;&#x7528;&#x7CFB;&#x7EDF;&#x53CA;&#x6570;&#x636E;&#x5E93;&#x7684;&#x591A;&#x6B21;&#x8C03;&#x7814;&#x5206;&#x6790;&#x53D1;&#x73B0;&#xFF0C;&#x8BE5;&#x5E93;&#x5171;&#x9700;&#x6D89;&#x53CA; EPBP &#x7535;&#x529B;&#x5E93;&#xFF0C;&#x6E90;&#x5934;&#x5E93;&#xFF0C;PCS &#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5382;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x5E93;&#xFF0C;&#x8BBE;&#x5907;&#x6863;&#x6848;&#x5E93;&#x4EE5;&#x53CA;&#x5206;&#x7EBF;&#x8BA1;&#x91CF;&#x5E93;&#x7B49; 6 &#x7C7B;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x6E90;&#xFF0C;&#x6570;&#x636E;&#x5173;&#x7CFB;&#x6781;&#x5176;&#x590D;&#x6742;&#x3002;&#x7531;&#x4E8E;&#x9879;&#x76EE;&#x7EC4;&#x6BD4;&#x8F83;&#x7F3A;&#x4E4F;&#x5B9E;&#x9645;&#x7684;&#x73B0;&#x573A;&#x751F;&#x4EA7;&#x7ECF;&#x9A8C;&#xFF0C;&#x5BF9;&#x8FD9;&#x4E9B;&#x590D;&#x6742;&#x6570;&#x636E;&#x6E90;&#x6BEB;&#x65E0;&#x5934;&#x7EEA;&#xFF0C;&#x65E0;&#x4ECE;&#x4E0B;&#x624B;&#x3002;&#x4F46;&#x901A;&#x8FC7;&#x9879;&#x76EE;&#x7EC4;&#x4E3B;&#x52A8;&#x4E0E;&#x7532;&#x65B9;&#x591A;&#x6B21;&#x91C7;&#x7528;&#x7528;&#x6237;&#x8BBF;&#x8C08;&#x3001;&#x53D1;&#x653E;&#x8C03;&#x67E5;&#x95EE;&#x5377;&#x3001;&#x8054;&#x5408;&#x9700;&#x6C42;&#x8BA1;&#x5212;&#x4F1A;&#x8BAE;&#x53CA;&#x73B0;&#x573A;&#x89C2;&#x6469;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x6C9F;&#x901A;&#xFF0C;&#x5BF9;&#x591A;&#x7C7B;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x6709;&#x4E86;&#x8F83;&#x4E3A;&#x6E05;&#x6670;&#x7684;&#x8BA4;&#x8BC6;&#xFF0C;&#x7ECF;&#x8FC7;&#x9879;&#x76EE;&#x7EC4;&#x7684;&#x5171;&#x540C;&#x52AA;&#x529B;&#x4E0E;&#x7532;&#x65B9;&#x7684;&#x79EF;&#x6781;&#x914D;&#x5408;&#xFF0C;&#x4E2D;&#x95F4;&#x53C8;&#x7ECF;&#x5386;&#x4E86;&#x6570;&#x6B21;&#x8FD4;&#x5DE5;&#x3001;&#x6539;&#x7248;&#xFF0C;&#x6700;&#x7EC8;&#x6210;&#x529F;&#x5B8C;&#x6210;&#x4E86;&#x7535;&#x7F51;&#x62D3;&#x6251;&#x6570;&#x636E;&#x5E93;&#x8BBE;&#x8BA1;&#x3002;&#x5B8C;&#x6210;&#x540E;&#x7684;&#x62D3;&#x6251;&#x5E93;&#x5171;&#x8BBE;&#x8BA1;&#x516D;&#x5341;&#x4F59;&#x5F20;&#x6570;&#x636E;&#x8868;&#xFF0C;&#x8BE5;&#x8BBE;&#x8BA1;&#x903B;&#x8F91;&#x5173;&#x7CFB;&#x6E05;&#x6670;&#x3001;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#xFF0C;&#x4E3A;&#x540E;&#x7EED;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x7684;&#x987A;&#x5229;&#x8FDB;&#x884C;&#x6253;&#x4E0B;&#x4E86;&#x575A;&#x5B9E;&#x7684;&#x57FA;&#x7840;&#x3002;&#x7CFB;&#x7EDF;&#x4E0A;&#x7EBF;&#x540E;&#xFF0C;&#x5168;&#x5382;&#x6BCF;&#x5929;&#x7684;&#x5B9E;&#x9645;&#x7528;&#x7535;&#x7EA6;&#x5728; 110 &#x4E07; kWh &#x5DE6;&#x53F3;&#xFF0C;&#x901A;&#x8FC7;&#x6570;&#x636E;&#x95ED;&#x5408;&#x540E;&#x81EA;&#x52A8;&#x91C7;&#x96C6;&#x7684;&#x7528;&#x7535;&#x6570;&#x636E;&#x8FBE;&#x5230;&#x4E86;
100 &#x4E07; kWh &#x5DE6;&#x53F3;&#xFF0C;&#x7EBF;&#x635F;&#x7EA6;&#x5728; 10%&#x5DE6;&#x53F3;&#xFF0C;&#x57FA;&#x672C;&#x6EE1;&#x8DB3;&#x7EBF;&#x8DEF;&#x8BBE;&#x8BA1;&#x7684;&#x7EBF;&#x635F;&#x8981;&#x6C42;&#xFF0C;&#x5B9E;&#x9645;&#x8FD0;&#x884C;&#x6548;&#x679C;&#x826F;&#x597D;&#xFF0C;&#x8FBE;&#x5230;&#x4E86;&#x5382;&#x9886;&#x5BFC;&#x63D0;&#x51FA;&#x7684;&#x201C;&#x50CF;&#x8FD0;&#x884C;&#x4EA7;&#x91CF;&#x4E00;&#x6837;&#x8FD0;&#x884C;&#x7535;&#x91CF;&#x201D;&#x7684;&#x8981;&#x6C42;&#x3002;</p>
<p>&#xFF08;2&#xFF09;&#x591A;&#x7CFB;&#x7EDF;&#x6570;&#x636E;&#x96C6;&#x6210;&#x3002;&#x91C7;&#x6CB9;&#x5382;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x6D89;&#x53CA;&#x7684;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x5206;&#x6563;&#x5728;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x5E93;&#x4E2D;&#x3002;&#x76EE;&#x524D;&#x6CB9;&#x7530;&#x6CB9;&#x6C34;&#x4E95;&#x65E5;&#x5EA6;&#x751F;&#x4EA7;&#x6570;&#x636E;&#x4E3B;&#x8981;&#x4F7F;&#x7528;&#x6E90;&#x5934;&#x6570;&#x636E;&#x5E93;&#x5B58;&#x50A8;&#xFF0C;&#x5B9E;&#x65F6;&#x6570;&#x636E;&#x91C7;&#x7528;&#x73B0;&#x6709; PCS &#x7CFB;&#x7EDF;&#x6570;&#x636E;&#x5E93;&#x5B58;&#x50A8;&#xFF0C;&#x96C6;&#x8F93;&#x76F8;&#x5173;&#x6570;&#x636E;&#x4F7F;&#x7528;&#x91C7;&#x6CB9;&#x5382;&#x81EA;&#x5EFA;&#x7684;&#x5206;&#x961F;&#x8BA1;&#x91CF;&#x7CFB;&#x7EDF;&#x5E93;&#x5B58;&#x50A8;&#xFF0C;&#x6CE8;&#x6C34;&#x76F8;&#x5173;&#x6570;&#x636E;&#x91C7;&#x7528;&#x6CB9;&#x7530;&#x7EDF;&#x4E00;&#x642D;&#x5EFA;&#x7684; EPBP &#x7CFB;&#x7EDF;&#x5E93;&#x5B58;&#x50A8;&#xFF0C;&#x7535;&#x529B;&#x76F8;&#x5173;&#x6570;&#x636E;&#x7531;&#x7535;&#x529B;&#x5206;&#x516C;&#x53F8;&#x7BA1;&#x7406;&#x548C;&#x5B58;&#x50A8;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x4E0D;&#x540C;&#x5E93;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x636E;&#x5DEE;&#x5F02;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x5BF9;&#x76F8;&#x5173;&#x4E1A;&#x52A1;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7EDF;&#x4E00;&#x5F52;&#x96C6;&#xFF0C;&#x901A;&#x8FC7; ETL &#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6BCF;&#x5929;&#x81EA;&#x52A8;&#x5C06;&#x4E0D;&#x540C;&#x4E1A;&#x52A1;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x62BD;&#x53D6;&#x3001;&#x6E05;&#x6D17;&#x8F6C;&#x6362;&#xFF0C;&#x7136;&#x540E;&#x52A0;&#x8F7D;&#x5230;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x4ECE;&#x800C;&#x5C06;&#x76EE;&#x524D;&#x5206;&#x6563;&#x3001;&#x96F6;&#x4E71;&#x3001;&#x6807;&#x51C6;&#x4E0D;&#x7EDF;&#x4E00;&#x7684;&#x6570;&#x636E;&#x6574;&#x5408;&#x5230;&#x4E00;&#x8D77;&#xFF0C;&#x4E3A;&#x7CFB;&#x7EDF;&#x7684;&#x51B3;&#x7B56;&#x63D0;&#x4F9B;&#x5206;&#x6790;&#x4F9D;&#x636E;&#x3002;
&#x7531;&#x4E8E;&#x8F6F;&#x4EF6;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5F97;&#x5F53;&#xFF0C;&#x5E76;&#x91C7;&#x53D6;&#x4E86;&#x6709;&#x6548;&#x7684;&#x63AA;&#x65BD;&#x53BB;&#x89E3;&#x51B3;&#x8BBE;&#x8BA1;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x6700;&#x540E;&#x6309;&#x8BA1;&#x5212;&#x5B8C;&#x6210;&#x5E76;&#x987A;&#x5229;&#x6295;&#x5165;&#x8FD0;&#x884C;&#xFF0C;&#x4E0D;&#x4F46;&#x4FDD;&#x8BC1;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x653E;&#x6027;&#x3001;&#x53EF;&#x7528;&#x6027;&#x548C;&#x4E92;&#x7528;&#x6027;&#xFF0C;&#x53D6;&#x5F97;&#x4E86;&#x826F;&#x597D;&#x7684;&#x7ECF;&#x6D4E;&#x6548;&#x76CA;&#x548C;&#x7BA1;&#x7406;&#x6548;&#x76CA;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x7684;&#x8F6F;&#x4EF6;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x5F97;&#x5230;&#x4E86;&#x91C7;&#x6CB9;&#x5382;&#x9886;&#x5BFC;&#x548C;&#x5382;&#x3001;&#x533A;&#x4E24;&#x7EA7;&#x7528;&#x6237;&#x7684;&#x4E00;&#x81F4;&#x8BA4;&#x540C;&#x4E0E;&#x79F0;&#x8D5E;&#xFF0C;&#x4E3A;&#x7CFB;&#x7EDF;&#x7684;&#x8BD5;&#x8FD0;&#x884C;&#x6253;&#x4E0B;&#x4E86;&#x826F;&#x597D;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x8BE5;&#x9879;&#x76EE;&#x4E5F;&#x83B7;&#x5F97;&#x4E86;&#x5F53;&#x5E74;&#x5EA6;&#x5206;&#x516C;&#x53F8;&#x79D1;&#x6280;&#x8FDB;&#x6B65;&#x521B;&#x65B0;&#x4E00;&#x7B49;&#x5956;&#x3002;&#x5728;&#x603B;&#x7ED3;&#x7ECF;&#x9A8C;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4E5F;&#x770B;&#x5230;&#x4E86;&#x6211;&#x5728;&#x8F6F;&#x4EF6;&#x4E09;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x4E0D;&#x8DB3;&#x4E4B;&#x5904;&#xFF1A;</p>
<p>&#x9996;&#x5148;&#xFF1A;&#x627E;&#x6807;&#x6746;&#x7B97;&#x6CD5;&#x8FC7;&#x4E8E;&#x7B80;&#x5355;&#x3002;&#x7531;&#x4E8E;&#x6CB9;&#x7530;&#x73B0;&#x6709;&#x6570;&#x636E;&#x8D28;&#x91CF;&#x9650;&#x5236;&#xFF0C;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x7A7A;&#x6570;&#x636E;&#x3001;&#x5047;&#x6570;&#x636E;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x627E;&#x6807;&#x6746;&#x7B97;&#x6CD5;&#x867D;&#x7136;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x7ECF;&#x8FC7;&#x9A8C;&#x8BC1;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x8FC7;&#x7A0B;&#x4E2D;&#x53D1;&#x73B0;&#xFF0C;&#x56DB;&#x9879;&#x4EE5;&#x4E0A;&#x7684;&#x53C2;&#x6570;&#x7EC4;&#x5408;&#x7ECF;&#x5E38;&#x65E0;&#x6CD5;&#x8FD4;&#x56DE;&#x6B63;&#x786E;&#x7ED3;&#x679C;&#xFF0C;&#x8FD9;&#x6837;&#x5BF9;&#x9700;&#x8981;&#x53C2;&#x8003;&#x5BF9;&#x6BD4;&#x7ED3;&#x679C;&#x7684;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x975E;&#x5E38;&#x4E0D;&#x53CB;&#x597D;&#x3002;&#x540E;&#x7EED;&#x6211;&#x4EEC;&#x7ECF;&#x8FC7;&#x591A;&#x6B21;&#x4E0E;&#x76F8;&#x5173;&#x5173;&#x952E;&#x5BA2;&#x6237;&#x5206;&#x6790;&#x8BA8;&#x8BBA;&#xFF0C;&#x7EC8;&#x4E8E;&#x786E;&#x5B9A;&#x4E86;&#x91C7;&#x7528;&#x591A;&#x9879;&#x5355;&#x53C2;&#x6570;&#x6700;&#x4F18;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;
&#x6807;&#x6746;&#x7B5B;&#x9009;&#xFF0C;&#x83B7;&#x5F97;&#x4E86;&#x76F8;&#x5173;&#x5BA2;&#x6237;&#x7684;&#x8BA4;&#x53EF;&#x548C;&#x9886;&#x5BFC;&#x7684;&#x80AF;&#x5B9A;&#x3002;</p>
<p>&#x5176;&#x6B21;&#xFF0C;&#x6570;&#x636E;&#x5E93;&#x5C42;&#x9762;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x65E0;&#x6548;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E0E;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#xFF0C;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x6027;&#x80FD;&#x9020;&#x6210;&#x4E86;&#x5F71;&#x54CD;&#x3002;&#x7531;&#x4E8E;&#x662F;&#x5728;&#x539F;&#x7CFB;&#x7EDF;&#x57FA;&#x7840;&#x4E0A;&#x5F00;&#x53D1;&#x7684;&#x5B50;&#x7CFB;&#x7EDF;&#xFF0C;&#x539F;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B58;&#x5728;&#x5927;&#x91CF;&#x7684;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E0E;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x7528;&#x7535;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x8FC7;&#x591A;&#x6B21;&#x6570;&#x636E;&#x5E93; session &#x8FC7;&#x591A;&#x9020;&#x6210;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x65E0;&#x6CD5;&#x7F16;&#x8BD1;&#x3001;&#x6570;&#x636E;&#x5E93;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x7B49;&#x3002;&#x540E;&#x7EED;&#x7ECF;&#x8FC7;&#x9879;&#x76EE;&#x7EC4;&#x7684;&#x4E0D;&#x61C8;&#x52AA;&#x529B;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;&#x5927;&#x90E8;&#x5206;&#x65E0;&#x6548;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#x6574;&#x5408;&#xFF0C;&#x5BF9;&#x5B9A;&#x65F6;&#x4EFB;&#x52A1;&#x8FDB;&#x884C;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x56F0;&#x6270;&#x5927;&#x5BB6;&#x5DF2;&#x4E45;&#x7684;&#x96BE;&#x9898;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x7B2C;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x901A;&#x8FC7;&#x53CA;&#x65F6;&#x7684;&#x5206;&#x6790;&#x6C9F;&#x901A;&#x548C;&#x5BF9;&#x7B97;&#x6CD5;&#x7684;&#x4F18;&#x5316;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x4E2D;&#x95F4;&#x5C42;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5904;&#x7406;&#x7684;&#x51C6;&#x786E;&#x6027;&#x548C;&#x8868;&#x73B0;&#x5C42;&#x7ED3;&#x679C;&#x89C6;&#x56FE;&#x663E;&#x793A;&#x7684;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x8D28;&#x91CF;&#xFF0C;&#x800C;&#x7B2C;&#x4E8C;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x5BF9;&#x8FD9;&#x79CD;&#x9AD8;&#x6C34;&#x5E73;&#x9AD8;&#x4EF7;&#x503C;&#x7684;&#x9057;&#x7559;&#x7CFB;&#x7EDF;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x91C7;&#x7528;&#x4E86;&#x91CD;&#x6784;&#x6574;&#x5408;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x4E86;&#x6539;&#x9020;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x5EF6;&#x7EED;&#x6027;&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x597D;&#x5730;&#x5F00;&#x5C55;&#x7CFB;&#x7EDF;&#x5206;&#x6790;&#x8BBE;&#x8BA1;&#x5DE5;&#x4F5C;&#xFF0C;&#x6211;&#x4E5F;&#x5C06;&#x5728;&#x4EE5;&#x540E;&#x7684;&#x5DE5;&#x4F5C;&#x5B9E;&#x8DF5;&#x4E2D;&#x4E0D;&#x65AD;&#x5730;&#x5B66;&#x4E60;&#xFF0C;&#x63D0;&#x9AD8;&#x81EA;&#x8EAB;&#x7D20;&#x8D28;&#x548C;&#x80FD;&#x529B;&#xFF0C;&#x4E3A;&#x6211;&#x56FD;&#x8F6F;&#x4EF6;&#x4E8B;&#x4E1A;&#x8D21;&#x732E;&#x81EA;&#x5DF1;&#x5FAE;&#x8584;&#x7684;&#x529B;&#x91CF;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Lacuz 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2022-10-26
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="历年真题/2021.html" class="navigation navigation-prev " aria-label="Previous page: 2021">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="09-题3-论基于REST服务的Web应用系统设计.html" class="navigation navigation-next " aria-label="Next page: 09-题3-论基于REST服务的Web应用系统设计">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"论软件三层架构设计","level":"1.3.2","depth":2,"next":{"title":"09-题3-论基于REST服务的Web应用系统设计","level":"1.3.3","depth":2,"path":"4论文范文/09-题3-论基于REST服务的Web应用系统设计.md","ref":"4论文范文/09-题3-论基于REST服务的Web应用系统设计.md","articles":[]},"previous":{"title":"2021","level":"1.3.1.14","depth":3,"path":"4论文范文/历年真题/2021.md","ref":"4论文范文/历年真题/2021.md","articles":[]},"dir":"ltr"},"config":{"plugins":["expandable-chapters-small","splitter","code","hide-element","pageview-count","popup","tbfed-pagefooter","-sharing","sharing-plus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Lacuz 2020","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"pageview-count":{},"expandable-chapters-small":{},"sharing":{"qq":true,"qzone":true,"weibo":true,"all":["weibo","qq","qzone"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Lacuz","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"系统架构设计师","language":"zh-hans","gitbook":"*","description":"系统架构设计师考试"},"file":{"path":"4论文范文/论软件三层架构设计.md","mtime":"2022-10-26T12:08:37.235Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-26T12:13:22.739Z"},"basePath":"..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../gitbook/gitbook.js"></script>
    <script src="../gitbook/theme.js"></script>
    
        
        <script src="../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

