
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2009 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2010.html" />
    
    
    <link rel="prev" href="总览.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../readme.html">
            
                <a href="../../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.2" data-path="2009.html">
            
                <a href="2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="2010.html">
            
                <a href="2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="2011.html">
            
                <a href="2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="2012.html">
            
                <a href="2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="2013.html">
            
                <a href="2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="2014.html">
            
                <a href="2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="2015.html">
            
                <a href="2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="2016.html">
            
                <a href="2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="2017.html">
            
                <a href="2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="2018.html">
            
                <a href="2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="2019.html">
            
                <a href="2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="2020.html">
            
                <a href="2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="2021.html">
            
                <a href="2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../16-题2-论软件设计模式及其应用.html">
            
                <a href="../16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2009</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2009-&#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;">2009 &#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;</h1>
<h2 id="&#x8BBA;&#x6587;1-&#x8BBA;&#x57FA;&#x4E8E;-dssa-&#x7684;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0E;&#x5E94;&#x7528;">&#x8BBA;&#x6587;1. &#x8BBA;&#x57FA;&#x4E8E; DSSA &#x7684;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0E;&#x5E94;&#x7528;</h2>
<p>&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x8BFE;&#x9898;&#x662F;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8F6F;&#x4EF6;&#x91CD;&#x7528;&#x95EE;&#x9898;&#x3002;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#xFF08;DomainSpecific Software Architecture&#xFF0C;DSSA&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x6709;&#x6548;&#x5B9E;&#x73B0;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x8F6F;&#x4EF6;&#x91CD;&#x7528;&#x7684;&#x624B;&#x6BB5;&#x3002;&#x6309;&#x7167;Tracz&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;DSSA &#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x95EE;&#x9898;&#x9886;&#x57DF;&#x4E2D;&#x7531;&#x9886;&#x57DF;&#x6A21;&#x5211;&#x3001;&#x53C2;&#x8003;&#x9700;&#x6C42;&#x3001;&#x53C2;&#x8003;&#x67B6;&#x6784;&#x7B49;&#x7EC4;&#x6210;&#x7684;&#x5F00;&#x53D1;&#x57FA;&#x7840;&#x67B6;&#x6784;&#xFF0C;&#x5176;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x652F;&#x6301;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x4E2D;&#x591A;&#x4E2A;&#x5E94;&#x7528;&#x7684;&#x751F;&#x6210;&#x3002;</p>
<p>DSSA &#x7684;&#x57FA;&#x672C;&#x6D3B;&#x52A8;&#x5305;&#x62EC;&#x9886;&#x57DF;&#x5206;&#x6790;&#x3001;&#x9886;&#x57DF;&#x8BBE;&#x8BA1;&#x548C;&#x9886;&#x57DF;&#x5B9E;&#x73B0;&#x3002;&#x9886;&#x57DF;&#x5206;&#x6790;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x662F;&#x83B7;&#x5F97;&#x9886;&#x57DF;&#x6A21;&#x578B;&#xFF0C;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x63CF;&#x8FF0;&#x9886;&#x57DF;&#x4E2D;&#x7CFB;&#x7EDF;&#x4E4B;&#x95F4;&#x5171;&#x540C;&#x7684;&#x9700;&#x6C42;&#xFF0C;&#x5373;&#x9886;&#x57DF;&#x9700;&#x6C42;&#xFF1B;&#x9886;&#x57DF;&#x8BBE;&#x8BA1;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x83B7;&#x5F97; DSSA&#xFF0C;DSSA &#x63CF;&#x8FF0;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x4E2D;&#x8868;&#x793A;&#x9700;&#x6C42;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF1A;&#x9886;&#x57DF;&#x5B9E;&#x73B0;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x6807;&#x662F;&#x4F9D;&#x636E;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x548C; DSSA &#x5F00;&#x53D1;&#x548C;&#x7EC4;&#x7EC7;&#x53EF;&#x91CD;&#x7528;&#x4FE1;&#x606F;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x57FA;&#x4E8E; DSSA &#x7684;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E0E;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x5C31;&#x4F60;&#x6240;&#x719F;&#x6089;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x8BF7;&#x7ED9;&#x51FA;&#x9488;&#x5BF9;&#x8BE5;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#xFF0C;&#x5728;&#x57FA;&#x4E8E; DSSA &#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5F00;&#x53D1;&#x4E2D;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x9886;&#x57DF;&#x6A21;&#x578B;&#x3001;&#x53C2;&#x8003;&#x9700;&#x6C42;&#x548C;&#x53C2;&#x8003;&#x67B6;&#x6784;&#x4EE5;&#x53CA;&#x76F8;&#x5E94;&#x7684;&#x652F;&#x6301;&#x73AF;&#x5883;&#x6216;&#x8BBE;&#x65BD;&#x3002;</li>
<li>&#x5177;&#x4F53;&#x9610;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x4F7F;&#x7528; DSSA &#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x5305;&#x62EC;&#x9886;&#x57DF;&#x5206;&#x6790;&#x3001;&#x9886;&#x57DF;&#x8BBE;&#x8BA1;&#x548C;&#x9886;&#x57DF;&#x5B9E;&#x73B0;&#x7B49;&#x6D3B;&#x52A8;&#x662F;&#x5982;&#x4F55;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x7684;&#xFF0C;&#x6700;&#x7EC8;&#x5B9E;&#x9645;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;</li>
</ol>
<h2 id="2-&#x8BBA;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;">2. &#x8BBA;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;</h2>
<p>&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x626E;&#x6F14;&#x7740;&#x91CD;&#x8981;&#x7684;&#x89D2;&#x8272;&#x3002;&#x53EF;&#x4E3A;&#x5DF2;&#x6709;&#x7684;&#x7CFB;&#x7EDF;&#x521B;&#x5EFA;&#x6A21;&#x578B;&#xFF0C;&#x4EE5;&#x4FBF;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#xFF1B;&#x4E5F;&#x53EF;&#x4EE5;&#x9488;&#x5BF9;&#x5F85;&#x5F00;&#x53D1;&#x7684;&#x7CFB;&#x7EDF;&#x521B;&#x5EFA;&#x6A21;&#x578B;&#xFF0C;&#x4F5C;&#x4E3A;&#x8BB0;&#x5F55;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x6216;&#x6280;&#x672F;&#x8BBE;&#x8BA1;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x6A21;&#x578B;&#x662F;&#x5EFA;&#x7ACB;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x7684;&#x57FA;&#x7840;&#x3002;&#x6070;&#x5F53;&#x5730;&#x8FD0;&#x7528;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#xFF0C;&#x662F;&#x6210;&#x529F;&#x5730;&#x8FDB;&#x884C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x73AF;&#x8282;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8BBA;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BBA;&#x8FF0;&#x5E38;&#x89C1;&#x7684;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#xFF08;&#x5305;&#x62EC;&#x6BCF;&#x79CD;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x7684;&#x6838;&#x5FC3;&#x601D;&#x60F3;&#x4EE5;&#x53CA;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x6A21;&#x578B;&#xFF09;&#x3002;</li>
<li>&#x5177;&#x4F53;&#x9610;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x9009;&#x62E9;&#x4F7F;&#x7528;&#x7684;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x4EE5;&#x53CA;&#x9009;&#x62E9;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x7ED9;&#x51FA;&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x548C;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x3002;</li>
</ol>
<h2 id="3-&#x8BBA;&#x57FA;&#x4E8E;-rest-&#x670D;&#x52A1;&#x7684;-web-&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;">3. &#x8BBA;&#x57FA;&#x4E8E; REST &#x670D;&#x52A1;&#x7684; Web &#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;</h2>
<p>REST&#xFF08;REpresentational State Transfer&#xFF09;&#x662F;&#x6307;&#x4ECE;&#x51E0;&#x79CD;&#x57FA;&#x4E8E;&#x7F51;&#x7EDC;&#x7684;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x884D;&#x751F;&#x51FA;&#x6765;&#x7684;&#x4E00;&#x79CD;&#x6DF7;&#x5408;&#x67B6;&#x6784;&#x98CE;&#x683C;&#xFF0C;&#x5B83;&#x662F;&#x76EE;&#x524D;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x6838;&#x5FC3;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x3002;&#x57FA;&#x4E8E; REST &#x670D;&#x52A1;&#xFF08;RESTful Service&#xFF09;&#x7684;Web &#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x4EFB;&#x52A1;&#x4E3B;&#x8981;&#x5305;&#x62EC;&#xFF1A;&#x8BC6;&#x522B;&#x5E76;&#x8BBE;&#x8BA1; REST &#x98CE;&#x683C;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x91C7;&#x7528;&#x9762;&#x5411;&#x670D;&#x52A1;&#x7684;&#x601D;&#x60F3;&#x8FDB;&#x884C;REST &#x670D;&#x52A1;&#x96C6;&#x6210;&#x3002;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x8BBE;&#x8BA1;&#x7684; Web &#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x7ED3;&#x5408; REST &#x98CE;&#x683C;&#x548C;&#x9762;&#x5411;&#x670D;&#x52A1;&#x601D;&#x60F3;&#x7684;&#x4F18;&#x70B9;&#xFF0C;&#x8FD1;&#x5E74;&#x6765;&#x53D7;&#x5230;&#x4E86;&#x5E7F;&#x6CDB;&#x7684;&#x5173;&#x6CE8;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x57FA;&#x4E8E; REST &#x670D;&#x52A1;&#x7684; Web &#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5B9E;&#x65BD;&#x7684; Web &#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7B80;&#x8981;&#x53D9;&#x8FF0;&#x4E0E;&#x4F20;&#x7EDF;&#x7684; Web &#x670D;&#x52A1;&#x76F8;&#x6BD4;&#xFF0C;&#x91C7;&#x7528; REST &#x670D;&#x52A1;&#x6784;&#x5EFA;&#x7684; Web &#x5E94;&#x7528;&#x5177;&#x6709;&#x54EA;&#x4E9B;&#x4F18;&#x52BF;&#x548C;&#x4E0D;&#x8DB3;&#x3002;</li>
<li>&#x9610;&#x8FF0;&#x4F60;&#x5728;&#x8BBE;&#x8BA1;&#x57FA;&#x4E8E; REST &#x670D;&#x52A1;&#x7684; Web &#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x65F6;&#x9047;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x3002;</li>
</ol>
<h2 id="4-&#x8BBA;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x4E0E;&#x5E94;&#x7528;">4. &#x8BBA;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x4E0E;&#x5E94;&#x7528;</h2>
<p>&#x76EE;&#x524D;&#x5728;&#x4F01;&#x4E1A;&#x4E2D;&#xFF0C;&#x4EE5;&#x8F6F;&#x4EF6;&#x4E3A;&#x6838;&#x5FC3;&#x7684;&#x4EA7;&#x54C1;&#x5F97;&#x5230;&#x4E86;&#x5E7F;&#x6CDB;&#x7684;&#x5E94;&#x7528;&#x3002;&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x4E2D;&#x8F6F;&#x4EF6;&#x90E8;&#x5206;&#x6BD4;&#x4F8B;&#x7684;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#xFF0C;&#x4F7F;&#x5F97;&#x7CFB;&#x7EDF;&#x5BF9;&#x8F6F;&#x4EF6;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#xFF0C;&#x5BF9;&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x9760;&#x6027;&#x8981;&#x6C42;&#x4E5F;&#x8D8A;&#x6765;&#x8D8A;&#x9AD8;&#x3002;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x4E0E;&#x5176;&#x5B83;&#x8D28;&#x91CF;&#x5C5E;&#x6027;&#x4E00;&#x6837;&#xFF0C;&#x662F;&#x8861;&#x91CF;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x7684;&#x91CD;&#x8981;&#x6307;&#x6807;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x4E2D;&#x5DF2;&#x6709;&#x5F88;&#x591A;&#x6BD4;&#x8F83;&#x6210;&#x719F;&#x7684;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#xFF0C;&#x5982;&#x7ED3;&#x6784;&#x5316;&#x8BBE;&#x8BA1;&#x3001;&#x6A21;&#x5757;&#x5316;&#x8BBE;&#x8BA1;&#x3001;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#x8BBE;&#x8BA1;&#x7B49;&#xFF0C;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x4E3A;&#x4FDD;&#x969C;&#x8F6F;&#x4EF6;&#x7684;&#x6574;&#x4F53;&#x8D28;&#x91CF;&#x53D1;&#x6325;&#x4E86;&#x91CD;&#x8981;&#x4F5C;&#x7528;&#x3002;&#x5728;&#x6B64;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x4E3A;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x63D0;&#x9AD8;&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x9760;&#x6027;&#xFF0C;&#x901A;&#x5E38;&#x4F1A;&#x91C7;&#x7528;&#x4E00;&#x4E9B;&#x7279;&#x6B8A;&#x7684;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#xFF0C;&#x5373;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x3002;</p>
<p>&#x5728;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x5DE5;&#x7A0B;&#x4F53;&#x7CFB;&#x4E2D;&#xFF0C;&#x5305;&#x542B;&#x6709;&#x53EF;&#x9760;&#x6027;&#x6A21;&#x578B;&#x4E0E;&#x9884;&#x6D4B;&#x3001;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x548C;&#x53EF;&#x9760;&#x6027;&#x6D4B;&#x8BD5;&#x65B9;&#x6CD5;&#x7B49;&#x3002;&#x5B9E;&#x8DF5;&#x8BC1;&#x660E;&#xFF0C;&#x4FDD;&#x969C;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6700;&#x6709;&#x6548;&#x3001;&#x6700;&#x7ECF;&#x6D4E;&#x3001;&#x6700;&#x91CD;&#x8981;&#x7684;&#x624B;&#x6BB5;&#x662F;&#x5728;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x9636;&#x6BB5;&#x91C7;&#x53D6;&#x63AA;&#x65BD;&#x8FDB;&#x884C;&#x53EF;&#x9760;&#x6027;&#x63A7;&#x5236;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x4E0E;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5B9E;&#x65BD;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7B80;&#x8981;&#x53D9;&#x8FF0;&#x5F71;&#x54CD;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x7684;&#x56E0;&#x7D20;&#x6709;&#x54EA;&#x4E9B;&#x3002;</li>
<li>&#x9610;&#x8FF0;&#x5E38;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x4EE5;&#x53CA;&#x4F60;&#x5982;&#x4F55;&#x5E94;&#x7528;&#x5230;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="总览.html" class="navigation navigation-prev " aria-label="Previous page: 总览">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2010.html" class="navigation navigation-next " aria-label="Next page: 2010">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2009","level":"1.3.1.2","depth":3,"next":{"title":"2010","level":"1.3.1.3","depth":3,"path":"4论文范文/历年真题/2010.md","ref":"4论文范文/历年真题/2010.md","articles":[]},"previous":{"title":"总览","level":"1.3.1.1","depth":3,"path":"4论文范文/历年真题/总览.md","ref":"4论文范文/历年真题/总览.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"4论文范文/历年真题/2009.md","mtime":"2022-10-20T17:55:30.882Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-20T18:50:19.495Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

