
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2010 · 系统架构设计师</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Lacuz">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2011.html" />
    
    
    <link rel="prev" href="2009.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../readme.html">
            
                <a href="../../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="2009.html">
            
                <a href="2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.3" data-path="2010.html">
            
                <a href="2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="2011.html">
            
                <a href="2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="2012.html">
            
                <a href="2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="2013.html">
            
                <a href="2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="2014.html">
            
                <a href="2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="2015.html">
            
                <a href="2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="2016.html">
            
                <a href="2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="2017.html">
            
                <a href="2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="2018.html">
            
                <a href="2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="2019.html">
            
                <a href="2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="2020.html">
            
                <a href="2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="2021.html">
            
                <a href="2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../16-题2-论软件设计模式及其应用.html">
            
                <a href="../16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2010</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2010-&#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;">2010 &#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;</h1>
<h2 id="&#x8BBA;&#x6587;1-&#x8BBA;&#x8F6F;&#x4EF6;&#x7684;&#x9759;&#x6001;&#x6F14;&#x5316;&#x548C;&#x52A8;&#x6001;&#x6F14;&#x5316;&#x53CA;&#x5176;&#x5E94;&#x7528;">&#x8BBA;&#x6587;1. &#x8BBA;&#x8F6F;&#x4EF6;&#x7684;&#x9759;&#x6001;&#x6F14;&#x5316;&#x548C;&#x52A8;&#x6001;&#x6F14;&#x5316;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x8F6F;&#x4EF6;&#x6F14;&#x5316;&#xFF08;Software Evolution&#xFF09;&#x662F;&#x6307;&#x8F6F;&#x4EF6;&#x5728;&#x5176;&#x751F;&#x547D;&#x5468;&#x671F;&#x5185;&#x7684;&#x66F4;&#x65B0;&#x884C;&#x4E3A;&#x548C;&#x8FC7;&#x7A0B;&#x3002;&#x6F14;&#x5316;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x8D2F;&#x7A7F;&#x8F6F;&#x4EF6;&#x751F;&#x547D;&#x5468;&#x671F;&#x59CB;&#x7EC8;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x6539;&#x53D8;&#x3001;&#x529F;&#x80FD;&#x5B9E;&#x73B0;&#x589E;&#x5F3A;&#x3001;&#x65B0;&#x529F;&#x80FD;&#x52A0;&#x5165;&#x3001;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x6539;&#x53D8;&#x3001;&#x8F6F;&#x4EF6;&#x7F3A;&#x9677;&#x4FEE;&#x590D;&#x3001;&#x8FD0;&#x884C;&#x73AF;&#x5883;&#x6539;&#x53D8;&#x5747;&#x8981;&#x6C42;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x9002;&#x5E94;&#x53D8;&#x5316;&#xFF0C;&#x5177;&#x6709;&#x8F83;&#x5F3A;&#x7684;&#x6F14;&#x5316;&#x80FD;&#x529B;&#x3002;&#x8F6F;&#x4EF6;&#x9759;&#x6001;&#x6F14;&#x5316;&#xFF08;Static Evolution&#xFF09;&#x548C;&#x52A8;&#x6001;&#x6F14;&#x5316;&#xFF08;Dynamic Evolution&#xFF09;&#x662F;&#x76EE;&#x524D;&#x8F6F;&#x4EF6;&#x6F14;&#x5316;&#x7684;&#x4E24;&#x79CD;&#x91CD;&#x8981;&#x7C7B;&#x578B;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8F6F;&#x4EF6;&#x7684;&#x9759;&#x6001;&#x6F14;&#x5316;&#x548C;&#x52A8;&#x6001;&#x6F14;&#x5316;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BF7;&#x5206;&#x522B;&#x5BF9;&#x8F6F;&#x4EF6;&#x9759;&#x6001;&#x6F14;&#x5316;&#x548C;&#x52A8;&#x6001;&#x6F14;&#x5316;&#x7684;&#x7279;&#x70B9;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#xFF0C;&#x8BF4;&#x660E;&#x4E24;&#x79CD;&#x8F6F;&#x4EF6;&#x6F14;&#x5316;&#x7C7B;&#x578B;&#x5404;&#x81EA;&#x7684;&#x4F18;&#x7F3A;&#x70B9;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x573A;&#x5408;&#xFF0C;&#x5E76;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x5404;&#x81EA;&#x7684;&#x5E38;&#x89C1;&#x6F14;&#x5316;&#x6280;&#x672F;&#x624B;&#x6BB5;&#x3002;</li>
<li>&#x5177;&#x4F53;&#x9610;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x6240;&#x8FDB;&#x884C;&#x7684;&#x8F6F;&#x4EF6;&#x6F14;&#x5316;&#x6D3B;&#x52A8;&#x7684;&#x7279;&#x70B9;&#x3001;&#x6F14;&#x5316;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x4EE5;&#x53CA;&#x6240;&#x91C7;&#x53D6;&#x7684;&#x5BF9;&#x5E94;&#x6F14;&#x5316;&#x6280;&#x672F;&#x624B;&#x6BB5;&#xFF0C;&#x8BF4;&#x660E;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x4EE5;&#x53CA;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x7684;&#x6548;&#x679C;&#x3002;</li>
</ol>
<h2 id="2-&#x8BBA;&#x6570;&#x636E;&#x6316;&#x6398;&#x6280;&#x672F;&#x7684;&#x5E94;&#x7528;">2. &#x8BBA;&#x6570;&#x636E;&#x6316;&#x6398;&#x6280;&#x672F;&#x7684;&#x5E94;&#x7528;</h2>
<p>&#x968F;&#x7740;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x7684;&#x9AD8;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x5404;&#x7EC4;&#x7EC7;&#x673A;&#x6784;&#x79EF;&#x7D2F;&#x7684;&#x6570;&#x636E;&#x91CF;&#x6025;&#x5267;&#x589E;&#x957F;&#x3002;&#x5982;&#x4F55;&#x4ECE;&#x6D77;&#x91CF;&#x7684;&#x6570;&#x636E;&#x4E2D;&#x63D0;&#x53D6;&#x6709;&#x7528;&#x7684;&#x77E5;&#x8BC6;&#x6210;&#x4E3A;&#x5F53;&#x52A1;&#x4E4B;&#x6025;&#x3002;&#x6570;&#x636E;&#x6316;&#x6398;&#xFF08;Data Mining&#xFF09;&#x5C31;&#x662F;&#x4E3A;&#x987A;&#x5E94;&#x8FD9;&#x79CD;&#x9700;&#x8981;&#x5E94;&#x8FD0;&#x800C;&#x751F;&#x53D1;&#x5C55;&#x8D77;&#x6765;&#x7684;&#x6570;&#x636E;&#x5904;&#x7406;&#x6280;&#x672F;&#xFF0C;&#x662F;&#x77E5;&#x8BC6;&#x53D1;&#x73B0;&#x7684;&#x5173;&#x952E;&#x6B65;&#x9AA4;&#x3002;&#x6570;&#x636E;&#x6316;&#x6398;&#x5C31;&#x662F;&#x4ECE;&#x5927;&#x91CF;&#x7684;&#x3001;&#x4E0D;&#x5B8C;&#x5168;&#x7684;&#x3001;&#x6709;&#x566A;&#x58F0;&#x7684;&#x3001;&#x6A21;&#x7CCA;&#x7684;&#x3001;&#x968F;&#x673A;&#x7684;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x6570;&#x636E;&#x4E2D;&#xFF0C;&#x63D0;&#x53D6;&#x9690;&#x542B;&#x5728;&#x5176;&#x4E2D;&#x7684;&#x3001;&#x4EBA;&#x4EEC;&#x4E8B;&#x5148;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x3001;&#x4F46;&#x53C8;&#x662F;&#x6F5C;&#x5728;&#x6709;&#x7528;&#x7684;&#x4FE1;&#x606F;&#x548C;&#x77E5;&#x8BC6;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8BBA;&#x6570;&#x636E;&#x6316;&#x6398;&#x6280;&#x672F;&#x7684;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x5BF9;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x6570;&#x636E;&#x6316;&#x6398;&#x7684;&#x4E3B;&#x8981;&#x4EFB;&#x52A1;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;&#x5177;&#x4F53;&#x8BBA;&#x8FF0;&#x4F60;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x4F7F;&#x7528;&#x6570;&#x636E;&#x6316;&#x6398;&#x6280;&#x672F;&#x6240;&#x89E3;&#x51B3;&#x7684;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x6570;&#x636E;&#x6316;&#x6398;&#x7684;&#x65B9;&#x6CD5;&#x4E3B;&#x8981;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x5206;&#x6790;&#x5E76;&#x8BA8;&#x8BBA;&#x4F60;&#x6240;&#x9009;&#x62E9;&#x7684;&#x6570;&#x636E;&#x6316;&#x6398;&#x65B9;&#x6CD5;&#xFF0C;&#x7B80;&#x8FF0;&#x5176;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x8FC7;&#x7A0B;&#x548C;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x6548;&#x679C;&#x3002;</li>
</ol>
<h2 id="3-&#x8BBA;&#x5927;&#x89C4;&#x6A21;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7F13;&#x5B58;&#x8BBE;&#x8BA1;&#x7B56;&#x7565;">3. &#x8BBA;&#x5927;&#x89C4;&#x6A21;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7F13;&#x5B58;&#x8BBE;&#x8BA1;&#x7B56;&#x7565;</h2>
<p>&#x5927;&#x89C4;&#x6A21;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x9700;&#x8981;&#x5229;&#x7528;&#x7F13;&#x5B58;&#x6280;&#x672F;&#x51CF;&#x8F7B;&#x670D;&#x52A1;&#x5668;&#x8D1F;&#x8F7D;&#x3001;&#x964D;&#x4F4E;&#x7F51;&#x7EDC;&#x62E5;&#x585E;&#x3001;&#x589E;&#x5F3A;&#x7CFB;&#x7EDF;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;&#x7F13;&#x5B58;&#x6280;&#x672F;&#x7684;&#x57FA;&#x672C;&#x601D;&#x60F3;&#x662F;&#x5C06;&#x5BA2;&#x6237;&#x6700;&#x8FD1;&#x7ECF;&#x5E38;&#x8BBF;&#x95EE;&#x7684;&#x5185;&#x5BB9;&#x5728;&#x7F13;&#x5B58;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x5B58;&#x653E;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x5F53;&#x8BE5;&#x5185;&#x5BB9;&#x4E0B;&#x6B21;&#x88AB;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x4E0D;&#x5FC5;&#x5EFA;&#x7ACB;&#x65B0;&#x7684;&#x6570;&#x636E;&#x8BF7;&#x6C42;&#xFF0C;&#x800C;&#x662F;&#x76F4;&#x63A5;&#x7531;&#x7F13;&#x5B58;&#x63D0;&#x4F9B;&#x3002;&#x826F;&#x597D;&#x7684;&#x7F13;&#x5B58;&#x8BBE;&#x8BA1;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x89C4;&#x6A21;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x6B63;&#x5E38;&#x3001;&#x9AD8;&#x6548;&#x8FD0;&#x884C;&#x7684;&#x5FC5;&#x8981;&#x524D;&#x63D0;&#x3002;&#x5728;&#x8FDB;&#x884C;&#x5927;&#x89C4;&#x6A21;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x65F6;&#xFF0C;&#x5FC5;&#x987B;&#x4ECE;&#x4E00;&#x5F00;&#x59CB;&#x5C31;&#x9488;&#x5BF9;&#x5E94;&#x7528;&#x9700;&#x6C42;&#x548C;&#x573A;&#x666F;&#x5BF9;&#x7CFB;&#x7EDF;&#x7684;&#x7F13;&#x5B58;&#x673A;&#x5236;&#x8FDB;&#x884C;&#x5168;&#x9762;&#x8003;&#x8651;&#xFF0C;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x53EF;&#x4F38;&#x7F29;&#x7684;&#x7CFB;&#x7EDF;&#x7F13;&#x5B58;&#x67B6;&#x6784;&#x3002;
<strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x5927;&#x89C4;&#x6A21;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7F13;&#x5B58;&#x8BBE;&#x8BA1;&#x7B56;&#x7565;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5B9E;&#x65BD;&#x7684;&#x5927;&#x89C4;&#x6A21;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x4ECE;&#x4E0D;&#x540C;&#x7684;&#x7528;&#x9014;&#x548C;&#x5E94;&#x7528;&#x573A;&#x666F;&#x8003;&#x8651;&#xFF0C;&#x8BF7;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x81F3;&#x5C11;&#x4E24;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x7F13;&#x5B58;&#x5DE5;&#x4F5C;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x8BF4;&#x660E;&#x6BCF;&#x79CD;&#x5DE5;&#x4F5C;&#x6A21;&#x5F0F;&#x7684;&#x9002;&#x5E94;&#x573A;&#x666F;&#x3002;</li>
<li>&#x9610;&#x8FF0;&#x4F60;&#x5728;&#x8BBE;&#x8BA1;&#x5927;&#x89C4;&#x6A21;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7684;&#x7F13;&#x5B58;&#x673A;&#x5236;&#x65F6;&#x9047;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x3002;</li>
</ol>
<h2 id="4-&#x8BBA;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BC4;&#x4EF7;">4. &#x8BBA;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BC4;&#x4EF7;</h2>
<p>&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BC4;&#x4EF7;&#x662F;&#x6307;&#x9009;&#x7528;&#x548C;&#x5EFA;&#x7ACB;&#x5408;&#x9002;&#x7684;&#x53EF;&#x9760;&#x6027;&#x6570;&#x5B66;&#x6A21;&#x578B;&#xFF0C;&#x8FD0;&#x7528;&#x7EDF;&#x8BA1;&#x6280;&#x672F;&#x548C;&#x5176;&#x4ED6;&#x624B;&#x6BB5;&#xFF0C;&#x5BF9;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6D4B;&#x8BD5;&#x548C;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x671F;&#x95F4;&#x7684;&#x8F6F;&#x4EF6;&#x5931;&#x6548;&#x6570;&#x636E;&#xFF08;&#x4E5F;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x8F6F;&#x4EF6;&#x751F;&#x547D;&#x5468;&#x671F;&#x5185;&#x5176;&#x4ED6;&#x53EF;&#x9760;&#x6027;&#x6570;&#x636E;&#xFF09;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x5E76;&#x8BC4;&#x4F30;&#x548C;&#x9884;&#x6D4B;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BC4;&#x4EF7;&#x662F;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6D3B;&#x52A8;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x65E2;&#x53EF;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x5B9E;&#x65BD;&#xFF0C;&#x4E5F;&#x53EF;&#x9488;&#x5BF9;&#x6700;&#x7EC8;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5B9E;&#x65BD;&#x3002;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BC4;&#x4EF7;&#x7684;&#x96BE;&#x70B9;&#x5728;&#x4E8E;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6A21;&#x578B;&#x7684;&#x9009;&#x62E9;&#x548C;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6570;&#x636E;&#x7684;&#x6536;&#x96C6;&#x4E0E;&#x5904;&#x7406;&#x3002;
<strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BC4;&#x4EF7;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x7B80;&#x8981;&#x6982;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5B9E;&#x65BD;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BF4;&#x660E;&#x4F60;&#x5728;&#x9879;&#x76EE;&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x9009;&#x62E9;&#x7684;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x8BBA;&#x8FF0;&#x5728;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6A21;&#x578B;&#x9009;&#x62E9;&#x65F6;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x7684;&#x4E3B;&#x8981;&#x56E0;&#x7D20;&#x3002;</li>
<li>&#x6536;&#x96C6;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6570;&#x636E;&#x65F6;&#x7ECF;&#x5E38;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x7B80;&#x8FF0;&#x4F60;&#x6536;&#x96C6;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6570;&#x636E;&#x65F6;&#x6240;&#x9047;&#x5230;&#x7684;&#x5177;&#x4F53;&#x95EE;&#x9898;&#x53CA;&#x89E3;&#x51B3;&#x7684;&#x65B9;&#x6CD5;&#x3002; </li>
</ol>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Lacuz 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2022-10-24
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2009.html" class="navigation navigation-prev " aria-label="Previous page: 2009">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2011.html" class="navigation navigation-next " aria-label="Next page: 2011">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2010","level":"1.3.1.3","depth":3,"next":{"title":"2011","level":"1.3.1.4","depth":3,"path":"4论文范文/历年真题/2011.md","ref":"4论文范文/历年真题/2011.md","articles":[]},"previous":{"title":"2009","level":"1.3.1.2","depth":3,"path":"4论文范文/历年真题/2009.md","ref":"4论文范文/历年真题/2009.md","articles":[]},"dir":"ltr"},"config":{"plugins":["expandable-chapters-small","splitter","code","hide-element","pageview-count","popup","tbfed-pagefooter","-sharing","sharing-plus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Lacuz 2020","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"pageview-count":{},"expandable-chapters-small":{},"sharing":{"qq":true,"qzone":true,"weibo":true,"all":["weibo","qq","qzone"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Lacuz","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"系统架构设计师","language":"zh-hans","gitbook":"*","description":"系统架构设计师考试"},"file":{"path":"4论文范文/历年真题/2010.md","mtime":"2022-10-24T06:28:55.563Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-25T03:33:23.984Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

