
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2011 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2012.html" />
    
    
    <link rel="prev" href="2010.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../readme.html">
            
                <a href="../../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="2009.html">
            
                <a href="2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="2010.html">
            
                <a href="2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.4" data-path="2011.html">
            
                <a href="2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="2012.html">
            
                <a href="2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="2013.html">
            
                <a href="2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="2014.html">
            
                <a href="2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="2015.html">
            
                <a href="2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="2016.html">
            
                <a href="2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="2017.html">
            
                <a href="2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="2018.html">
            
                <a href="2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="2019.html">
            
                <a href="2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="2020.html">
            
                <a href="2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="2021.html">
            
                <a href="2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../16-题2-论软件设计模式及其应用.html">
            
                <a href="../16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2011</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2011-&#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;">2011 &#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;</h1>
<h2 id="&#x8BBA;&#x6587;1-&#x8BBA;&#x6A21;&#x578B;&#x9A71;&#x52A8;&#x67B6;&#x6784;&#x5728;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x4E2D;&#x7684;&#x5E94;&#x7528;">&#x8BBA;&#x6587;1. &#x8BBA;&#x6A21;&#x578B;&#x9A71;&#x52A8;&#x67B6;&#x6784;&#x5728;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x4E2D;&#x7684;&#x5E94;&#x7528;</h2>
<p>&#x6A21;&#x578B;&#x9A71;&#x52A8;&#x67B6;&#x6784;&#xFF08;Model Driven Architecture&#xFF0C;MDA&#xFF09;&#x662F;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x7EC4;&#x7EC7;&#x63D0;&#x51FA;&#x7684;&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x67B6;&#x6784;&#x65B9;&#x6CD5;&#x5B66;&#xFF0C;&#x5B83;&#x57FA;&#x4E8E; UML &#x4EE5;&#x53CA;&#x4E00;&#x7CFB;&#x5217;&#x5DE5;&#x4E1A;&#x6807;&#x51C6;&#xFF0C;&#x80FD;&#x591F;&#x652F;&#x6301;&#x57FA;&#x4E8E;&#x53EF;&#x89C6;&#x5316;&#x6A21;&#x578B;&#x9A71;&#x52A8;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x3001;&#x5185;&#x5BB9;&#x5B58;&#x50A8;&#x4E0E;&#x4EA4;&#x6362;&#x3002;MDA &#x6838;&#x5FC3;&#x601D;&#x60F3;&#x662F;&#x62BD;&#x8C61;&#x51FA;&#x4E0E;&#x5B9E;&#x73B0;&#x6280;&#x672F;&#x65E0;&#x5173;&#x3001;&#x5B8C;&#x6574;&#x63CF;&#x8FF0;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x7684;&#x6838;&#x5FC3;&#x5E73;&#x53F0;&#x65E0;&#x5173;&#x6A21;&#x578B;&#xFF08;PIM&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x5B9E;&#x73B0;&#x6280;&#x672F;&#x5236;&#x5B9A;&#x591A;&#x4E2A;&#x6620;&#x5C04;&#x89C4;&#x5219;&#xFF0C;&#x901A;&#x8FC7;&#x6620;&#x5C04;&#x89C4;&#x5219;&#x548C;&#x8F85;&#x52A9;&#x5DE5;&#x5177;&#x5C06;PIM &#x8F6C;&#x6362;&#x6210;&#x4E0E;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x6280;&#x672F;&#x6709;&#x5173;&#x7684;&#x5E73;&#x53F0;&#x76F8;&#x5173;&#x6A21;&#x578B;&#xFF08;PSM&#xFF09;&#xFF0C;&#x6700;&#x540E;&#x5B8C;&#x6210;PSM&#x5230;&#x4EE3;&#x7801;&#x7684;&#x8F6C;&#x6362;&#x3002;&#x901A;&#x8FC7; PIM &#x548C; PSM&#xFF0C;MDA &#x5206;&#x79BB;&#x4E1A;&#x52A1;&#x5EFA;&#x6A21;&#x4E0E;&#x5E95;&#x5C42;&#x5B9E;&#x73B0;&#x6280;&#x672F;&#xFF0C;&#x964D;&#x4F4E;&#x6280;&#x672F;&#x53D8;&#x8FC1;&#x5BF9;&#x4E1A;&#x52A1;&#x6A21;&#x578B;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;&#x3002;
<strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x6A21;&#x578B;&#x9A71;&#x52A8;&#x67B6;&#x6784;&#x5728;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x4E2D;&#x7684;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x7B80;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x3001;&#x4E0E; MDA &#x76F8;&#x5173;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7B80;&#x8981;&#x5206;&#x6790;&#x6A21;&#x578B;&#x9A71;&#x52A8;&#x67B6;&#x6784;&#x80FD;&#x591F;&#x4E3A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5E26;&#x6765;&#x54EA;&#x4E9B;&#x597D;&#x5904;&#xFF0C;&#x8BE6;&#x7EC6;&#x8BBA;&#x8FF0;&#x91C7;&#x7528;&#x6A21;&#x578B;&#x9A71;&#x52A8;&#x67B6;&#x6784;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</li>
<li>&#x5177;&#x4F53;&#x9610;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#x4F7F;&#x7528;&#x6A21;&#x578B;&#x9A71;&#x52A8;&#x67B6;&#x6784;&#x7684;&#x60C5;&#x51B5;&#x4E0E;&#x5B9E;&#x9645;&#x5F00;&#x53D1;&#x6548;&#x679C;&#x3002;</li>
</ol>
<h2 id="2-&#x8BBA;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;">2. &#x8BBA;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;</h2>
<p>&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x662F;&#x4E00;&#x4E2A;&#x652F;&#x6301;&#x590D;&#x6742;&#x4FE1;&#x606F;&#x73AF;&#x5883;&#x4E0B;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x3001;&#x96C6;&#x6210;&#x548C;&#x534F;&#x540C;&#x8FD0;&#x884C;&#x7684;&#x8F6F;&#x4EF6;&#x652F;&#x6491;&#x73AF;&#x5883;&#xFF0C;&#x5B83;&#x57FA;&#x4E8E;&#x4F01;&#x4E1A;&#x5404;&#x79CD;&#x7ECF;&#x8425;&#x4E1A;&#x52A1;&#x7684;&#x4FE1;&#x606F;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x5F02;&#x6784;&#x5206;&#x5E03;&#x73AF;&#x5883;&#xFF08;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x7F51;&#x7EDC;&#x3001;&#x6570;&#x636E;&#x5E93;&#xFF09;&#x4E0B;&#x4E3A;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x7684;&#x4FE1;&#x606F;&#x8BBF;&#x95EE;&#x548C;&#x4EA4;&#x4E92;&#x624B;&#x6BB5;&#xFF0C;&#x5BF9;&#x5176;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C;&#x4E3A;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x5E76;&#x652F;&#x6301;&#x5404;&#x79CD;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x96C6;&#x6210;&#x3002;
<strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x7B80;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BF7;&#x8BF4;&#x660E;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x57FA;&#x672C;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#xFF0C;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x6240;&#x8BBE;&#x8BA1;&#x7684;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x4EE5;&#x53CA;&#x5B9E;&#x73B0;&#x65F6;&#x7528;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x5173;&#x952E;&#x6280;&#x672F;&#x3002;</li>
<li>&#x5177;&#x4F53;&#x8BF4;&#x660E;&#x6240;&#x8BBE;&#x8BA1;&#x7684;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x4F7F;&#x7528;&#x60C5;&#x51B5;&#xFF0C;&#x6700;&#x7EC8;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;</li>
</ol>
<h2 id="3-&#x8BBA;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x7BA1;&#x7406;&#x4E0E;&#x5E94;&#x7528;">3. &#x8BBA;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x7BA1;&#x7406;&#x4E0E;&#x5E94;&#x7528;</h2>
<p>&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x7BA1;&#x7406;&#xFF08;Enterprise Architecture Management&#xFF0C;EAM&#xFF09;&#x4ECE;&#x529F;&#x80FD;&#x3001;&#x5E94;&#x7528;&#x3001;&#x4FE1;&#x606F;&#x548C;&#x6280;&#x672F;&#x56DB;&#x4E2A;&#x5C42;&#x9762;&#x5B9A;&#x4E49;&#x4E86;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x4E1A;&#x52A1;&#x9700;&#x6C42;&#x9A71;&#x52A8;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E3A;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x63D0;&#x4F9B;&#x6807;&#x51C6;&#x548C;&#x6307;&#x5BFC;&#x3002;EAM &#x5C06;&#x4F01;&#x4E1A;&#x7684;&#x4E1A;&#x52A1;&#x548C;&#x6280;&#x672F;&#x9700;&#x6C42;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4EE5;&#x7BA1;&#x7406;&#x4E1A;&#x52A1;&#x53D8;&#x66F4;&#x4E3A;&#x6838;&#x5FC3;&#xFF0C;&#x5F3A;&#x8C03;&#x4E1A;&#x52A1;&#x4E0E;&#x6280;&#x672F;&#x5BF9;&#x9F50;&#xFF0C;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x9AD8;&#x5185;&#x805A;&#x3001;&#x52A8;&#x6001;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;EAM &#x80FD;&#x591F;&#x5E2E;&#x52A9;&#x4F01;&#x4E1A;&#x8BC6;&#x522B;&#x53EF;&#x4EE5;&#x63D0;&#x9AD8;&#x8FD0;&#x8425;&#x6548;&#x7387;&#x7684;&#x6F5C;&#x5728;&#x9886;&#x57DF;&#xFF0C;&#x6709;&#x52A9;&#x4E8E;&#x4F01;&#x4E1A;&#x5EFA;&#x7ACB;&#x4ECE;&#x6218;&#x7565;&#x5230;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4EA4;&#x4ED8;&#x7684;&#x5404;&#x79CD;&#x5173;&#x7CFB;&#xFF0C;&#x8BC6;&#x522B;&#x6280;&#x672F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4E2D;&#x6700;&#x4F18;&#x7684;&#x4E1A;&#x52A1;&#x6210;&#x679C;&#xFF0C;&#x80FD;&#x591F;&#x5728;&#x4E1A;&#x52A1;&#x91CD;&#x7EC4;&#x3001;&#x517C;&#x5E76;&#x3001;&#x6536;&#x8D2D;&#x548C;&#x5176;&#x4ED6;&#x4E1A;&#x52A1;&#x53D8;&#x66F4;&#x8BA1;&#x5212;&#x4E2D;&#x4E3A;&#x4F01;&#x4E1A;&#x6700;&#x5927;&#x5316;&#x5730;&#x8282;&#x7EA6;&#x6210;&#x672C;&#xFF0C;&#x964D;&#x4F4E;&#x76F8;&#x5173;&#x98CE;&#x9669;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x7BA1;&#x7406;&#x4E0E;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x7B80;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5B9E;&#x65BD;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x80CC;&#x666F;&#x4E0E;&#x603B;&#x4F53;&#x9700;&#x6C42;&#x3001;&#x7CFB;&#x7EDF;&#x6240;&#x91C7;&#x7528;&#x7684;&#x6280;&#x672F;&#x4F53;&#x5236;&#x3001;&#x5B9E;&#x65BD;&#x4F01;&#x4E1A;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x7BA1;&#x7406;&#x7684;&#x52A8;&#x673A;&#x4E0E;&#x671F;&#x671B;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x627F;&#x62C5;&#x7684;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#xFF0C;&#x7B80;&#x8981;&#x9610;&#x8FF0;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x7BA1;&#x7406;&#x5305;&#x542B;&#x54EA;&#x4E9B;&#x65B9;&#x9762;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x6BCF;&#x4E2A;&#x65B9;&#x9762;&#x5305;&#x62EC;&#x54EA;&#x4E9B;&#x4E3B;&#x8981;&#x6D3B;&#x52A8;&#x3002;</li>
<li>&#x9610;&#x8FF0;&#x4F60;&#x5728;&#x5B9E;&#x65BD;&#x4F01;&#x4E1A;&#x67B6;&#x6784;&#x7BA1;&#x7406;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x90FD;&#x9047;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x8FC7;&#x7A0B;&#x3002;</li>
</ol>
<h2 id="4-&#x8BBA;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x83B7;&#x53D6;&#x6280;&#x672F;&#x53CA;&#x5E94;&#x7528;">4. &#x8BBA;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x83B7;&#x53D6;&#x6280;&#x672F;&#x53CA;&#x5E94;&#x7528;</h2>
<p>&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x662F;&#x6307;&#x7528;&#x6237;&#x5BF9;&#x65B0;&#x7CFB;&#x7EDF;&#x5728;&#x529F;&#x80FD;&#x3001;&#x884C;&#x4E3A;&#x3001;&#x6027;&#x80FD;&#x3001;&#x8BBE;&#x8BA1;&#x7EA6;&#x675F;&#x7B49;&#x65B9;&#x9762;&#x7684;&#x671F;&#x671B;&#x3002;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x83B7;&#x53D6;&#x662F;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x548C;&#x7406;&#x89E3;&#x4E0D;&#x540C;&#x7684;&#x9879;&#x76EE;&#x5E72;&#x7CFB;&#x4EBA;&#x7684;&#x9700;&#x6C42;&#x548C;&#x7EA6;&#x675F;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x9700;&#x6C42;&#x83B7;&#x53D6;&#x662F;&#x5426;&#x79D1;&#x5B66;&#x3001;&#x51C6;&#x5907;&#x5145;&#x5206;&#xFF0C;&#x5BF9;&#x83B7;&#x53D6;&#x7684;&#x7ED3;&#x679C;&#x5F71;&#x54CD;&#x5F88;&#x5927;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x5927;&#x90E8;&#x5206;&#x7528;&#x6237;&#x65E0;&#x6CD5;&#x5B8C;&#x6574;&#x5730;&#x63CF;&#x8FF0;&#x9700;&#x6C42;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x4E0D;&#x53EF;&#x80FD;&#x770B;&#x5230;&#x7CFB;&#x7EDF;&#x7684;&#x5168;&#x8C8C;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x638C;&#x63E1;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x9700;&#x6C42;&#x83B7;&#x53D6;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x4E14;&#x719F;&#x7EC3;&#x5730;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x8FD0;&#x7528;&#x5B83;&#xFF0C;&#x5E76;&#x4E0E;&#x7528;&#x6237;&#x6709;&#x6548;&#x5408;&#x4F5C;&#xFF0C;&#x662F;&#x5341;&#x5206;&#x91CD;&#x8981;&#x7684;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x9700;&#x6C42;&#x83B7;&#x53D6;&#x6280;&#x672F;&#x53CA;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x7B80;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x76EE;&#x524D;&#x6709;&#x54EA;&#x4E9B;&#x6BD4;&#x8F83;&#x5E38;&#x7528;&#x7684;&#x9700;&#x6C42;&#x83B7;&#x53D6;&#x6280;&#x672F;&#xFF1F;&#x8BF4;&#x660E;&#x6BCF;&#x79CD;&#x9700;&#x6C42;&#x83B7;&#x53D6;&#x6280;&#x672F;&#x7684;&#x57FA;&#x672C;&#x65B9;&#x6CD5;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BBA;&#x8FF0;&#x5728;&#x4F60;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4E2D;&#x6240;&#x91C7;&#x53D6;&#x7684;&#x9700;&#x6C42;&#x83B7;&#x53D6;&#x6280;&#x672F;&#x4EE5;&#x53CA;&#x9009;&#x53D6;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5E76;&#x8BF4;&#x660E;&#x9700;&#x6C42;&#x83B7;&#x53D6;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x6B65;&#x9AA4;&#x3002;</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2010.html" class="navigation navigation-prev " aria-label="Previous page: 2010">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2012.html" class="navigation navigation-next " aria-label="Next page: 2012">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2011","level":"1.3.1.4","depth":3,"next":{"title":"2012","level":"1.3.1.5","depth":3,"path":"4论文范文/历年真题/2012.md","ref":"4论文范文/历年真题/2012.md","articles":[]},"previous":{"title":"2010","level":"1.3.1.3","depth":3,"path":"4论文范文/历年真题/2010.md","ref":"4论文范文/历年真题/2010.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"4论文范文/历年真题/2011.md","mtime":"2022-10-20T17:55:30.898Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-20T18:50:19.495Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

