
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2012 · 系统架构设计师</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Lacuz">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2013.html" />
    
    
    <link rel="prev" href="2011.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../readme.html">
            
                <a href="../../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="2009.html">
            
                <a href="2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="2010.html">
            
                <a href="2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="2011.html">
            
                <a href="2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.5" data-path="2012.html">
            
                <a href="2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="2013.html">
            
                <a href="2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="2014.html">
            
                <a href="2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="2015.html">
            
                <a href="2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="2016.html">
            
                <a href="2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="2017.html">
            
                <a href="2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="2018.html">
            
                <a href="2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="2019.html">
            
                <a href="2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="2020.html">
            
                <a href="2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="2021.html">
            
                <a href="2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../16-题2-论软件设计模式及其应用.html">
            
                <a href="../16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2012</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2012-&#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;">2012 &#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;</h1>
<h2 id="&#x8BBA;&#x6587;1-&#x8BBA;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x89C4;&#x5212;&#x7684;&#x5B9E;&#x65BD;&#x4E0E;&#x5E94;&#x7528;">&#x8BBA;&#x6587;1. &#x8BBA;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x89C4;&#x5212;&#x7684;&#x5B9E;&#x65BD;&#x4E0E;&#x5E94;&#x7528;</h2>
<p>&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x5EFA;&#x8BBE;&#x662F;&#x4E00;&#x9879;&#x957F;&#x671F;&#x800C;&#x8270;&#x5DE8;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x5B8C;&#x6210;&#x3002;&#x4FE1;&#x606F;&#x5316;&#x89C4;&#x5212;&#x662F;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x5EFA;&#x8BBE;&#x7684;&#x7EB2;&#x9886;&#x548C;&#x5411;&#x5BFC;&#xFF0C;&#x662F;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x65BD;&#x7684;&#x524D;&#x63D0;&#x548C;&#x4F9D;&#x636E;&#x3002;&#x4FE1;&#x606F;&#x5316;&#x89C4;&#x5212;&#x4EE5;&#x6574;&#x4E2A;&#x4F01;&#x4E1A;&#x7684;&#x53D1;&#x5C55;&#x76EE;&#x6807;&#x548C;&#x6218;&#x7565;&#x3001;&#x4F01;&#x4E1A;&#x5404;&#x90E8;&#x95E8;&#x7684;&#x76EE;&#x6807;&#x4E0E;&#x529F;&#x80FD;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x540C;&#x65F6;&#x7ED3;&#x5408;&#x884C;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x65B9;&#x9762;&#x7684;&#x5B9E;&#x8DF5;&#x548C;&#x5BF9;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x8D8B;&#x52BF;&#x7684;&#x638C;&#x63E1;&#xFF0C;&#x5236;&#x5B9A;&#x51FA;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x8FDC;&#x666F;&#x3001;&#x76EE;&#x6807;&#x548C;&#x53D1;&#x5C55;&#x6218;&#x7565;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230;&#x5168;&#x9762;&#x3001;&#x7CFB;&#x7EDF;&#x5730;&#x6307;&#x5BFC;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x5EFA;&#x8BBE;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x89C4;&#x5212;&#x7684;&#x5B9E;&#x65BD;&#x4E0E;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7684;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x89C4;&#x5212;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7B80;&#x8981;&#x53D9;&#x8FF0;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x89C4;&#x5212;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x3002;&#x7ED3;&#x5408;&#x4F60;&#x53C2;&#x4E0E;&#x7684;&#x9879;&#x76EE;&#x7684;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x8BE6;&#x7EC6;&#x5206;&#x6790;&#x6709;&#x5173;&#x4F01;&#x4E1A;&#x7684;&#x4FE1;&#x606F;&#x5316;&#x89C4;&#x5212;&#x76EE;&#x6807;&#x53CA;&#x89C4;&#x5212;&#x7684;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#x3002;</li>
<li>&#x8BF4;&#x660E;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x5B9E;&#x65BD;&#x7684;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x89C4;&#x5212;&#x7684;&#x6B65;&#x9AA4;&#x53CA;&#x6548;&#x679C;&#xFF0C;&#x4ECB;&#x7ECD;&#x5176;&#x662F;&#x5426;&#x8FBE;&#x5230;&#x4E86;&#x9884;&#x671F;&#x7684;&#x76EE;&#x6807;&#x5E76;&#x5206;&#x6790;&#x539F;&#x56E0;&#x3002;</li>
</ol>
<h2 id="2-&#x8BBA;&#x51B3;&#x7B56;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x4E0E;&#x5E94;&#x7528;">2. &#x8BBA;&#x51B3;&#x7B56;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x4E0E;&#x5E94;&#x7528;</h2>
<p>&#x51B3;&#x7B56;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#xFF08;Decision Support Systems&#xFF0C;DSS&#xFF09;&#x662F;&#x4EE5;&#x7BA1;&#x7406;&#x79D1;&#x5B66;&#x3001;&#x8FD0;&#x7B79;&#x5B66;&#x3001;&#x63A7;&#x5236;&#x8BBA;&#x548C;&#x884C;&#x4E3A;&#x79D1;&#x5B66;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x4EE5;&#x8BA1;&#x7B97;&#x673A;&#x6280;&#x672F;&#x3001;&#x4EFF;&#x771F;&#x6280;&#x672F;&#x548C;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x4E3A;&#x624B;&#x6BB5;&#xFF0C;&#x4EE5;&#x4EBA;&#x673A;&#x4EA4;&#x4E92;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x534A;&#x7ED3;&#x6784;&#x5316;&#x548C;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x51B3;&#x7B56;&#x7684;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x3002;&#x5B83;&#x8C03;&#x7528;&#x5404;&#x79CD;&#x4FE1;&#x606F;&#x8D44;&#x6E90;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x5404;&#x79CD;&#x5206;&#x6790;&#x5DE5;&#x5177;&#xFF0C;&#x4E3A;&#x51B3;&#x7B56;&#x8005;&#x63D0;&#x4F9B;&#x5206;&#x6790;&#x95EE;&#x9898;&#x3001;&#x5EFA;&#x7ACB;&#x6A21;&#x578B;&#x3001;&#x6A21;&#x62DF;&#x51B3;&#x7B56;&#x8FC7;&#x7A0B;&#x548C;&#x65B9;&#x6848;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x5E2E;&#x52A9;&#x51B3;&#x7B56;&#x8005;&#x63D0;&#x9AD8;&#x51B3;&#x7B56;&#x6C34;&#x5E73;&#x548C;&#x8D28;&#x91CF;&#x3002;&#x51B3;&#x7B56;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#x5728;&#x8BB8;&#x591A;&#x9886;&#x57DF;&#x5F97;&#x5230;&#x4E86;&#x5E7F;&#x6CDB;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5DF2;&#x6210;&#x4E3A;&#x8BB8;&#x591A;&#x884C;&#x4E1A;&#x7ECF;&#x8425;&#x7BA1;&#x7406;&#x4E2D;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x7F3A;&#x5C11;&#x7684;&#x73B0;&#x4EE3;&#x5316;&#x652F;&#x6301;&#x5DE5;&#x5177;&#x3002;
<strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x51B3;&#x7B56;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x4E0E;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x51B3;&#x7B56;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7B80;&#x8981;&#x53D9;&#x8FF0;&#x51B3;&#x7B56;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#x5305;&#x542B;&#x7684;&#x5178;&#x578B;&#x7EC4;&#x6210;&#x90E8;&#x4EF6;&#x53CA;&#x5BF9;&#x5E94;&#x7684;&#x57FA;&#x672C;&#x529F;&#x80FD;&#x3002;&#x8BF4;&#x660E;&#x5728;&#x5EFA;&#x7ACB;&#x51B3;&#x7B56;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#x65F6;&#x9700;&#x89E3;&#x51B3;&#x7684;&#x4E00;&#x822C;&#x5173;&#x952E;&#x95EE;&#x9898;&#x3002;</li>
<li>&#x8BF4;&#x660E;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x51B3;&#x7B56;&#x652F;&#x6301;&#x7CFB;&#x7EDF;&#x7684;&#x5E94;&#x7528;&#x573A;&#x5408;&#x4EE5;&#x53CA;&#x5BF9;&#x51B3;&#x7B56;&#x7ED3;&#x679C;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5177;&#x4F53;&#x9610;&#x8FF0;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x91C7;&#x7528;&#x7684;&#x5173;&#x952E;&#x6280;&#x672F;&#x3001;&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x548C;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x7684;&#x6548;&#x679C;&#x3002;</li>
</ol>
<h2 id="3-&#x8BBA;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;">3. &#x8BBA;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;</h2>
<p>&#x6570;&#x636E;&#x6301;&#x4E45;&#x5C42;&#xFF08;Data Persistence Layer&#xFF09;&#x901A;&#x5E38;&#x4F4D;&#x4E8E;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#x548C;&#x6570;&#x636E;&#x6E90;&#x5C42;&#x4E4B;&#x95F4;&#xFF0C;&#x4E3A;&#x6574;&#x4E2A;&#x9879;&#x76EE;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x9AD8;&#x5C42;&#x3001;&#x7EDF;&#x4E00;&#x3001;&#x5B89;&#x5168;&#x3001;&#x5E76;&#x53D1;&#x7684;&#x6570;&#x636E;&#x6301;&#x4E45;&#x673A;&#x5236;&#xFF0C;&#x5B8C;&#x6210;&#x5BF9;&#x5404;&#x79CD;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6301;&#x4E45;&#x5316;&#x7684;&#x7F16;&#x7A0B;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x4E3A;&#x7CFB;&#x7EDF;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x5B83;&#x80FD;&#x591F;&#x4F7F;&#x7A0B;&#x5E8F;&#x5458;&#x907F;&#x514D;&#x624B;&#x5DE5;&#x7F16;&#x5199;&#x8BBF;&#x95EE;&#x6570;&#x636E;&#x6E90;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x4F7F;&#x5176;&#x4E13;&#x6CE8;&#x4E8E;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7684;&#x5F00;&#x53D1;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x5728;&#x4E0D;&#x540C;&#x9879;&#x76EE;&#x4E2D;&#x91CD;&#x7528;&#x672C;&#x6846;&#x67B6;&#xFF0C;&#x8FD9;&#x5927;&#x5927;&#x7B80;&#x5316;&#x4E86;&#x6570;&#x636E;&#x7684;&#x589E;&#x52A0;&#x3001;&#x5220;&#x9664;&#x3001;&#x4FEE;&#x6539;&#x3001;&#x67E5;&#x8BE2;&#x529F;&#x80FD;&#x7684;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#xFF0C;&#x540C;&#x65F6;&#x53C8;&#x4E0D;&#x4E27;&#x5931;&#x591A;&#x5C42;&#x7ED3;&#x6784;&#x7684;&#x5929;&#x7136;&#x4F18;&#x52BF;&#xFF0C;&#x7EE7;&#x627F;&#x5EF6;&#x7EED;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x548C;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;&#x5F53;&#x8FD0;&#x7528;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4F5C;&#x4E3A;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x673A;&#x5236;&#x65F6;&#xFF0C;&#x5728;&#x4E1A;&#x52A1;&#x5C42;&#x4E0E;&#x6570;&#x636E;&#x6E90;&#x95F4;&#x52A0;&#x5165;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5C42;&#xFF0C;&#x80FD;&#x591F;&#x89E3;&#x51B3;&#x5BF9;&#x8C61;&#x4E0E;&#x5173;&#x7CFB;&#x7684;&#x201C;&#x963B;&#x6297;&#x4E0D;&#x5339;&#x914D;&#x201D;&#x95EE;&#x9898;&#xFF0C;&#x5C06;&#x5BF9;&#x8C61;&#x7684;&#x72B6;&#x6001;&#x6301;&#x4E45;&#x5316;&#x5B58;&#x50A8;&#x5230;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x8BBE;&#x8BA1;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x5206;&#x6790;&#x5728;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E2D;&#x6709;&#x54EA;&#x4E9B;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#xFF0C;&#x5E76;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x6BCF;&#x79CD;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x6A21;&#x5F0F;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x3002;</li>
<li>&#x6570;&#x636E;&#x6301;&#x4E45;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x597D;&#x574F;&#x51B3;&#x5B9A;&#x7740;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6027;&#x80FD;&#x7684;&#x4F18;&#x52A3;&#xFF0C;&#x8BF7;&#x7ED3;&#x5408;&#x5B9E;&#x9645;&#x8BF4;&#x660E;&#x5728;&#x6570;&#x636E;&#x6301;&#x4E45;&#x5C42;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E2D;&#x9700;&#x8981;&#x8003;&#x8651;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#x3002;</li>
</ol>
<h2 id="4-&#x8BBA;&#x57FA;&#x4E8E;&#x67B6;&#x6784;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x53CA;&#x5E94;&#x7528;">4. &#x8BBA;&#x57FA;&#x4E8E;&#x67B6;&#x6784;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x53CA;&#x5E94;&#x7528;</h2>
<p>&#x57FA;&#x4E8E;&#x67B6;&#x6784;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#xFF08;Architecture-Based Software Design&#xFF0C;ABSD&#xFF09;&#x65B9;&#x6CD5;&#x4EE5;&#x6784;&#x6210;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x7684;&#x5546;&#x4E1A;&#x3001;&#x8D28;&#x91CF;&#x548C;&#x529F;&#x80FD;&#x9700;&#x6C42;&#x7B49;&#x8981;&#x7D20;&#x6765;&#x9A71;&#x52A8;&#x6574;&#x4E2A;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x3002;ABSD &#x662F;&#x4E00;&#x4E2A;&#x81EA;&#x9876;&#x5411;&#x4E0B;&#xFF0C;&#x9012;&#x5F52;&#x7EC6;&#x5316;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x4EE5;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x529F;&#x80FD;&#x7684;&#x5206;&#x89E3;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x901A;&#x8FC7;&#x9009;&#x62E9;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x5B9E;&#x73B0;&#x8D28;&#x91CF;&#x548C;&#x5546;&#x4E1A;&#x9700;&#x6C42;&#xFF0C;&#x5E76;&#x5F3A;&#x8C03;&#x5728;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F7F;&#x7528;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x6A21;&#x677F;&#x3002;&#x91C7;&#x7528; ABSD &#x65B9;&#x6CD5;&#xFF0C;&#x8BBE;&#x8BA1;&#x6D3B;&#x52A8;&#x53EF;&#x4EE5;&#x4ECE;&#x9879;&#x76EE;&#x603B;&#x4F53;&#x529F;&#x80FD;&#x6846;&#x67B6;&#x660E;&#x786E;&#x540E;&#x5C31;&#x5F00;&#x59CB;&#xFF0C;&#x56E0;&#x6B64;&#x8BE5;&#x65B9;&#x6CD5;&#x7279;&#x522B;&#x9002;&#x7528;&#x4E8E;&#x5F00;&#x53D1;&#x4E00;&#x4E9B;&#x4E0D;&#x80FD;&#x9884;&#x5148;&#x51B3;&#x5B9A;&#x6240;&#x6709;&#x9700;&#x6C42;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5982;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x7EBF;&#x7CFB;&#x7EDF;&#x6216;&#x957F;&#x751F;&#x547D;&#x5468;&#x671F;&#x7CFB;&#x7EDF;&#x7B49;&#xFF0C;&#x4E5F;&#x53EF;&#x4E3A;&#x9700;&#x6C42;&#x4E0D;&#x80FD;&#x5728;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x660E;&#x786E;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x63D0;&#x4F9B;&#x6307;&#x5BFC;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x57FA;&#x4E8E;&#x67B6;&#x6784;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x53CA;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5F00;&#x53D1;&#x7684;&#x3001;&#x91C7;&#x7528; ABSD &#x65B9;&#x6CD5;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#xFF0C;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x91C7;&#x7528; ABSD &#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x7ECF;&#x5386;&#x54EA;&#x4E9B;&#x5F00;&#x53D1;&#x9636;&#x6BB5;&#xFF1F;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x5305;&#x62EC;&#x54EA;&#x4E9B;&#x4E3B;&#x8981;&#x6D3B;&#x52A8;&#xFF1F;</li>
<li>&#x9610;&#x8FF0;&#x4F60;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x90FD;&#x9047;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x53CA;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#x3002; </li>
</ol>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Lacuz 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2022-10-25
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2011.html" class="navigation navigation-prev " aria-label="Previous page: 2011">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2013.html" class="navigation navigation-next " aria-label="Next page: 2013">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2012","level":"1.3.1.5","depth":3,"next":{"title":"2013","level":"1.3.1.6","depth":3,"path":"4论文范文/历年真题/2013.md","ref":"4论文范文/历年真题/2013.md","articles":[]},"previous":{"title":"2011","level":"1.3.1.4","depth":3,"path":"4论文范文/历年真题/2011.md","ref":"4论文范文/历年真题/2011.md","articles":[]},"dir":"ltr"},"config":{"plugins":["expandable-chapters-small","splitter","code","hide-element","pageview-count","popup","tbfed-pagefooter","-sharing","sharing-plus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Lacuz 2020","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"pageview-count":{},"expandable-chapters-small":{},"sharing":{"qq":true,"qzone":true,"weibo":true,"all":["weibo","qq","qzone"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Lacuz","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"系统架构设计师","language":"zh-hans","gitbook":"*","description":"系统架构设计师考试"},"file":{"path":"4论文范文/历年真题/2012.md","mtime":"2022-10-25T03:33:25.402Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-25T03:56:19.259Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

