
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2013 · 系统架构设计师</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Lacuz">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2014.html" />
    
    
    <link rel="prev" href="2012.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../readme.html">
            
                <a href="../../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="2009.html">
            
                <a href="2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="2010.html">
            
                <a href="2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="2011.html">
            
                <a href="2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="2012.html">
            
                <a href="2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.6" data-path="2013.html">
            
                <a href="2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="2014.html">
            
                <a href="2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="2015.html">
            
                <a href="2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="2016.html">
            
                <a href="2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="2017.html">
            
                <a href="2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="2018.html">
            
                <a href="2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="2019.html">
            
                <a href="2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="2020.html">
            
                <a href="2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="2021.html">
            
                <a href="2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../论软件三层架构设计.html">
            
                <a href="../论软件三层架构设计.html">
            
                    
                    论软件三层架构设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../16-题2-论软件设计模式及其应用.html">
            
                <a href="../16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2013</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2013-&#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;">2013 &#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;</h1>
<h2 id="&#x8BBA;&#x6587;1-&#x8BBA;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5EFA;&#x6A21;&#x6280;&#x672F;&#x4E0E;&#x5E94;&#x7528;">&#x8BBA;&#x6587;1. &#x8BBA;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5EFA;&#x6A21;&#x6280;&#x672F;&#x4E0E;&#x5E94;&#x7528;</h2>
<p>&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x7528;&#x6765;&#x5904;&#x7406;&#x8F6F;&#x4EF6;&#x9AD8;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x7684;&#x8BBE;&#x8BA1;&#x548C;&#x5B9E;&#x65BD;&#xFF0C;&#x5B83;&#x4EE5;&#x7CBE;&#x5FC3;&#x9009;&#x62E9;&#x7684;&#x5F62;&#x5F0F;&#x5C06;&#x82E5;&#x5E72;&#x7ED3;&#x6784;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x88C5;&#x914D;&#xFF0C;&#x4ECE;&#x800C;&#x6EE1;&#x8DB3;&#x7CFB;&#x7EDF;&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x548C;&#x6027;&#x80FD;&#x9700;&#x6C42;&#x3002;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x9996;&#x8981;&#x95EE;&#x9898;&#x662F;&#x5982;&#x4F55;&#x8868;&#x793A;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#xFF0C;&#x5373;&#x5982;&#x4F55;&#x5BF9;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5EFA;&#x6A21;&#x3002;&#x6839;&#x636E;&#x5EFA;&#x6A21;&#x7684;&#x4FA7;&#x91CD;&#x70B9;&#x4E0D;&#x540C;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x5206;&#x4E3A;&#x7ED3;&#x6784;&#x6A21;&#x578B;&#x3001;&#x6846;&#x67B6;&#x6A21;&#x578B;&#x3001;&#x52A8;&#x6001;&#x6A21;&#x578B;&#x3001;&#x8FC7;&#x7A0B;&#x6A21;&#x578B;&#x548C;&#x529F;&#x80FD;&#x6A21;&#x578B;&#x3002;Kruchten &#x5728; 1995 &#x5E74;&#x63D0;&#x51FA;&#x4E86;&#x201C;4+1&#x201D;&#x89C6;&#x56FE;&#x6A21;&#x578B;&#xFF0C;&#x5C06; 5 &#x79CD;&#x6A21;&#x578B;&#x6709;&#x673A;&#x5730;&#x7EDF;&#x4E00;&#x5728;&#x4E86;&#x4E00;&#x8D77;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x5EFA;&#x6A21;&#x6280;&#x672F;&#x4E0E;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7B80;&#x8981;&#x53D9;&#x8FF0;&#x201C;4+1&#x201D;&#x89C6;&#x56FE;&#x6A21;&#x578B;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x3002;&#x7ED3;&#x5408;&#x4F60;&#x53C2;&#x4E0E;&#x9879;&#x76EE;&#x7684;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x8BE5;&#x9879;&#x76EE;&#x9700;&#x6C42;&#x53CA;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#xFF08;&#x5305;&#x62EC;&#x4F7F;&#x7528;&#x5230;&#x7684;&#x89C6;&#x56FE;&#x6A21;&#x578B;&#x3001;&#x521B;&#x5EFA;&#x7684;&#x67B6;&#x6784;&#x6A21;&#x578B;&#x53CA;&#x4F7F;&#x7528;&#x7684;&#x5EFA;&#x6A21;&#x5DE5;&#x5177;&#x7B49;&#xFF09;&#x3002;</li>
<li>&#x8BF4;&#x660E;&#x8BE5;&#x9879;&#x76EE;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x7684;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#xFF0C;&#x5206;&#x6790;&#x5176;&#x662F;&#x5426;&#x6EE1;&#x8DB3;&#x4E86;&#x9879;&#x76EE;&#x7684;&#x9700;&#x6C42;&#x5E76;&#x8BF4;&#x660E;&#x539F;&#x56E0;&#x3002;</li>
</ol>
<h2 id="2-&#x8BBA;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x98CE;&#x683C;">2. &#x8BBA;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x98CE;&#x683C;</h2>
<p>&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x662F;&#x63CF;&#x8FF0;&#x4E00;&#x7C7B;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x4E2D;&#x7CFB;&#x7EDF;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x7684;&#x60EF;&#x7528;&#x6A21;&#x5F0F;&#xFF0C;&#x53CD;&#x6620;&#x4E86;&#x9886;&#x57DF;&#x4E2D;&#x8BF8;&#x591A;&#x7CFB;&#x7EDF;&#x6240;&#x5171;&#x6709;&#x7684;&#x7ED3;&#x6784;&#x7279;&#x5F81;&#x548C;&#x8BED;&#x4E49;&#x7279;&#x5F81;&#xFF0C;&#x5E76;&#x6307;&#x5BFC;&#x5982;&#x4F55;&#x5C06;&#x5404;&#x4E2A;&#x6A21;&#x5757;&#x548C;&#x5B50;&#x7CFB;&#x7EDF;&#x6709;&#x6548;&#x7EC4;&#x7EC7;&#x6210;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x98CE;&#x683C;&#xFF0C;&#x80FD;&#x591F;&#x6709;&#x6548;&#x7B80;&#x5316;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F7F;&#x5F97;&#x8BBE;&#x8BA1;&#x7684;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x6E05;&#x6670;&#xFF0C;&#x4FBF;&#x4E8E;&#x63D0;&#x9AD8;&#x590D;&#x7528;&#x80FD;&#x529B;&#x548C;&#x4EA7;&#x54C1;&#x7EF4;&#x62A4;&#x80FD;&#x529B;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x5927;&#x91CF;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x90FD;&#x7531;&#x754C;&#x9762;&#x5448;&#x73B0;&#x3001;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x3001;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x4E09;&#x7C7B;&#x529F;&#x80FD;&#x6784;&#x6210;&#xFF0C;&#x56E0;&#x6B64;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x8FDB;&#x884C;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x5206;&#x5C42;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x5EFA;&#x8BBE;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BF7;&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x6307;&#x51FA;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x90FD;&#x6709;&#x54EA;&#x4E9B;&#x5C42;&#x6B21;&#x4EE5;&#x53CA;&#x6BCF;&#x4E2A;&#x5C42;&#x6B21;&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x3002;</li>
<li>&#x8BF7;&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x6307;&#x51FA;&#x8BBE;&#x8BA1;&#x6BCF;&#x4E2A;&#x5C42;&#x6B21;&#x65F6;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x95EE;&#x9898;&#x53CA;&#x76F8;&#x5E94;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</li>
</ol>
<h2 id="3-&#x8BBA;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x7684;&#x5E94;&#x7528;">3. &#x8BBA;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x7684;&#x5E94;&#x7528;</h2>
<p>&#x968F;&#x7740;&#x8F6F;&#x4EF6;&#x7684;&#x65E5;&#x76CA;&#x666E;&#x53CA;&#xFF0C;&#x7CFB;&#x7EDF;&#x4E2D;&#x8F6F;&#x4EF6;&#x6210;&#x5206;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#xFF0C;&#x4F7F;&#x5F97;&#x7CFB;&#x7EDF;&#x5BF9;&#x8F6F;&#x4EF6;&#x7684;&#x4F9D;&#x8D56;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#x3002;&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x9760;&#x6027;&#x5BF9;&#x7CFB;&#x7EDF;&#x53EF;&#x9760;&#x6027;&#x7684;&#x5F71;&#x54CD;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#x3002;&#x800C;&#x5B9E;&#x8DF5;&#x8BC1;&#x660E;&#xFF0C;&#x4FDD;&#x969C;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6700;&#x6709;&#x6548;&#x3001;&#x6700;&#x7ECF;&#x6D4E;&#x3001;&#x6700;&#x91CD;&#x8981;&#x7684;&#x624B;&#x6BB5;&#x662F;&#x5728;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x9636;&#x6BB5;&#x91C7;&#x53D6;&#x63AA;&#x65BD;&#x8FDB;&#x884C;&#x53EF;&#x9760;&#x6027;&#x63A7;&#x5236;&#xFF0C;&#x4E3A;&#x6B64;&#x63D0;&#x51FA;&#x4E86;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x7684;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x5C31;&#x662F;&#x5728;&#x5E38;&#x89C4;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x5404;&#x79CD;&#x65B9;&#x6CD5;&#x548C;&#x6280;&#x672F;&#xFF0C;&#x4F7F;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5728;&#x517C;&#x987E;&#x7528;&#x6237;&#x529F;&#x80FD;&#x548C;&#x6027;&#x80FD;&#x9700;&#x6C42;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x5168;&#x9762;&#x6EE1;&#x8DB3;&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x9760;&#x6027;&#x8981;&#x6C42;&#x3002;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x5E94;&#x548C;&#x8F6F;&#x4EF6;&#x7684;&#x5E38;&#x89C4;&#x8BBE;&#x8BA1;&#x7D27;&#x5BC6;&#x7ED3;&#x5408;&#xFF0C;&#x8D2F;&#x7A7F;&#x4E8E;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x7684;&#x59CB;&#x7EC8;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x7684;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#xFF0C;&#x8BBA;&#x8FF0;&#x4F60;&#x5728;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x8FDB;&#x884C;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x65F6;&#x9075;&#x5FAA;&#x7684;&#x57FA;&#x672C;&#x539F;&#x5219;&#xFF1B;&#x8BBA;&#x8FF0;&#x4F60;&#x5728;&#x8BE5;&#x9879;&#x76EE;&#x4E2D;&#x6240;&#x91C7;&#x7528;&#x7684;&#x5177;&#x4F53;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x3002;</li>
<li>&#x9610;&#x8FF0;&#x4F60;&#x5728;&#x5177;&#x4F53;&#x7684;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x4E3A;&#x4E86;&#x5206;&#x6790;&#x5F71;&#x54CD;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x7684;&#x4E3B;&#x8981;&#x56E0;&#x7D20;&#xFF0C;&#x6240;&#x91C7;&#x7528;&#x7684;&#x53EF;&#x9760;&#x6027;&#x5206;&#x6790;&#x65B9;&#x6CD5;&#x3002;</li>
</ol>
<h2 id="4-&#x8BBA;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;">4. &#x8BBA;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;</h2>
<p>&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#xFF08;Distributed Storage System&#xFF09;&#x901A;&#x5E38;&#x5C06;&#x6570;&#x636E;&#x5206;&#x6563;&#x5B58;&#x50A8;&#x5728;&#x591A;&#x53F0;&#x72EC;&#x7ACB;&#x7684;&#x8BBE;&#x5907;&#x4E0A;&#x3002;&#x4F20;&#x7EDF;&#x7684;&#x7F51;&#x7EDC;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;&#x96C6;&#x4E2D;&#x7684;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x5668;&#x5B58;&#x653E;&#x6240;&#x6709;&#x6570;&#x636E;&#xFF0C;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x5668;&#x6210;&#x4E3A;&#x7CFB;&#x7EDF;&#x6027;&#x80FD;&#x7684;&#x74F6;&#x9888;&#xFF0C;&#x4E5F;&#x662F;&#x53EF;&#x9760;&#x6027;&#x548C;&#x5B89;&#x5168;&#x6027;&#x7684;&#x7126;&#x70B9;&#xFF0C;&#x4E0D;&#x80FD;&#x6EE1;&#x8DB3;&#x5927;&#x89C4;&#x6A21;&#x5B58;&#x50A8;&#x5E94;&#x7528;&#x7684;&#x9700;&#x8981;&#x3002;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x91C7;&#x7528;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#xFF0C;&#x5229;&#x7528;&#x591A;&#x53F0;&#x5B58;&#x50A8;&#x670D;&#x52A1;&#x5668;&#x5206;&#x62C5;&#x5B58;&#x50A8;&#x8D1F;&#x8377;&#xFF0C;&#x5229;&#x7528;&#x4F4D;&#x7F6E;&#x670D;&#x52A1;&#x5668;&#x5B9A;&#x4F4D;&#x5B58;&#x50A8;&#x4FE1;&#x606F;&#xFF0C;&#x5B83;&#x4E0D;&#x4F46;&#x63D0;&#x9AD8;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x9760;&#x6027;&#x3001;&#x53EF;&#x7528;&#x6027;&#x548C;&#x5B58;&#x53D6;&#x6548;&#x7387;&#xFF0C;&#x8FD8;&#x6613;&#x4E8E;&#x6269;&#x5C55;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7B80;&#x8981;&#x8BF4;&#x660E;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E2D;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x6280;&#x672F;&#x53CA;&#x5176;&#x5B9E;&#x73B0;&#x673A;&#x5236;&#xFF0C;&#x8BE6;&#x7EC6;&#x53D9;&#x8FF0;&#x4F60;&#x5728;&#x5177;&#x4F53;&#x9879;&#x76EE;&#x4E2D;&#x9009;&#x7528;&#x4E86;&#x54EA;&#x79CD;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x6280;&#x672F;&#xFF0C;&#x8BF4;&#x660E;&#x5176;&#x539F;&#x56E0;&#x548C;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x3002;</li>
<li>&#x5197;&#x4F59;&#x662F;&#x63D0;&#x9AD8;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x53EF;&#x9760;&#x6027;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x5E38;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x4E2D;&#x53EF;&#x91C7;&#x7528;&#x54EA;&#x4E9B;&#x5197;&#x4F59;&#x6280;&#x672F;&#x6765;&#x63D0;&#x5347;&#x7CFB;&#x7EDF;&#x7684;&#x53EF;&#x9760;&#x6027;&#xFF1F;&#x4F60;&#x5728;&#x5177;&#x4F53;&#x9879;&#x76EE;&#x4E2D;&#x9009;&#x7528;&#x4E86;&#x54EA;&#x79CD;&#x5197;&#x4F59;&#x6280;&#x672F;&#xFF1F;&#x8BF4;&#x660E;&#x5176;&#x539F;&#x56E0;&#x548C;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x3002; </li>
</ol>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Lacuz 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2022-10-25
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2012.html" class="navigation navigation-prev " aria-label="Previous page: 2012">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2014.html" class="navigation navigation-next " aria-label="Next page: 2014">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2013","level":"1.3.1.6","depth":3,"next":{"title":"2014","level":"1.3.1.7","depth":3,"path":"4论文范文/历年真题/2014.md","ref":"4论文范文/历年真题/2014.md","articles":[]},"previous":{"title":"2012","level":"1.3.1.5","depth":3,"path":"4论文范文/历年真题/2012.md","ref":"4论文范文/历年真题/2012.md","articles":[]},"dir":"ltr"},"config":{"plugins":["expandable-chapters-small","splitter","code","hide-element","pageview-count","popup","tbfed-pagefooter","-sharing","sharing-plus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Lacuz 2020","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"pageview-count":{},"expandable-chapters-small":{},"sharing":{"qq":true,"qzone":true,"weibo":true,"all":["weibo","qq","qzone"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Lacuz","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"系统架构设计师","language":"zh-hans","gitbook":"*","description":"系统架构设计师考试"},"file":{"path":"4论文范文/历年真题/2013.md","mtime":"2022-10-25T03:56:21.306Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-26T12:13:22.739Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

