
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2014 · 系统架构设计师</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Lacuz">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2015.html" />
    
    
    <link rel="prev" href="2013.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../readme.html">
            
                <a href="../../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="2009.html">
            
                <a href="2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="2010.html">
            
                <a href="2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="2011.html">
            
                <a href="2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="2012.html">
            
                <a href="2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="2013.html">
            
                <a href="2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.7" data-path="2014.html">
            
                <a href="2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="2015.html">
            
                <a href="2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="2016.html">
            
                <a href="2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="2017.html">
            
                <a href="2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="2018.html">
            
                <a href="2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="2019.html">
            
                <a href="2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="2020.html">
            
                <a href="2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="2021.html">
            
                <a href="2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../16-题2-论软件设计模式及其应用.html">
            
                <a href="../16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2014</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2014-&#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;">2014 &#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;</h1>
<h2 id="&#x8BBA;&#x6587;1-&#x8BBA;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x7BA1;&#x7406;">&#x8BBA;&#x6587;1. &#x8BBA;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x7BA1;&#x7406;</h2>
<p>&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x7BA1;&#x7406;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x53D8;&#x66F4;&#x4E86;&#x89E3;&#x548C;&#x63A7;&#x5236;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x9700;&#x6C42;&#x7BA1;&#x7406;&#x8FC7;&#x7A0B;&#x4E0E;&#x9700;&#x6C42;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x76F8;&#x4E92;&#x5173;&#x8054;&#xFF0C;&#x521D;&#x59CB;&#x9700;&#x6C42;&#x5BFC;&#x51FA;&#x7684;&#x540C;&#x65F6;&#x5C31;&#x8981;&#x5F62;&#x6210;&#x9700;&#x6C42;&#x7BA1;&#x7406;&#x89C4;&#x5212;&#xFF0C;&#x4E00;&#x65E6;&#x542F;&#x52A8;&#x4E86;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#xFF0C;&#x9700;&#x6C42;&#x7BA1;&#x7406;&#x6D3B;&#x52A8;&#x5C31;&#x7D27;&#x5BC6;&#x76F8;&#x4F34;&#x3002;</p>
<p>&#x9700;&#x6C42;&#x7BA1;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E3B;&#x8981;&#x5305;&#x542B;&#x53D8;&#x66F4;&#x63A7;&#x5236;&#x3001;&#x7248;&#x672C;&#x63A7;&#x5236;&#x3001;&#x9700;&#x6C42;&#x8DDF;&#x8E2A;&#x548C;&#x9700;&#x6C42;&#x72B6;&#x6001;&#x8DDF;&#x8E2A;&#x7B49;4 &#x9879;&#x6D3B;&#x52A8;&#xFF0C;&#x5176;&#x76EE;&#x6807;&#x662F;&#x4E3A;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x57FA;&#x7EBF;&#xFF0C;&#x5E76;&#x4FDD;&#x6301;&#x8F6F;&#x4EF6;&#x8BA1;&#x5212;&#x3001;&#x4EA7;&#x54C1;&#x548C;&#x6D3B;&#x52A8;&#x4E0E;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x3002;</p>
<p><strong>&#x8BF7;&#x4EE5;&#x201C;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x7BA1;&#x7406;&#x201D;&#x4E3A;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#x9700;&#x6C42;&#x7BA1;&#x7406;&#x8FC7;&#x7A0B;&#x4E2D;&#x5404;&#x4E2A;&#x6D3B;&#x52A8;&#x4E2D;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x662F;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x7BA1;&#x7406;&#x7684;&#xFF0C;&#x5B9E;&#x65BD;&#x7684;&#x5177;&#x4F53;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;</li>
</ol>
<h2 id="2-&#x8BBA;&#x975E;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x5BF9;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x5F71;&#x54CD;">2. &#x8BBA;&#x975E;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x5BF9;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x5F71;&#x54CD;</h2>
<p>&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x67B6;&#x6784;(Enterprise Application Architecture) &#x63CF;&#x8FF0;&#x4E86;&#x4F01;&#x4E1A; IT &#x7CFB;&#x7EDF;&#x7684;&#x529F;&#x80FD;&#x548C;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x5185;&#x5BB9;&#xFF0C;&#x5B83;&#x5728;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x5316;&#x5EFA;&#x8BBE;&#x4E2D;&#x8D77;&#x5230;&#x4E86;&#x7EDF;&#x4E00;&#x89C4;&#x5212;&#x3001;&#x627F;&#x4E0A;&#x542F;&#x4E0B;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5411;&#x4E0A;&#x627F;&#x63A5;&#x4E86;&#x4F01;&#x4E1A;&#x6218;&#x7565;&#x53D1;&#x5C55;&#x65B9;&#x5411;&#x548C;&#x4E1A;&#x52A1;&#x6A21;&#x5F0F;&#xFF0C;&#x5411;&#x4E0B;&#x89C4;&#x5212;&#x548C;&#x6307;&#x5BFC;&#x4F01;&#x4E1A;&#x5404; IT &#x7CFB;&#x7EDF;&#x7684;&#x5B9A;&#x4F4D;&#x548C;&#x529F;&#x80FD;&#x3002;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x5305;&#x62EC;&#x4E86;&#x4F01;&#x4E1A;&#x7684;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x84DD;&#x56FE;&#x3001;&#x67B6;&#x6784;&#x6807;&#x51C6;&#x3001;&#x7CFB;&#x7EDF;&#x7684;&#x8FB9;&#x754C;&#x548C;&#x5B9A;&#x4E49;&#x3001;&#x7CFB;&#x7EDF;&#x95F4;&#x7684;&#x5173;&#x8054;&#x5173;&#x7CFB;&#x7B49;&#x3002;&#x5176;&#x4E2D;&#x975E;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x662F;&#x8FDB;&#x884C;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x65F6;&#x9700;&#x8981;&#x91CD;&#x70B9;&#x8003;&#x8651;&#x7684;&#x56E0;&#x7D20;&#xFF0C;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x975E;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x4ECE;&#x4E0D;&#x540C;&#x4FA7;&#x9762;&#x5F71;&#x54CD;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x3002;</p>
<p><strong>&#x8BF7;&#x4EE5;&#x201C;&#x975E;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x5BF9;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x5F71;&#x54CD;&#x201D;&#x4E3A;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x5206;&#x6790;&#x5728;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E2D;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x54EA;&#x4E9B;&#x975E;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#xFF0C;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x8FD9;&#x4E9B;&#x975E;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x662F;&#x5982;&#x4F55;&#x5F71;&#x54CD;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x5728;&#x8FDB;&#x884C;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x65F6;&#xFF0C;&#x8003;&#x8651;&#x4E86;&#x54EA;&#x4E9B;&#x975E;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#xFF0C;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x6EE1;&#x8DB3;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x8FD9;&#x4E9B;&#x975E;&#x529F;&#x80FD;&#x6027;&#x9700;&#x6C42;&#x3002;</li>
</ol>
<h2 id="3-&#x8BBA;&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;">3. &#x8BBA;&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;</h2>
<p>&#x73B0;&#x4EE3;&#x519B;&#x4E8B;&#x548C;&#x5546;&#x7528;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x968F;&#x7740;&#x7CFB;&#x7EDF;&#x4E2D;&#x8F6F;&#x4EF6;&#x6210;&#x5206;&#x7684;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#xFF0C;&#x7CFB;&#x7EDF;&#x5BF9;&#x8F6F;&#x4EF6;&#x7684;&#x4F9D;&#x8D56;&#x6027;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#x3002;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x5DF2;&#x6210;&#x4E3A;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;&#x5B9E;&#x8DF5;&#x8BC1;&#x660E;&#xFF0C;&#x4FDD;&#x969C;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6700;&#x6709;&#x6548;&#x3001;&#x6700;&#x7ECF;&#x6D4E;&#x3001;&#x6700;&#x91CD;&#x8981;&#x7684;&#x624B;&#x6BB5;&#x662F;&#x5728;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x9636;&#x6BB5;&#x91C7;&#x53D6;&#x63AA;&#x65BD;&#x8FDB;&#x884C;&#x53EF;&#x9760;&#x6027;&#x63A7;&#x5236;&#xFF0C;&#x7531;&#x6B64;&#x63D0;&#x51FA;&#x4E86;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x7684;&#x6982;&#x5FF5;&#x3002;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x5C31;&#x662F;&#x5728;&#x5E38;&#x89C4;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x5404;&#x79CD;&#x65B9;&#x6CD5;&#x548C;&#x6280;&#x672F;&#xFF0C;&#x4F7F;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x5728;&#x517C;&#x987E;&#x7528;&#x6237;&#x7684;&#x529F;&#x80FD;&#x548C;&#x6027;&#x80FD;&#x9700;&#x6C42;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x5168;&#x9762;&#x6EE1;&#x8DB3;&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x9760;&#x6027;&#x8981;&#x6C42;&#x3002;</p>
<p><strong>&#x8BF7;&#x4EE5;&#x201C;&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x201D;&#x4E3A;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7B80;&#x8981;&#x8BF4;&#x660E;&#x76EE;&#x524D;&#x6BD4;&#x8F83;&#x4E3B;&#x6D41;&#x7684;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#xFF0C;&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x9610;&#x8FF0;&#x6240;&#x9009;&#x62E9;&#x7684;&#x53EF;&#x9760;&#x6027;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x53CA;&#x5176;&#x539F;&#x56E0;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x4F60;&#x5177;&#x4F53;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#xFF0C;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x6240;&#x9009;&#x53D6;&#x7684;&#x8F6F;&#x4EF6;&#x53EF;&#x9760;&#x6027;&#x6280;&#x672F;&#x7684;&#x5177;&#x4F53;
&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x8BE6;&#x7EC6;&#x5206;&#x6790;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x3002;</li>
</ol>
<h2 id="4-&#x8BBA;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#x8BBE;&#x8BA1;">4. &#x8BBA;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#x8BBE;&#x8BA1;</h2>
<p>&#x968F;&#x7740;&#x793E;&#x4F1A;&#x4FE1;&#x606F;&#x5316;&#x7684;&#x666E;&#x53CA;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x5728;&#x5404;&#x884C;&#x5404;&#x4E1A;&#x5F97;&#x5230;&#x4E86;&#x5E7F;&#x6CDB;&#x7684;&#x5E94;&#x7528;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x4E1A;&#x52A1;&#x5904;&#x7406;&#x51E0;&#x4E4E;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x7F51;&#x7EDC;&#x6267;&#x884C;&#xFF0C;&#x5404;&#x79CD;&#x91CD;&#x8981;&#x6570;&#x636E;&#x5982;&#x653F;&#x5E9C;&#x6587;&#x4EF6;&#x3001;&#x5DE5;&#x8D44;&#x6863;&#x6848;&#x3001;&#x8D22;&#x52A1;&#x8D26;&#x76EE;&#x548C;&#x4EBA;&#x4E8B;&#x6863;&#x6848;&#x7B49;&#x5747;&#x4F9D;&#x8D56;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x5B58;&#x50A8;&#x4E0E;&#x4F20;&#x8F93;&#x3002;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x9488;&#x5BF9;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x7F51;&#x7EDC;&#x7684;&#x653B;&#x51FB;&#x6D3B;&#x52A8;&#x65E5;&#x76CA;&#x7316;&#x7357;&#xFF0C;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x5F53;&#x524D;&#x793E;&#x4F1A;&#x7684;&#x4E3B;&#x8981;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x4E4B;&#x4E00;&#x3002;</p>
<p>&#x5728;&#x4E0A;&#x8FF0;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x56FD;&#x5BB6;&#x6807;&#x51C6;&#x300A;&#x4FE1;&#x606F;&#x5904;&#x7406;&#x7CFB;&#x7EDF;&#x5DE5;&#x7A0B;&#x5F00;&#x653E;&#x7CFB;&#x7EDF;&#x4E92;&#x8054;&#x57FA;&#x672C;&#x53C2;&#x8003;&#x6A21;&#x578B;&#x2014;&#x2014;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF1A;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x300B;&#xFF08;GB/T 9387.2-1995&#xFF09;&#x5B9A;&#x4E49;&#x4E86;&#x57FA;&#x4E8E; OSI &#x53C2;&#x8003;&#x6A21;&#x578B; 7 &#x5C42;&#x534F;&#x8BAE;&#x4E4B;&#x4E0A;&#x7684;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#xFF0C;&#x5176;&#x6838;&#x5FC3;&#x5185;&#x5BB9;&#x662F;&#xFF1A;&#x4E3A;&#x4E86;&#x4FDD;&#x8BC1;&#x5F02;&#x6784;&#x8BA1;&#x7B97;&#x673A;&#x8FDB;&#x7A0B;&#x4E0E;&#x8FDB;&#x7A0B;&#x4E4B;&#x95F4;&#x8FDC;&#x8DDD;&#x79BB;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x5B9A;&#x4E49;&#x4E86;&#x8BA4;&#x8BC1;&#x670D;&#x52A1;&#x3001;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x670D;&#x52A1;&#x3001;&#x6570;&#x636E;&#x673A;&#x5BC6;&#x6027;&#x670D;&#x52A1;&#x3001;&#x6570;&#x636E;&#x5B8C;&#x6574;&#x6027;&#x670D;&#x52A1;&#x548C;&#x6297;&#x62B5;&#x8D56;&#x6027;&#x670D;&#x52A1;&#x7B49;5 &#x5927;&#x7C7B;&#x5B89;&#x5168;&#x670D;&#x52A1;&#xFF0C;&#x4EE5;&#x53CA;&#x63D0;&#x4F9B;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x7684; 8 &#x7C7B;&#x5B89;&#x5168;&#x673A;&#x5236;&#x53CA;&#x76F8;&#x5E94;&#x7684; OSI &#x5B89;&#x5168;&#x7BA1;&#x7406;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x5177;&#x4F53;&#x7CFB;&#x7EDF;&#x9002;&#x5F53;&#x914D;&#x7F6E;&#x4E8E; OSI &#x6A21;&#x578B;&#x7684; 7 &#x5C42;&#x534F;&#x8BAE;&#x4E4B;&#x4E2D;&#x3002;</p>
<p><strong>&#x8BF7;&#x4EE5;&#x201C;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#x8BBE;&#x8BA1;&#x201D;&#x4E3A;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E76;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x8BE5;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5728;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x65B9;&#x9762;&#x7684;&#x8981;&#x6C42;&#x3002;</li>
<li>&#x8BF7;&#x5BF9; GB/T 9387.2-1995 &#x4E2D;&#x5B9A;&#x4E49;&#x7684; 5 &#x5927;&#x7C7B;&#x5B89;&#x5168;&#x670D;&#x52A1;&#x8FDB;&#x884C;&#x63CF;&#x8FF0;&#xFF0C;&#x9610;&#x8FF0;&#x6BCF;&#x7C7B;&#x5B89;&#x5168;&#x670D;&#x52A1;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x4E3B;&#x8981;&#x5B9E;&#x73B0;&#x624B;&#x6BB5;&#x3002;</li>
<li>&#x8BF7;&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#xFF0C;&#x5177;&#x4F53;&#x9610;&#x8FF0;&#x4F60;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x4E0A;&#x8FF0; 5 &#x5927;&#x7C7B;&#x5B89;&#x5168;&#x670D;&#x52A1;&#x4E2D;&#x7684;&#x54EA;&#x4E9B;&#x670D;&#x52A1;&#xFF0C;&#x5177;&#x4F53;&#x8FD0;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x5B9E;&#x73B0;&#x624B;&#x6BB5;&#x3002; </li>
</ol>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Lacuz 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2022-10-24
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2013.html" class="navigation navigation-prev " aria-label="Previous page: 2013">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2015.html" class="navigation navigation-next " aria-label="Next page: 2015">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2014","level":"1.3.1.7","depth":3,"next":{"title":"2015","level":"1.3.1.8","depth":3,"path":"4论文范文/历年真题/2015.md","ref":"4论文范文/历年真题/2015.md","articles":[]},"previous":{"title":"2013","level":"1.3.1.6","depth":3,"path":"4论文范文/历年真题/2013.md","ref":"4论文范文/历年真题/2013.md","articles":[]},"dir":"ltr"},"config":{"plugins":["splitter","code","hide-element","pageview-count","popup","tbfed-pagefooter","-sharing","sharing-plus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Lacuz 2020","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"pageview-count":{},"sharing":{"qq":true,"qzone":true,"weibo":true,"all":["weibo","qq","qzone"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Lacuz","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"系统架构设计师","language":"zh-hans","gitbook":"*","description":"系统架构设计师考试"},"file":{"path":"4论文范文/历年真题/2014.md","mtime":"2022-10-24T04:44:08.681Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-24T04:45:14.725Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

