
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2015 · 系统架构设计师</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Lacuz">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2016.html" />
    
    
    <link rel="prev" href="2014.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../readme.html">
            
                <a href="../../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="2009.html">
            
                <a href="2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="2010.html">
            
                <a href="2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="2011.html">
            
                <a href="2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="2012.html">
            
                <a href="2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="2013.html">
            
                <a href="2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="2014.html">
            
                <a href="2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.8" data-path="2015.html">
            
                <a href="2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="2016.html">
            
                <a href="2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="2017.html">
            
                <a href="2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="2018.html">
            
                <a href="2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="2019.html">
            
                <a href="2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="2020.html">
            
                <a href="2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="2021.html">
            
                <a href="2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../16-题2-论软件设计模式及其应用.html">
            
                <a href="../16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2015</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2015-&#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;">2015 &#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;</h1>
<h2 id="&#x8BBA;&#x6587;1-&#x8BBA;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x57FA;&#x7840;&#x8F6F;&#x4EF6;">&#x8BBA;&#x6587;1. &#x8BBA;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x57FA;&#x7840;&#x8F6F;&#x4EF6;</h2>
<p>&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x662F;&#x5728;&#x5F53;&#x4ECA;&#x57FA;&#x4E8E;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x4F01;&#x4E1A;&#x7EA7;&#x5E94;&#x7528;&#x8FC5;&#x901F;&#x53D1;&#x5C55;&#xFF0C;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x5E94;&#x7528;&#x51FA;&#x73B0;&#x5E76;&#x5FEB;&#x901F;&#x81A8;&#x80C0;&#x7684;&#x9700;&#x6C42;&#x4E0B;&#x4EA7;&#x751F;&#x7684;&#x4E00;&#x79CD;&#x65B0;&#x6280;&#x672F;&#x3002;&#x5728;&#x5206;&#x5E03;&#x5F0F;&#x3001;&#x591A;&#x5C42;&#x7ED3;&#x6784;&#x53CA;&#x57FA;&#x4E8E;&#x7EC4;&#x4EF6;&#x548C;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x7684;&#x4F01;&#x4E1A;&#x7EA7;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x63D0;&#x4F9B;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x53D1;&#x3001;&#x90E8;&#x7F72;&#x3001;&#x8FD0;&#x884C;&#x548C;&#x7BA1;&#x7406;&#x3001;&#x7EF4;&#x62A4;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x63D0;&#x4F9B;&#x8F6F;&#x4EF6;&#x201C;&#x96C6;&#x7FA4;&#x201D;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5F02;&#x6784;&#x670D;&#x52A1;&#x5668;&#x534F;&#x540C;&#x5DE5;&#x4F5C;&#x3001;&#x76F8;&#x4E92;&#x5907;&#x4EFD;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x4F01;&#x4E1A;&#x7EA7;&#x5E94;&#x7528;&#x6240;&#x9700;&#x8981;&#x7684;&#x9AD8;&#x53EF;&#x7528;&#x6027;&#x3001;&#x9AD8;&#x6027;&#x80FD;&#x3001;&#x9AD8;&#x53EF;&#x9760;&#x6027;&#x548C;&#x53EF;&#x4F38;&#x7F29;&#x6027;&#x7B49;&#x5B9E;&#x9645;&#x9700;&#x6C42;&#x3002;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x6280;&#x672F;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x80FD;&#x591F;&#x52A0;&#x5FEB;&#x5E94;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x901F;&#x5EA6;&#xFF0C;&#x51CF;&#x5C11;&#x5E94;&#x7528;&#x7684;&#x5F00;&#x53D1;&#x91CF;&#x3002;&#x901A;&#x8FC7;&#x9694;&#x79BB;&#x5E95;&#x5C42;&#x7EC6;&#x8282;&#xFF0C;&#x4FBF;&#x4E8E;&#x5546;&#x4E1A;&#x903B;&#x8F91;&#x7684;&#x5B9E;&#x73B0;&#x4E0E;&#x6269;&#x5C55;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x4E3A;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x73B0;&#x6210;&#x7684;&#x3001;&#x7A33;&#x5B9A;&#x7684;&#x3001;&#x7075;&#x6D3B;&#x7684;&#x3001;&#x6210;&#x719F;&#x7684;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x3002;</p>
<p><strong>&#x8BF7;&#x4EE5;&#x201C;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x57FA;&#x7840;&#x8F6F;&#x4EF6;&#x201D;&#x4E3A;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#xFF1A;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BBA;&#x8FF0;&#x5E76;&#x5206;&#x6790;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#x5728;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x3001;&#x5F00;&#x53D1;&#x3001;&#x90E8;&#x7F72;&#x3001;&#x8FD0;&#x884C;&#x548C;&#x7BA1;&#x7406;&#x9636;&#x6BB5;&#xFF0C;&#x5E94;&#x8BE5;&#x63D0;&#x4F9B;&#x54EA;&#x4E9B;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF1F;</li>
<li>&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#xFF0C;&#x91C7;&#x7528;&#x4E86;&#x54EA;&#x79CD;&#x5E94;&#x7528;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x3001;&#x90E8;&#x7F72;&#x548C;&#x8FD0;&#x884C;&#x9636;&#x6BB5;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;</li>
</ol>
<h2 id="2-&#x8BBA;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x98CE;&#x683C;">2. &#x8BBA;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x98CE;&#x683C;</h2>
<p>&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x98CE;&#x683C;&#xFF08;System Architecture Style&#xFF09;&#x662F;&#x63CF;&#x8FF0;&#x67D0;&#x4E00;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x4E2D;&#x7CFB;&#x7EDF;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x7684;&#x60EF;&#x7528;&#x6A21;&#x5F0F;.&#x67B6;&#x6784;&#x98CE;&#x683C;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x8BCD;&#x6C47;&#x8868;&#x548C;&#x4E00;&#x7EC4;&#x7EA6;&#x675F;&#xFF0C;&#x8BCD;&#x6C47;&#x8868;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x6784;&#x4EF6;&#x548C;&#x8FDE;&#x63A5;&#x4EF6;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x8FD9;&#x7EC4;&#x7EA6;&#x675F;&#x6307;&#x51FA;&#x7CFB;&#x7EDF;&#x662F;&#x5982;&#x4F55;&#x5C06;&#x8FD9;&#x4E9B;&#x6784;&#x4EF6;&#x548C;&#x8FDE;&#x63A5;&#x4EF6;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x7684;&#x53E3;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x53CD;&#x6620;&#x4E86;&#x9886;&#x57DF;&#x4E2D;&#x4F17;&#x591A;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x6240;&#x5171;&#x6709;&#x7684;&#x7ED3;&#x6784;&#x548C;&#x8BED;&#x4E49;&#x7279;&#x6027;&#xFF0C;&#x5E76;&#x6307;&#x5BFC;&#x5982;&#x4F55;&#x5C06;&#x5404;&#x4E2A;&#x6A21;&#x5757;&#x548C;&#x5B50;&#x7CFB;&#x7EDF;&#x6709;&#x6548;&#x5730;&#x7EC4;&#x7EC7;&#x6210;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7CFB;&#x7EDF;&#x3002;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x7684;&#x5171;&#x6709;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x4F7F;&#x5F97;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x5171;&#x4EAB;&#x540C;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#xFF0C;&#x7CFB;&#x7EDF;&#x80FD;&#x591F;&#x6309;&#x7167;&#x5E38;&#x7528;&#x7684;&#x3001;&#x89C4;&#x8303;&#x5316;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x7EC4;&#x7EC7;&#xFF0C;&#x4FBF;&#x4E8E;&#x4E0D;&#x540C;&#x8BBE;&#x8BA1;&#x8005;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x7406;&#x89E3;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x3002;</p>
<p><strong>&#x8BF7;&#x4EE5;&#x201C;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#xFF1A;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x5206;&#x6790;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x6BCF;&#x79CD;&#x98CE;&#x683C;&#x7684;&#x5177;&#x4F53;&#x542B;&#x4E49;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x5728;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x91C7;&#x7528;&#x4E86;&#x54EA;&#x79CD;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x98CE;&#x683C;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;</li>
</ol>
<h2 id="3-&#x8BBA;&#x9762;&#x5411;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;">3. &#x8BBA;&#x9762;&#x5411;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x9762;&#x5411;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#xFF08;Service-Oriented Architecture,SOA&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x7EC4;&#x4EF6;&#x6A21;&#x578B;&#xFF0C;&#x628A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x4E0D;&#x540C;&#x529F;&#x80FD;&#x5355;&#x5143;&#xFF08;&#x5373;&#x670D;&#x52A1;&#xFF09;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x5B9A;&#x4E49;&#x826F;&#x597D;&#x7684;&#x63A5;&#x53E3;&#x548C;&#x5951;&#x7EA6;&#x8054;&#x7CFB;&#x8D77;&#x6765;&#xFF0C;&#x4F7F;&#x5F97;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x670D;&#x52A1;&#x80FD;&#x591F;&#x4EE5;-&#x79CD;&#x7EDF;&#x4E00;&#x548C;&#x901A;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;&#x4ECE;&#x5E94;&#x7528;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;SOA &#x662F;&#x4E00;&#x79CD;&#x5E94;&#x7528;&#x6846;&#x67B6;&#xFF0C;&#x5B83;&#x5173;&#x6CE8;&#x4F01;&#x4E1A;&#x65E5;&#x5E38;&#x7684;&#x4E1A;&#x52A1;&#x5E94;&#x7528;&#xFF0C;&#x5C06;&#x5176;&#x5212;&#x5206;&#x4E3A;&#x5355;&#x72EC;&#x7684;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x548C;&#x6D41;&#x7A0B;&#xFF0C;&#x5E76;&#x62BD;&#x8C61;&#x4E3A;&#x670D;&#x52A1;&#xFF0C;&#x7528;&#x6237;&#x548C;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x3001;&#x90E8;&#x7F72;&#x548C;&#x6574;&#x5408;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#xFF0C;&#x65E0;&#x9700;&#x4F9D;&#x8D56;&#x7279;&#x5B9A;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53CA;&#x5E94;&#x7528;&#x5E73;&#x53F0;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x4F01;&#x4E1A;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;SOA &#x6709;&#x52A9;&#x4E8E;&#x5B9E;&#x73B0;&#x66F4;&#x591A;&#x7684;&#x4FE1;&#x606F;&#x8D44;&#x4EA7;&#x91CD;&#x7528;&#x3001;&#x66F4;&#x8F7B;&#x677E;&#x5730;&#x7BA1;&#x7406;&#x548C;&#x66F4;&#x5FEB;&#x5730;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x4E0E;&#x90E8;&#x7F72;&#x3002;</p>
<p><strong>&#x8BF7;&#x4EE5;&#x201C;&#x9762;&#x5411;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x201D;&#x4E3A;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#xFF1A;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5B9E;&#x65BD;&#x7684;&#x3001;&#x57FA;&#x4E8E;&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x6307;&#x51FA; SOA &#x6280;&#x672F;&#x53C2;&#x8003;&#x67B6;&#x6784;&#x4E2D;&#x90FD;&#x5305;&#x542B;&#x54EA;&#x4E9B;&#x670D;&#x52A1;&#x7C7B;&#x522B;&#xFF0C;&#x5E76;&#x5BF9;&#x6BCF;&#x7C7B;&#x670D;&#x52A1;&#x7684;&#x5B9A;&#x4E49;&#x548C;&#x4F5C;&#x7528;&#x8FDB;&#x884C;&#x7B80;&#x8981;&#x8BF4;&#x660E;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x4F60;&#x7684;&#x9879;&#x76EE;&#x662F;&#x5982;&#x4F55;&#x4EE5;&#x9762;&#x5411;&#x670D;&#x52A1;&#x7684;&#x67B6;&#x6784;&#x4E3A;&#x6307;&#x5BFC;&#x8FDB;&#x884C;&#x5B9E;&#x65BD;&#x7684;&#xFF0C;&#x5728;&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x7684;&#x3002;</li>
</ol>
<h2 id="4-&#x8BBA;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x6280;&#x672F;&#x4E0E;&#x5E94;&#x7528;">4. &#x8BBA;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x6280;&#x672F;&#x4E0E;&#x5E94;&#x7528;</h2>
<p>&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x662F;&#x4E00;&#x4E2A;&#x652F;&#x6301;&#x590D;&#x6742;&#x4FE1;&#x606F;&#x73AF;&#x5883;&#x4E0B;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x3001;&#x96C6;&#x6210;&#x548C;&#x534F;&#x540C;&#x8FD0;&#x884C;&#x7684;&#x8F6F;&#x4EF6;&#x652F;&#x6491;&#x73AF;&#x5883;&#x3002;&#x5B83;&#x57FA;&#x4E8E;&#x5404;&#x79CD;&#x4F01;&#x4E1A;&#x7ECF;&#x8425;&#x4E1A;&#x52A1;&#x7684;&#x4FE1;&#x606F;&#x7279;&#x5F81;&#xFF0C;&#x5728;&#x5F02;&#x6784;&#x5206;&#x5E03;&#x73AF;&#x5883;&#xFF08;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x7F51;&#x7EDC;&#x3001;&#x6570;&#x636E;&#x5E93;&#xFF09;&#x4E0B;&#x4E3A;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x4E00;&#x81F4;&#x7684;&#x4FE1;&#x606F;&#x8BBF;&#x95EE;&#x548C;&#x4EA4;&#x4E92;&#x624B;&#x6BB5;&#xFF0C;&#x5BF9;&#x5176;&#x4E0A;&#x8FD0;&#x884C;&#x7684;&#x5E94;&#x7528;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C;&#x4E3A;&#x5E94;&#x7528;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x5E76;&#x652F;&#x6301;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x73AF;&#x5883;&#x4E0B;&#x5404;&#x7279;&#x5B9A;&#x9886;&#x57DF;&#x7684;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x7684;&#x96C6;&#x6210;&#x3002;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x6838;&#x5FC3;&#x662F;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x67B6;&#x6784;&#xFF0C;&#x5305;&#x62EC;&#x4FE1;&#x606F;&#x3001;&#x8FC7;&#x7A0B;&#x3001;&#x5E94;&#x7528;&#x96C6;&#x6210;&#x7684;&#x67B6;&#x6784;&#x3002;</p>
<p><strong>&#x8BF7;&#x4EE5;&#x201C;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x6280;&#x672F;&#x4E0E;&#x5E94;&#x7528;&#x201D;&#x4E3A;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#xFF1A;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x76F8;&#x5173;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x7B80;&#x8981;&#x8BF4;&#x660E;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x57FA;&#x672C;&#x529F;&#x80FD;&#x53CA;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x7684;&#x5173;&#x952E;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#xFF0C;&#x9610;&#x8FF0;&#x8BE5;&#x9879;&#x76EE;&#x6240;&#x9009;&#x62E9;&#x7684;&#x5173;&#x952E;&#x6280;&#x672F;&#x53CA;&#x5176;&#x539F;&#x56E0;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x4F60;&#x5177;&#x4F53;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#xFF0C;&#x4E3E;&#x4F8B;&#x8BF4;&#x660E;&#x6240;&#x91C7;&#x7528;&#x7684;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x65B9;&#x5F0F;&#x53CA;&#x8FC7;&#x7A0B;&#xFF0C;&#x5E76;&#x8BE6;&#x7EC6;&#x5206;&#x6790;&#x5176;&#x5B9E;&#x73B0;&#x6548;&#x679C;&#x3002; </li>
</ol>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Lacuz 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2022-10-24
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2014.html" class="navigation navigation-prev " aria-label="Previous page: 2014">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2016.html" class="navigation navigation-next " aria-label="Next page: 2016">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2015","level":"1.3.1.8","depth":3,"next":{"title":"2016","level":"1.3.1.9","depth":3,"path":"4论文范文/历年真题/2016.md","ref":"4论文范文/历年真题/2016.md","articles":[]},"previous":{"title":"2014","level":"1.3.1.7","depth":3,"path":"4论文范文/历年真题/2014.md","ref":"4论文范文/历年真题/2014.md","articles":[]},"dir":"ltr"},"config":{"plugins":["splitter","code","hide-element","pageview-count","popup","tbfed-pagefooter","-sharing","sharing-plus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Lacuz 2020","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"pageview-count":{},"sharing":{"qq":true,"qzone":true,"weibo":true,"all":["weibo","qq","qzone"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Lacuz","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"系统架构设计师","language":"zh-hans","gitbook":"*","description":"系统架构设计师考试"},"file":{"path":"4论文范文/历年真题/2015.md","mtime":"2022-10-24T04:44:08.681Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-24T04:45:14.725Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

