
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2016 · 系统架构设计师</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Lacuz">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2017.html" />
    
    
    <link rel="prev" href="2015.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../readme.html">
            
                <a href="../../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="2009.html">
            
                <a href="2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="2010.html">
            
                <a href="2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="2011.html">
            
                <a href="2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="2012.html">
            
                <a href="2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="2013.html">
            
                <a href="2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="2014.html">
            
                <a href="2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="2015.html">
            
                <a href="2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.9" data-path="2016.html">
            
                <a href="2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="2017.html">
            
                <a href="2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="2018.html">
            
                <a href="2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="2019.html">
            
                <a href="2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="2020.html">
            
                <a href="2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="2021.html">
            
                <a href="2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../16-题2-论软件设计模式及其应用.html">
            
                <a href="../16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2016</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2016-&#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;">2016 &#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;</h1>
<h2 id="&#x8BBA;&#x6587;1-&#x8BBA;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BC4;&#x4F30;">&#x8BBA;&#x6587;1. &#x8BBA;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BC4;&#x4F30;</h2>
<p>&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5927;&#x89C4;&#x6A21;&#x7684;&#x590D;&#x6742;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#xFF0C;&#x8F6F;&#x4EF6;&#x7684;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5BF9;&#x4E8E;&#x786E;&#x4FDD;&#x6700;&#x7EC8;&#x7CFB;&#x7EDF;&#x7684;&#x8D28;&#x91CF;&#x5177;&#x6709;&#x5341;&#x5206;&#x91CD;&#x8981;&#x7684;&#x610F;&#x4E49;&#xFF0C;&#x4E0D;&#x6070;&#x5F53;&#x7684;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5C06;&#x7ED9;&#x9879;&#x76EE;&#x5F00;&#x53D1;&#x5E26;&#x6765;&#x9AD8;&#x6602;&#x7684;&#x4EE3;&#x4EF7;&#x548C;&#x96BE;&#x4EE5;&#x907F;&#x514D;&#x7684;&#x707E;&#x96BE;&#x3002;&#x5BF9;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#xFF0C;&#x662F;&#x4E3A;&#x4E86;&#xFF1A;&#x5206;&#x6790;&#x73B0;&#x6709;&#x67B6;&#x6784;&#x5B58;&#x5728;&#x7684;&#x6F5C;&#x5728;&#x98CE;&#x9669;&#xFF0C;&#x68C0;&#x9A8C;&#x8BBE;&#x8BA1;&#x4E2D;&#x63D0;&#x51FA;&#x7684;&#x8D28;&#x91CF;&#x9700;&#x6C42;&#xFF0C;&#x5728;&#x7CFB;&#x7EDF;&#x88AB;&#x6784;&#x5EFA;&#x4E4B;&#x524D;&#x5206;&#x6790;&#x73B0;&#x6709;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5BF9;&#x4E8E;&#x7CFB;&#x7EDF;&#x8D28;&#x91CF;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x63D0;&#x51FA;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x7684;&#x6539;&#x8FDB;&#x65B9;&#x6848;&#x3002;&#x67B6;&#x6784;&#x8BC4;&#x4F30;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x73AF;&#x8282;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8BBA;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BC4;&#x4F30;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x67B6;&#x6784;&#x8BC4;&#x4F30;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x8BC4;&#x4F30;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x5206;&#x6790;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BC4;&#x4F30;&#x4E2D;&#x6240;&#x666E;&#x904D;&#x5173;&#x6CE8;&#x7684;&#x8D28;&#x91CF;&#x5C5E;&#x6027;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x6BCF;&#x79CD;&#x8D28;&#x91CF;&#x5C5E;&#x6027;&#x7684;&#x5177;&#x4F53;&#x542B;&#x4E49;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x8BC4;&#x4F30;&#x4E2D;&#xFF0C;&#x91C7;&#x7528;&#x4E86;&#x54EA;&#x79CD;&#x8BC4;&#x4F30;&#x65B9;&#x6CD5;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x65C5;&#x8FC7;&#x7A0B;&#x548C;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;</li>
</ol>
<h2 id="2-&#x8BBA;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53CA;&#x5176;&#x5E94;&#x7528;">2. &#x8BBA;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF08;Software Design Pattern&#xFF09;&#x662F;&#x4E00;&#x5957;&#x88AB;&#x53CD;&#x590D;&#x4F7F;&#x7528;&#x7684;&#x3001;&#x591A;&#x6570;&#x4EBA;&#x77E5;&#x6653;&#x7684;&#x3001;&#x7ECF;&#x8FC7;&#x5206;&#x7C7B;&#x7F16;&#x76EE;&#x7684;&#x4EE3;&#x7801;&#x8BBE;&#x8BA1;&#x7ECF;&#x9A8C;&#x7684;&#x603B;&#x7ED3;&#x3002;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x4E3A;&#x4E86;&#x91CD;&#x7528;&#x4EE3;&#x7801;&#x4EE5;&#x63D0;&#x9AD8;&#x7F16;&#x7801;&#x6548;&#x7387;&#x3001;&#x589E;&#x52A0;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x7406;&#x89E3;&#x6027;&#x3001;&#x4FDD;&#x8BC1;&#x4EE3;&#x7801;&#x7684;&#x53EF;&#x9760;&#x6027;&#x3002;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x7684;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#x4E4B;&#x4E00;&#xFF0C;&#x5B83;&#x7ECF;&#x5E38;&#x88AB;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5728;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x91C7;&#x7528;&#x3002;&#x9879;&#x76EE;&#x4E2D;&#x5408;&#x7406;&#x5730;&#x8FD0;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53EF;&#x4EE5;&#x5B8C;&#x7F8E;&#x5730;&#x89E3;&#x51B3;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF0C;&#x6BCF;&#x79CD;&#x6A21;&#x5F0F;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x4E2D;&#x90FD;&#x6709;&#x76F8;&#x5E94;&#x7684;&#x539F;&#x578B;&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#xFF0C;&#x6BCF;&#x79CD;&#x6A21;&#x5F0F;&#x90FD;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x53D1;&#x751F;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x8BE5;&#x539F;&#x578B;&#x95EE;&#x9898;&#x7684;&#x6838;&#x5FC3;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8BBA;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BF4;&#x660E;&#x5E38;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x6709;&#x54EA;&#x51E0;&#x7C7B;&#xFF1F;&#x9610;&#x8FF0;&#x6BCF;&#x79CD;&#x7C7B;&#x578B;&#x7279;&#x70B9;&#x53CA;&#x5176;&#x6240;&#x5305;&#x542B;&#x7684;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;3. &#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x91C7;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;</li>
</ol>
<h2 id="3-&#x8BBA;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x53CA;&#x5176;&#x5E94;&#x7528;">3. &#x8BBA;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x5728;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x7684;&#x5F00;&#x53D1;&#x4E0E;&#x5EFA;&#x8BBE;&#x4E2D;&#xFF0C;&#x5206;&#x5C42;&#x8BBE;&#x8BA1;&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#xFF0C;&#x533A;&#x5206;&#x5C42;&#x6B21;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;&#x201C;&#x9AD8;&#x5185;&#x805A;&#x4F4E;&#x8026;&#x5408;&#x201D;&#x7684;&#x601D;&#x60F3;&#x3002;&#x5206;&#x5C42;&#x8BBE;&#x8BA1;&#x80FD;&#x6709;&#x6548;&#x7B80;&#x5316;&#x7CFB;&#x7EDF;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x4F7F;&#x8BBE;&#x8BA1;&#x7ED3;&#x6784;&#x6E05;&#x6670;&#xFF0C;&#x4FBF;&#x4E8E;&#x63D0;&#x9AD8;&#x590D;&#x7528;&#x80FD;&#x529B;&#x548C;&#x4EA7;&#x54C1;&#x7EF4;&#x62A4;&#x80FD;&#x529B;&#x3002;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x5C42;&#x6B21;&#x5212;&#x5206;&#x6A21;&#x578B;&#x662F;&#x5C06;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x5206;&#x4E3A;&#x8868;&#x73B0;&#x5C42;&#x3001;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x5C42;&#x548C;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x3002;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x4E00;&#x822C;&#x4EE5;&#x6570;&#x636E;&#x4E3A;&#x4E2D;&#x5FC3;&#xFF0C;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x7684;&#x8BBE;&#x8BA1;&#x662F;&#x7CFB;&#x7EDF;&#x8BBE;&#x8BA1;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x5185;&#x5BB9;&#x3002;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x9700;&#x8981;&#x9488;&#x5BF9;&#x9700;&#x6C42;&#xFF0C;&#x63D0;&#x4F9B;&#x5BF9;&#x6570;&#x636E;&#x6E90;&#x8BFB;&#x5199;&#x7684;&#x8BBF;&#x95EE;&#x63A5;&#x53E3;&#xFF1B;&#x5728;&#x4FDD;&#x969C;&#x6027;&#x80FD;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x5E94;&#x5177;&#x6709;&#x826F;&#x597D;&#x7684;&#x5C01;&#x88C5;&#x6027;&#x3001;&#x53EF;&#x79FB;&#x690D;&#x6027;&#xFF0C;&#x4EE5;&#x53CA;&#x6570;&#x636E;&#x5E93;&#x65E0;&#x5173;&#x6027;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8BBA;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x4E0E;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x8BBE;&#x8BA1;&#x6709;&#x5173;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#xFF0C;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BBA;&#x8FF0;&#x5E38;&#x89C1;&#x7684;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#x53CA;&#x5176;&#x6240;&#x5305;&#x542B;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x3002;3. &#x7ED3;&#x5408;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#xFF0C;&#x5177;&#x4F53;&#x8BF4;&#x660E;&#x91C7;&#x7528;&#x4E86;&#x54EA;&#x79CD;&#x6570;&#x636E;&#x8BBF;&#x95EE;&#x5C42;&#x8BBE;&#x8BA1;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x53D9;&#x8FF0;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x4EE5;&#x53CA;&#x5E94;&#x7528;&#x6548;&#x679C;&#x3002;</li>
</ol>
<h2 id="4-&#x8BBA;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;">4. &#x8BBA;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x8FD1;&#x5E74;&#x6765;&#xFF0C;&#x968F;&#x7740;&#x4E92;&#x8054;&#x7F51;&#x884C;&#x4E1A;&#x7684;&#x8FC5;&#x731B;&#x53D1;&#x5C55;&#xFF0C;&#x516C;&#x53F8;&#x6216;&#x7EC4;&#x7EC7;&#x4E1A;&#x52A1;&#x7684;&#x4E0D;&#x65AD;&#x6269;&#x5F20;&#xFF0C;&#x9700;&#x6C42;&#x7684;&#x5FEB;&#x901F;&#x53D8;&#x5316;&#x4EE5;&#x53CA;&#x7528;&#x6237;&#x91CF;&#x7684;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x5355;&#x5757;&#xFF08;Monolithic&#xFF09;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x9762;&#x4E34;&#x7740;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x5DF2;&#x9010;&#x6E10;&#x65E0;&#x6CD5;&#x9002;&#x5E94;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x5BF9;&#x8F6F;&#x4EF6;&#x7684;&#x8981;&#x6C42;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x6A21;&#x5F0F;(Microservice Architecture Pattern)&#x9010;&#x6E10;&#x6D41;&#x884C;&#xFF0C;&#x5B83;&#x5F3A;&#x8C03;&#x5C06;&#x5355;&#x4E00;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x5F00;&#x53D1;&#x6210;&#x5FAE;&#x670D;&#x52A1;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x6BCF;&#x4E2A;&#x5FAE;&#x670D;&#x52A1;&#x8FD0;&#x884C;&#x5728;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E2D;&#xFF1B;&#x91C7;&#x7528; HTTP &#x7B49;&#x901A;&#x7528;&#x534F;&#x8BAE;&#x548C;&#x8F7B;&#x91CF;&#x7EA7; API &#x5B9E;&#x73B0;&#x5FAE;&#x670D;&#x52A1;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x4F5C;&#x4E0E;&#x901A;&#x4FE1;&#x3002;&#x8FD9;&#x4E9B;&#x5FAE;&#x670D;&#x52A1;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5F00;&#x53D1;&#x8BED;&#x8A00;&#x4EE5;&#x53CA;&#x4E0D;&#x540C;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x6280;&#x672F;&#xFF0C;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x81EA;&#x52A8;&#x5316;&#x90E8;&#x7F72;&#x5DE5;&#x5177;&#x72EC;&#x7ACB;&#x53D1;&#x5E03;&#xFF0C;&#x5E76;&#x4FDD;&#x6301;&#x6700;&#x4F4E;&#x9650;&#x5236;&#x7684;&#x96C6;&#x4E2D;&#x5F0F;&#x7BA1;&#x7406;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8BBA;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x3001;&#x91C7;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x53CA;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x4E0E;&#x5355;&#x5757;&#x67B6;&#x6784;&#x76F8;&#x6BD4;&#x8F83;&#xFF0C;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x6709;&#x54EA;&#x4E9B;&#x7279;&#x70B9;&#xFF1F;&#x8BF7;&#x5217;&#x4E3E;&#x81F3;&#x5C11; 4 &#x4E2A;&#x7279;&#x70B9;&#x5E76;&#x8FDB;&#x884C;&#x8BF4;&#x660E;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#xFF0C;&#x63CF;&#x8FF0;&#x8BE5;&#x8F6F;&#x4EF6;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x8BF4;&#x660E;&#x8BE5;&#x67B6;&#x6784;&#x662F;&#x5982;&#x4F55;&#x91C7;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x6A21;&#x5F0F;&#x7684;&#xFF0C;&#x5E76;&#x8BF4;&#x660E;&#x5728;&#x91C7;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x540E;&#xFF0C;&#x5728;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002; </li>
</ol>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Lacuz 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2022-10-24
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2015.html" class="navigation navigation-prev " aria-label="Previous page: 2015">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2017.html" class="navigation navigation-next " aria-label="Next page: 2017">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2016","level":"1.3.1.9","depth":3,"next":{"title":"2017","level":"1.3.1.10","depth":3,"path":"4论文范文/历年真题/2017.md","ref":"4论文范文/历年真题/2017.md","articles":[]},"previous":{"title":"2015","level":"1.3.1.8","depth":3,"path":"4论文范文/历年真题/2015.md","ref":"4论文范文/历年真题/2015.md","articles":[]},"dir":"ltr"},"config":{"plugins":["chapter-fold","splitter","code","hide-element","pageview-count","popup","tbfed-pagefooter","-sharing","sharing-plus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Lacuz 2020","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD"},"chapter-fold":{},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"pageview-count":{},"sharing":{"qq":true,"qzone":true,"weibo":true,"all":["weibo","qq","qzone"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Lacuz","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"系统架构设计师","language":"zh-hans","gitbook":"*","description":"系统架构设计师考试"},"file":{"path":"4论文范文/历年真题/2016.md","mtime":"2022-10-24T06:15:16.153Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-24T06:28:54.094Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-chapter-fold/chapter-fold.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

