
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2017 · 系统架构设计师</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Lacuz">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2018.html" />
    
    
    <link rel="prev" href="2016.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../readme.html">
            
                <a href="../../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="2009.html">
            
                <a href="2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="2010.html">
            
                <a href="2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="2011.html">
            
                <a href="2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="2012.html">
            
                <a href="2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="2013.html">
            
                <a href="2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="2014.html">
            
                <a href="2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="2015.html">
            
                <a href="2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="2016.html">
            
                <a href="2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.10" data-path="2017.html">
            
                <a href="2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="2018.html">
            
                <a href="2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="2019.html">
            
                <a href="2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="2020.html">
            
                <a href="2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="2021.html">
            
                <a href="2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../16-题2-论软件设计模式及其应用.html">
            
                <a href="../16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2017</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2017-&#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;">2017 &#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;</h1>
<h2 id="&#x8BBA;&#x6587;1-&#x8BBA;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x53CA;&#x5176;&#x5E94;&#x7528;">&#x8BBA;&#x6587;1. &#x8BBA;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#xFF08;So &#x4F01; ware System Modeling&#xFF09;&#x662F;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x7684;&#x91CD;&#x8981;&#x73AF;&#x8282;&#xFF0C;&#x901A;&#x8FC7;&#x6784;&#x5EFA;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7406;&#x89E3;&#x7CFB;&#x7EDF;&#x3001;&#x62BD;&#x53D6;&#x4E1A;&#x52A1;&#x8FC7;&#x7A0B;&#x548C;&#x7BA1;&#x7406;&#x7CFB;&#x7EDF;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5404;&#x7C7B;&#x4EBA;&#x5458;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x6D41;&#x3002;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x662F;&#x5728;&#x7CFB;&#x7EDF;&#x9700;&#x6C42;&#x5206;&#x6790;&#x548C;&#x7CFB;&#x7EDF;&#x5B9E;&#x73B0;&#x4E4B;&#x95F4;&#x67B6;&#x8D77;&#x7684;&#x4E00;&#x5EA7;&#x6865;&#x6881;&#xFF0C;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6309;&#x7167;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x6A21;&#x578B;&#x5F00;&#x53D1;&#x51FA;&#x7B26;&#x5408;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x57FA;&#x4E8E;&#x8BE5;&#x6A21;&#x578B;&#x8FDB;&#x884C;&#x8F6F;&#x4EF6;&#x7684;&#x7EF4;&#x62A4;&#x548C;&#x6539;&#x8FDB;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&quot;&#x8BBA;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x53CA;&#x5176;&#x5E94;&#x7528;&quot;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BF4;&#x660E;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#x6709;&#x54EA;&#x51E0;&#x7C7B;&#xFF1F;&#x9610;&#x8FF0;&#x6BCF;&#x79CD;&#x65B9;&#x6CD5;&#x7684;&#x7279;&#x70B9;&#x53CA;&#x5176;&#x9002;&#x7528;&#x8303;&#x56F4;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x91C7;&#x7528;&#x4E86;&#x54EA;&#x4E9B;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5EFA;&#x6A21;&#x65B9;&#x6CD5;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;</li>
</ol>
<h2 id="2-&#x8BBA;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x98CE;&#x683C;">2. &#x8BBA;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x98CE;&#x683C;</h2>
<p>&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x98CE;&#x683C;&#x662F;&#x63CF;&#x8FF0;&#x67D0;&#x4E00;&#x7279;&#x5B9A;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x4E2D;&#x7CFB;&#x7EDF;&#x7EC4;&#x7EC7;&#x65B9;&#x5F0F;&#x7684;&#x60EF;&#x7528;&#x6A21;&#x5F0F;&#x3002;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x98CE;&#x683C;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x5BB6;&#x65CF;&#xFF0C;&#x5373;&#x4E00;&#x4E2A;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x5B9A;&#x4E49;&#x4E00;&#x4E2A;&#x8BCD;&#x6C47;&#x8868;&#x548C;&#x4E00;&#x7EBD;&#x7EA6;&#x675F;&#x3002;&#x8BCD;&#x6C47;&#x8868;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x4E9B;&#x6784;&#x4EF6;&#x548C;&#x8FDE;&#x63A5;&#x4EF6;&#x7C7B;&#x578B;&#xFF0C;&#x800C;&#x8FD9;&#x7EC4;&#x7EA6;&#x675F;&#x6307;&#x51FA;&#x7CFB;&#x7EDF;&#x662F;&#x5982;&#x4F55;&#x5C06;&#x8FD9;&#x4E9B;&#x6784;&#x4EF6;&#x548C;&#x8FDE;&#x63A5;&#x4EF6;&#x7EC4;&#x5408;&#x8D77;&#x6765;&#x7684;&#x3002;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x98CE;&#x683C;&#x53CD;&#x5E94;&#x4E86;&#x9886;&#x57DF;&#x4E2D;&#x4F17;&#x591A;&#x7CFB;&#x7EDF;&#x6240;&#x5171;&#x6709;&#x7684;&#x7ED3;&#x6784;&#x548C;&#x8BED;&#x4E49;&#x7279;&#x6027;&#xFF0C;&#x5E76;&#x6307;&#x5BFC;&#x5982;&#x4F55;&#x5C06;&#x5404;&#x4E2A;&#x6A21;&#x5757;&#x548C;&#x5B50;&#x7CFB;&#x7EDF;&#x6709;&#x6548;&#x5730;&#x7EC4;&#x7EC7;&#x6210;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7CFB;&#x7EDF;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&quot;&#x8BBA;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x98CE;&#x683C;&apos;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x8BBE;&#x8BA1;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x4E2D;&#x5E38;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x6BCF;&#x79CD;&#x98CE;&#x683C;&#x7684;&#x5177;&#x4F53;&#x542B;&#x4E49;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x8BBE;&#x8BA1;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x662F;&#x91C7;&#x7528;&#x4EC0;&#x4E48;&#x8F6F;&#x4EF6;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x7684;&#xFF0C;&#x5E76;&#x5206;&#x6790;&#x91C7;&#x7528;&#x8BE5;&#x67B6;&#x6784;&#x98CE;&#x683C;&#x8BBE;&#x8BA1;&#x7684;&#x539F;&#x56E0;&#x3002;</li>
</ol>
<h2 id="3-&#x8BBA;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;">3. &#x8BBA;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x8FD1;&#x5E74;&#x6765;&#xFF0C;&#x968F;&#x7740;&#x4FE1;&#x606F;&#x6280;&#x672F;&#x7684;&#x8FC5;&#x731B;&#x53D1;&#x5C55;&#x548C;&#x5E94;&#x7528;&#x9700;&#x6C42;&#x7684;&#x5FEB;&#x901F;&#x66F4;&#x8FED;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x591A;&#x5C42;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x9762;&#x4E34;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x5DF2;&#x7ECF;&#x96BE;&#x4EE5;&#x9002;&#x5E94;&#x8FD9;&#x79CD;&#x53D8;&#x5316;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x80CC;&#x666F;&#x4E0B;&#xFF0C;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF08;Servl iess Architecture&#xFF09; &#x9010;&#x6E10;&#x6D41;&#x884C;&#xFF0C;&#x5B83;&#x5F3A;&#x8C03;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x7531;&#x4E8B;&#x4EF6;&#x89E6;&#x53D1;&#xFF0C;&#x5177;&#x6709;&#x77ED;&#x6682;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#xFF0C;&#x8FD0;&#x884C;&#x4E8E;&#x65E0;&#x72B6;&#x6001;&#x7684;&#x8F7B;&#x91CF;&#x7EA7;&#x5BB9;&#x5668;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x7531;&#x7B2C;&#x4E09;&#x65B9;&#x4EE3;&#x4E3A;&#x7BA1;&#x7406;&#x3002;&#x91C7;&#x7528;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#xFF0C;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#x4EE5;&#x529F;&#x80FD;&#x5373;&#x670D;&#x52A1;CPunction As a Service. PAAS&#xFF09; &#x7684;&#x65B9;&#x5F0F;&#x5F62;&#x6210;&#x591A;&#x4E2A;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;&#x529F;&#x80FD;&#x7EC4;&#x4EF6;&#xFF0C;&#x4EE5;&#x6807;&#x51C6;&#x63A5;&#x53E3;&#x7684;&#x5F62;&#x5F0F;&#x5411;&#x5916;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF1A;&#x540C;&#x65F6;&#xFF0C;&#x4E0D;&#x540C;&#x529F;&#x80FD;&#x7EC4;&#x4EF6;&#x95F4;&#x7684;&#x903B;&#x8F91;&#x7EC4;&#x7EC7;&#x4EE3;&#x7801;&#x5C06;&#x5B58;&#x50A8;&#x5728;&#x901A;&#x7528;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7BA1;&#x7406;&#x5E73;&#x53F0;&#x4E2D;&#xFF0C;&#x4E1A;&#x52A1;&#x4EE3;&#x7801;&#x4EC5;&#x5728;&#x8C03;&#x7528;&#x65F6;&#x624D;&#x6FC0;&#x6D3B;&#x8FD0;&#x884C;&#xFF0C;&#x5F53;&#x54CD;&#x5E94;&#x7ED3;&#x675F;&#x540E;&#x5360;&#x7528;&#x7684;&#x8D44;&#x6E90;&#x4FBF;&#x4F1A;&#x91CA;&#x653E;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&quot;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;&apos;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x8BBE;&#x8BA1;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;2. &#x4E0E;&#x4F20;&#x7EDF;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x76F8;&#x6BD4;&#x8F83;&#xFF0C;&#x57FA;&#x4E8E;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#x7684;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x5177;&#x6709;&#x54EA;&#x4E9B;&#x7279;&#x70B9;&#xFF0C;&#x8BF7;&#x4F8B;&#x4E3E;&#x81F3;&#x5C11; 3 &#x4E2A;&#x7279;&#x70B9;&#xFF0C;&#x5E76;&#x8FDB;&#x884C;&#x89E3;&#x91CA;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x4F60;&#x5177;&#x4F53;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x8BBE;&#x8BA1;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#xFF0C;&#x63CF;&#x8FF0;&#x8BE5;&#x8F6F;&#x4EF6;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x8BF4;&#x660E;&#x8BE5;&#x67B6;&#x6784;&#x662F;&#x5982;&#x4F55;&#x662F;&#x5982;&#x4F55;&#x91C7;&#x7528;&#x65E0;&#x670D;&#x52A1;&#x5668;&#x67B6;&#x6784;&#x6A21;&#x5F0F;&#x7684;&#x3002;&#xFF0C;&#x5E76;&#x8BF4;&#x660E;&#x5728;&#x91C7;&#x7528;&#x65E0;&#x670D;&#x52A1;&#x56A3;&#x67B6;&#x6784;&#x540E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x7684;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</li>
</ol>
<h2 id="4-&#x8BBA;&#x8F6F;&#x4EF6;&#x8D28;&#x91CF;&#x4FDD;&#x8BC1;&#x53CA;&#x5176;&#x5E94;&#x7528;">4. &#x8BBA;&#x8F6F;&#x4EF6;&#x8D28;&#x91CF;&#x4FDD;&#x8BC1;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x8F6F;&#x4EF6;&#x8D28;&#x91CF;&#x4FDD;&#x8BC1; &#xFF08;Software Quality Assurance. SQA&#xFF09; &#x662F;&#x6307;&#x4E3A;&#x4FDD;&#x8BC1;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x6216;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x5145;&#x5206;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x8981;&#x6C42;&#x7684;&#x8D28;&#x91CF;&#x800C;&#x8FDB;&#x884C;&#x7684;&#x6709;&#x8BA1;&#x5212;&#x3001;&#x6709;&#x7EC4;&#x7EC7;&#x7684;&#x6D3B;&#x52A8;&#xFF0C;&#x8FD9;&#x4E9B;&#x6D3B;&#x52A8;&#x8D2F;&#x7A7F;&#x4E8E;&#x8F6F;&#x4EF6;&#x751F;&#x4EA7;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;&#x8D28;&#x91CF;&#x4FDD;&#x8BC1;&#x4EBA;&#x5458;&#x8D1F;&#x8D23;&#x8D28;&#x91CF;&#x4FDD;&#x8BC1;&#x7684;&#x8BA1;&#x5212;&#x3001;&#x76D1;&#x7763;&#x3001;&#x8BB0;&#x5F55;&#x3001;&#x5206;&#x6790;&#x53CA;&#x62A5;&#x544A;&#x5DE5;&#x4F5C;&#xFF0C;&#x8F85;&#x52A9;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5F97;&#x5230;&#x9AD8;&#x8D28;&#x91CF;&#x7684;&#x6700;&#x7EC8;&#x4EA7;&#x54C1;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&quot;&#x8F6F;&#x4EF6;&#x8D28;&#x91CF;&#x4FDD;&#x8BC1;&#x53CA;&#x5176;&#x5E94;&#x7528;&quot;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BBA;&#x8FF0;&#x8F6F;&#x4EF6;&#x8D28;&#x91CF;&#x4FDD;&#x8BC1;&#x4E2D;&#x5E38;&#x89C1;&#x7684;&#x6D3B;&#x52A8;&#x6709;&#x54EA;&#x4E9B;&#xFF1F;&#x9610;&#x8FF0;&#x6BCF;&#x4E2A;&#x6D3B;&#x52A8;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x4F60;&#x5177;&#x4F53;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#xFF0C;&#x8BF4;&#x660E;&#x662F;&#x5982;&#x4F55;&#x5B9E;&#x65BD;&#x8F6F;&#x4EF6;&#x8D28;&#x91CF;&#x4FDD;&#x8BC1;&#x7684;&#x5404;&#x9879;&#x6D3B;&#x52A8;&#xFF0C;&#x8BF4;&#x660E;&#x5176;&#x5B9E;&#x65BD;&#x8FC7;&#x7A0B;&#x53CA;&#x5E94;&#x7528;&#x6548;&#x679C;&#x3002; </li>
</ol>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Lacuz 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2022-10-24
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2016.html" class="navigation navigation-prev " aria-label="Previous page: 2016">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2018.html" class="navigation navigation-next " aria-label="Next page: 2018">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2017","level":"1.3.1.10","depth":3,"next":{"title":"2018","level":"1.3.1.11","depth":3,"path":"4论文范文/历年真题/2018.md","ref":"4论文范文/历年真题/2018.md","articles":[]},"previous":{"title":"2016","level":"1.3.1.9","depth":3,"path":"4论文范文/历年真题/2016.md","ref":"4论文范文/历年真题/2016.md","articles":[]},"dir":"ltr"},"config":{"plugins":["splitter","code","hide-element","pageview-count","popup","tbfed-pagefooter","-sharing","sharing-plus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Lacuz 2020","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"pageview-count":{},"sharing":{"qq":true,"qzone":true,"weibo":true,"all":["weibo","qq","qzone"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Lacuz","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"系统架构设计师","language":"zh-hans","gitbook":"*","description":"系统架构设计师考试"},"file":{"path":"4论文范文/历年真题/2017.md","mtime":"2022-10-24T04:44:08.682Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-24T04:45:14.725Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

