
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2018 · 系统架构设计师</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="Lacuz">
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-splitter/splitter.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-code/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-pageview-count/plugin.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-tbfed-pagefooter/footer.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="2019.html" />
    
    
    <link rel="prev" href="2017.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../readme.html">
            
                <a href="../../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="2009.html">
            
                <a href="2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="2010.html">
            
                <a href="2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="2011.html">
            
                <a href="2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="2012.html">
            
                <a href="2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="2013.html">
            
                <a href="2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="2014.html">
            
                <a href="2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="2015.html">
            
                <a href="2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="2016.html">
            
                <a href="2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="2017.html">
            
                <a href="2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.11" data-path="2018.html">
            
                <a href="2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="2019.html">
            
                <a href="2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="2020.html">
            
                <a href="2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.14" data-path="2021.html">
            
                <a href="2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../论软件三层架构设计.html">
            
                <a href="../论软件三层架构设计.html">
            
                    
                    论软件三层架构设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.4" data-path="../16-题2-论软件设计模式及其应用.html">
            
                <a href="../16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2018</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2018-&#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;">2018 &#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;</h1>
<h2 id="&#x8BBA;&#x6587;1-&#x8BBA;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;-rup-&#x53CA;&#x5176;&#x5E94;&#x7528;">&#x8BBA;&#x6587;1. &#x8BBA;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B; RUP &#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>RUP (Rational Unified Process)&#x662F; IBM &#x516C;&#x53F8;&#x4E00;&#x6B3E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4EA7;&#x54C1;&#xFF0C;&#x5B83;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x6574;&#x5957;&#x4EE5;UML &#x4E3A;&#x57FA;&#x7840;&#x7684;&#x5F00;&#x53D1;&#x51C6;&#x5219;&#xFF0C;&#x7528;&#x4EE5;&#x6307;&#x5BFC;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4EE5; UML &#x4E3A;&#x57FA;&#x7840;&#x8FDB;&#x884C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x3002;RUP &#x6C72;&#x53D6;&#x4E86;&#x5404;&#x79CD;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5206;&#x6790;&#x4E0E;&#x8BBE;&#x8BA1;&#x65B9;&#x6CD5;&#x7684;&#x7CBE;&#x534E;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x666E;&#x904D;&#x7684;&#x8F6F;&#x4EF6;&#x8FC7;&#x7A0B;&#x6846;&#x67B6;&#xFF0C;&#x53EF;&#x4EE5;&#x9002;&#x5E94;&#x4E0D;&#x540C;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x3001;&#x5E94;&#x7528;&#x9886;&#x57DF;&#x3001;&#x7EC4;&#x7EC7;&#x7C7B;&#x578B;&#x548C;&#x9879;&#x76EE;&#x89C4;&#x6A21;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8BBA;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B; RUP &#x53CA;&#x5176;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BBA;&#x8FF0;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4EA7;&#x54C1; RUP &#x6240;&#x5305;&#x542B;&#x7684; 4 &#x4E2A;&#x9636;&#x6BB5;&#x4EE5;&#x53CA; RUP &#x7684;&#x57FA;&#x672C;&#x7279;&#x5F81;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#xFF0C;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0; RUP &#x5728;&#x8BE5;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x5185;&#x5BB9;&#xFF0C;&#x5305;&#x62EC;&#x6838;&#x5FC3;&#x5DE5;&#x4F5C;&#x6D41;&#x7684;&#x9009;&#x62E9;&#x3001;&#x5236;&#x54C1;&#x7684;&#x786E;&#x5B9A;&#x3001;&#x5404;&#x4E2A;&#x9636;&#x6BB5;&#x4E4B;&#x95F4;&#x7684;&#x6F14;&#x8FDB;&#x53CA;&#x8FED;&#x4EE3;&#x8BA1;&#x5212;&#x4EE5;&#x53CA;&#x5DE5;&#x4F5C;&#x6D41;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x7684;&#x89C4;&#x5212;&#x7B49;&#x3002;<h3 id="&#x3010;&#x89E3;&#x6790;&#x3011;">&#x3010;&#x89E3;&#x6790;&#x3011;</h3>
&#x4E00;&#x3001;&#x5E94;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x53C2;&#x4E0E;&#x7684;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x9879;&#x76EE;&#xFF0C;&#x8BF4;&#x660E;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</li>
</ol>
<p>&#x4E8C;&#x3001;&#x672C;&#x6587;&#x5185;&#x5BB9;&#x7684;&#x7EC4;&#x7EC7;&#x53EF;&#x4EE5;&#x5C06;&#x95EE;&#x9898; 2 &#x4E0E;&#x95EE;&#x9898; 3 &#x7ED3;&#x5408;&#x8D77;&#x6765;&#x8BBA;&#x8FF0;&#x3002;&#x5148;&#x8BF4;&#x660E; RUP &#x7684;&#x56DB;&#x4E2A;&#x9636;&#x6BB5;&#x53CA;RUP &#x7684;&#x7279;&#x5F81;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8BBA;&#x8FF0;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x4F5C;&#x8005;&#x5F00;&#x5C55;&#x4E86;&#x54EA;&#x4E9B;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>RUP &#x4E2D;&#x7684;&#x8F6F;&#x4EF6;&#x8FC7;&#x7A0B;&#x5728;&#x65F6;&#x95F4;&#x4E0A;&#x88AB;&#x5206;&#x89E3;&#x4E3A;&#x56DB;&#x4E2A;&#x987A;&#x5E8F;&#x7684;&#x9636;&#x6BB5;&#xFF0C;&#x5206;&#x522B;&#x662F;&#x521D;&#x59CB;&#x9636;&#x6BB5;&#x3001;&#x7EC6;&#x5316;&#x9636;&#x6BB5;&#x3001;&#x6784;&#x5EFA;&#x9636;&#x6BB5;&#x548C;&#x4EA4;&#x4ED8;&#x9636;&#x6BB5;&#x3002;&#x6BCF;&#x4E2A;&#x9636;&#x6BB5;&#x7ED3;&#x675F;&#x65F6;&#x90FD;&#x8981;&#x5B89;&#x6392;&#x4E00;&#x6B21;&#x6280;&#x672F;&#x8BC4;&#x5BA1;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x6EE1;&#x8DB3;&#x3002;&#x5982;&#x679C;&#x8BC4;&#x5BA1;&#x7ED3;&#x679C;&#x4EE4;&#x4EBA;&#x6EE1;&#x610F;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x9879;&#x76EE;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x3002;</p>
<p>&#x56DB;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x6838;&#x5FC3;&#x4EFB;&#x52A1;&#x5206;&#x522B;&#x4E3A;&#xFF1A;</p>
<h4 id="&#xFF08;1&#xFF09;&#x521D;&#x59CB;&#x9636;&#x6BB5;">&#xFF08;1&#xFF09;&#x521D;&#x59CB;&#x9636;&#x6BB5;</h4>
<p>&#x660E;&#x786E;&#x5730;&#x8BF4;&#x660E;&#x9879;&#x76EE;&#x89C4;&#x6A21;&#x3002;&#x8FD9;&#x6D89;&#x53CA;&#x4E86;&#x89E3;&#x73AF;&#x5883;&#x53CA;&#x6700;&#x91CD;&#x8981;&#x7684;&#x9700;&#x6C42;&#x548C;&#x7EA6;&#x675F;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x53EF;&#x4EE5;&#x5F97;&#x51FA;&#x6700;&#x7EC8;&#x4EA7;&#x54C1;&#x7684;&#x9A8C;&#x6536;&#x6807;&#x51C6;&#x3002;&#x8BA1;&#x5212;&#x548C;&#x51C6;&#x5907;&#x5546;&#x4E1A;&#x7406;&#x7531;&#x3002;&#x8BC4;&#x4F30;&#x98CE;&#x9669;&#x7BA1;&#x7406;&#x3001;&#x4EBA;&#x5458;&#x914D;&#x5907;&#x3001;&#x9879;&#x76EE;&#x8BA1;&#x5212;&#x548C;&#x6210;&#x672C;/&#x8FDB;&#x5EA6;/&#x6536;&#x76CA;&#x7387;&#x6298;&#x4E2D;&#x7684;&#x5907;&#x9009;&#x65B9;&#x6848;&#x3002;&#x7EFC;&#x5408;&#x8003;&#x8651;&#x5907;&#x9009;&#x6784;&#x67B6;&#xFF0C;&#x8BC4;&#x4F30;&#x8BBE;&#x8BA1;&#x548C;&#x81EA;&#x5236;/&#x5916;&#x8D2D;/&#x590D;&#x7528;&#x65B9;&#x9762;&#x7684;&#x6298;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x4F30;&#x7B97;&#x51FA;&#x6210;&#x672C;&#x3001;&#x8FDB;&#x5EA6;&#x548C;&#x8D44;&#x6E90;&#x3002;&#x6B64;&#x5904;&#x7684;&#x76EE;&#x6807;&#x5728;&#x4E8E;&#x901A;&#x8FC7;&#x5BF9;&#x4E00;&#x4E9B;&#x6982;&#x5FF5;&#x7684;&#x8BC1;&#x5B9E;&#x6765;&#x8BC1;&#x660E;&#x53EF;&#x884C;&#x6027;&#x3002;&#x8BE5;&#x8BC1;&#x660E;&#x53EF;&#x91C7;&#x7528;&#x53EF;&#x6A21;&#x62DF;&#x9700;&#x6C42;&#x7684;&#x6A21;&#x578B;&#x5F62;&#x5F0F;&#x6216;&#x7528;&#x4E8E;&#x63A2;&#x7D22;&#x88AB;&#x8BA4;&#x4E3A;&#x9AD8;&#x98CE;&#x9669;&#x533A;&#x57DF;&#x7684;&#x521D;&#x59CB;&#x539F;&#x578B;&#x3002;&#x521D;&#x59CB;&#x9636;&#x6BB5;&#x7684;&#x539F;&#x578B;&#x8BBE;&#x8BA1;&#x5DE5;&#x4F5C;&#x5E94;&#x8BE5;&#x9650;&#x5236;&#x5728;&#x786E;&#x4FE1;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53EF;&#x884C;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;&#x8BE5;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x5728;&#x7EC6;&#x5316;&#x548C;&#x6784;&#x5EFA;&#x9636;&#x6BB5;&#x5B9E;&#x73B0;&#x3002;
&#x51C6;&#x5907;&#x9879;&#x76EE;&#x7684;&#x73AF;&#x5883;&#xFF0C;&#x8BC4;&#x4F30;&#x9879;&#x76EE;&#x548C;&#x7EC4;&#x7EC7;&#xFF0C;&#x9009;&#x62E9;&#x5DE5;&#x5177;&#xFF0C;&#x51B3;&#x5B9A;&#x6D41;&#x7A0B;&#x4E2D;&#x8981;&#x6539;&#x8FDB;&#x7684;&#x90E8;&#x5206;&#x3002;</p>
<h4 id="&#xFF08;2&#xFF09;&#x7EC6;&#x5316;&#x9636;&#x6BB5;">&#xFF08;2&#xFF09;&#x7EC6;&#x5316;&#x9636;&#x6BB5;</h4>
<p>&#x5FEB;&#x901F;&#x786E;&#x5B9A;&#x6784;&#x67B6;&#xFF0C;&#x786E;&#x8BA4;&#x6784;&#x67B6;&#x5E76;&#x4E3A;&#x6784;&#x67B6;&#x5EFA;&#x7ACB;&#x57FA;&#x7EBF;&#x3002;
&#x6839;&#x636E;&#x6B64;&#x9636;&#x6BB5;&#x83B7;&#x5F97;&#x7684;&#x65B0;&#x4FE1;&#x606F;&#x6539;&#x8FDB;&#x524D;&#x666F;&#xFF0C;&#x5BF9;&#x63A8;&#x52A8;&#x6784;&#x67B6;&#x548C;&#x8BA1;&#x5212;&#x51B3;&#x7B56;&#x7684;&#x6700;&#x5173;&#x952E;&#x7528;&#x4F8B;&#x5EFA;&#x7ACB;&#x53EF;&#x9760;&#x7684;&#x4E86;&#x89E3;&#x3002;&#x4E3A;&#x6784;&#x5EFA;&#x9636;&#x6BB5;&#x521B;&#x5EFA;&#x8BE6;&#x7EC6;&#x7684;&#x8FED;&#x4EE3;&#x8BA1;&#x5212;&#x5E76;&#x4E3A;&#x5176;&#x5EFA;&#x7ACB;&#x57FA;&#x7EBF;&#x3002;
&#x6539;&#x8FDB;&#x5F00;&#x53D1;&#x6848;&#x4F8B;&#xFF0C;&#x5B9A;&#x4F4D;&#x5F00;&#x53D1;&#x73AF;&#x5883;&#xFF0C;&#x5305;&#x62EC;&#x6D41;&#x7A0B;&#x548C;&#x652F;&#x6301;&#x6784;&#x5EFA;&#x56E2;&#x961F;&#x6240;&#x9700;&#x7684;&#x5DE5;&#x5177;&#x548C;&#x81EA;&#x52A8;&#x5316;&#x652F;&#x6301;&#x3002;&#x6539;&#x8FDB;&#x6784;&#x67B6;&#x5E76;&#x9009;&#x62E9;&#x6784;&#x4EF6;&#x3002;&#x8BC4;&#x4F30;&#x6F5C;&#x5728;&#x6784;&#x4EF6;&#xFF0C;&#x5145;&#x5206;&#x4E86;&#x89E3;&#x81EA;&#x5236;/&#x5916;&#x8D2D;/&#x590D;&#x7528;&#x51B3;&#x7B56;&#xFF0C;&#x4EE5;&#x4FBF;&#x6709;&#x628A;&#x63E1;&#x5730;&#x786E;&#x5B9A;&#x6784;&#x5EFA;&#x9636;&#x6BB5;&#x7684;&#x6210;&#x672C;&#x548C;&#x8FDB;&#x5EA6;&#x3002;&#x96C6;&#x6210;&#x4E86;&#x6240;&#x9009;&#x6784;&#x67B6;&#x6784;&#x4EF6;&#xFF0C;&#x5E76;&#x6309;&#x4E3B;&#x8981;&#x573A;&#x666F;&#x8FDB;&#x884C;&#x4E86;&#x8BC4;&#x4F30;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4E9B;&#x6D3B;&#x52A8;&#x5F97;&#x5230;&#x7684;&#x7ECF;&#x9A8C;&#x6709;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x91CD;&#x65B0;&#x8BBE;&#x8BA1;&#x6784;&#x67B6;&#x3001;&#x8003;&#x8651;&#x66FF;&#x4EE3;&#x8BBE;&#x8BA1;&#x6216;&#x91CD;&#x65B0;&#x8003;&#x8651;&#x9700;&#x6C42;&#x3002;</p>
<h4 id="&#xFF08;3&#xFF09;&#x6784;&#x5EFA;&#x9636;&#x6BB5;">&#xFF08;3&#xFF09;&#x6784;&#x5EFA;&#x9636;&#x6BB5;</h4>
<p>&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x3001;&#x63A7;&#x5236;&#x548C;&#x6D41;&#x7A0B;&#x4F18;&#x5316;&#x3002;
&#x5B8C;&#x6210;&#x6784;&#x4EF6;&#x5F00;&#x53D1;&#x5E76;&#x6839;&#x636E;&#x5DF2;&#x5B9A;&#x4E49;&#x7684;&#x8BC4;&#x4F30;&#x6807;&#x51C6;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;
&#x6839;&#x636E;&#x524D;&#x666F;&#x7684;&#x9A8C;&#x6536;&#x6807;&#x51C6;&#x5BF9;&#x4EA7;&#x54C1;&#x53D1;&#x5E03;&#x7248;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#x3002;</p>
<h4 id="&#xFF08;4&#xFF09;&#x4EA7;&#x54C1;&#x5316;&#x9636;&#x6BB5;&#xFF08;&#x63D0;&#x4EA4;&#x9636;&#x6BB5;&#xFF09;">&#xFF08;4&#xFF09;&#x4EA7;&#x54C1;&#x5316;&#x9636;&#x6BB5;&#xFF08;&#x63D0;&#x4EA4;&#x9636;&#x6BB5;&#xFF09;</h4>
<p>&#x6267;&#x884C;&#x90E8;&#x7F72;&#x8BA1;&#x5212;&#x3002;
&#x5BF9;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x652F;&#x6301;&#x6750;&#x6599;&#x5B9A;&#x7A3F;&#x3002;
&#x5728;&#x5F00;&#x53D1;&#x73B0;&#x573A;&#x6D4B;&#x8BD5;&#x53EF;&#x4EA4;&#x4ED8;&#x4EA7;&#x54C1;&#x3002;
&#x5236;&#x4F5C;&#x4EA7;&#x54C1;&#x53D1;&#x5E03;&#x7248;&#x3002;
&#x83B7;&#x5F97;&#x7528;&#x6237;&#x53CD;&#x9988;&#x3002;
&#x57FA;&#x4E8E;&#x53CD;&#x9988;&#x8C03;&#x6574;&#x4EA7;&#x54C1;&#x3002;
&#x4F7F;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4EA7;&#x54C1;&#x3002;
RUP &#x6700;&#x6838;&#x5FC3;&#x7684; 3 &#x4E2A;&#x7279;&#x5F81;&#x662F;&#xFF1A;&#x7528;&#x4F8B;&#x9A71;&#x52A8;&#x3001;&#x4EE5;&#x67B6;&#x6784;&#x4E3A;&#x4E2D;&#x5FC3;&#x7684;&#x3001;&#x8FED;&#x4EE3;&#x548C;&#x589E;&#x91CF;&#x3002;
&#x5236;&#x54C1;&#xFF08;Artifact&#xFF09;&#x2014;&#x2014;what &#x7684;&#x95EE;&#x9898;&#xFF1A;&#x5236;&#x54C1;&#x662F;&#x6D3B;&#x52A8;&#x751F;&#x6210;&#x3001;&#x521B;&#x5EFA;&#x6216;&#x4FEE;&#x6539;&#x7684;&#x4E00;&#x6BB5;&#x4FE1;&#x606F;&#x3002;&#x4E5F;&#x53EF;&#x8BD1;&#x4E3A;&#x4EA7;&#x54C1;&#x3001;&#x5DE5;&#x4EF6;&#x7B49;&#xFF0C;&#x548C;&#x5236;&#x54C1;&#x7684;&#x610F;&#x601D;&#x5DEE;&#x4E0D;&#x591A;&#x3002;
&#x5DE5;&#x4F5C;&#x6D41;&#xFF08;Workflow&#xFF09;&#x2014;&#x2014;when &#x7684;&#x95EE;&#x9898;&#xFF1A;&#x5DE5;&#x4F5C;&#x6D41;&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x6709;&#x610F;&#x4E49;&#x7684;&#x8FDE;&#x7EED;&#x7684;&#x6D3B;&#x52A8;&#x5E8F;&#x5217;&#xFF0C;&#x6BCF;&#x4E2A;&#x5DE5;&#x4F5C;&#x6D41;&#x4EA7;&#x751F;&#x4E00;&#x4E9B;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x5E76;&#x663E;&#x793A;&#x4E86;&#x89D2;&#x8272;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<h2 id="2-&#x8BBA;&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x6F14;&#x5316;">2. &#x8BBA;&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x6F14;&#x5316;</h2>
<p>&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x6F14;&#x5316;&#x662F;&#x5728;&#x6784;&#x4EF6;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x6216;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x5B8C;&#x6BD5;&#x6295;&#x5165;&#x8FD0;&#x884C;&#x540E;&#xFF0C;&#x7531;&#x4E8E;&#x7528;&#x6237;&#x9700;&#x6C42;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x76F8;&#x5E94;&#x5730;&#x4FEE;&#x6539;&#x539F;&#x6709;&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x65B0;&#x7684;&#x53D8;&#x5316;&#x4E86;&#x7684;&#x8F6F;&#x4EF6;&#x9700;&#x6C42;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x6F14;&#x5316;&#x662F;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x3001;&#x96BE;&#x4EE5;&#x7BA1;&#x7406;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8BBA;&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x6F14;&#x5316;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x7684;&#x6F14;&#x5316;&#x662F;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x6F14;&#x5316;&#x6B65;&#x9AA4;&#x53BB;&#x4FEE;&#x6539;&#x7CFB;&#x7EDF;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x65B0;&#x7684;&#x9700;&#x6C42;&#x3002;&#x7B80;&#x8981;&#x8BBA;&#x8FF0;&#x7CFB;&#x7EDF;&#x6F14;&#x5316;&#x7684; 6 &#x4E2A;&#x6B65;&#x9AA4;&#x3002;</li>
<li>&#x5177;&#x4F53;&#x9610;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x9879;&#x76EE;&#x662F;&#x5982;&#x4F55;&#x57FA;&#x4E8E;&#x7CFB;&#x7EDF;&#x6F14;&#x5316;&#x7684; 6 &#x4E2A;&#x6B65;&#x9AA4;&#x5B8C;&#x6210;&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6F14;&#x5316;&#x7684;&#x3002;</li>
</ol>
<h3 id="&#x3010;&#x89E3;&#x6790;&#x3011;">&#x3010;&#x89E3;&#x6790;&#x3011;</h3>
<p>&#x4E00;&#x3001;&#x5E94;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x53C2;&#x4E0E;&#x7684;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x9879;&#x76EE;&#xFF0C;&#x8BF4;&#x660E;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x9996;&#x5148;&#x9700;&#x8981;&#x5F04;&#x6E05;&#x695A;&#x7684;&#x662F;&#x6B64;&#x5904;&#x7684;&#x201C;&#x8F6F;&#x4EF6;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6F14;&#x5316;&#x201D;&#x5B9E;&#x9645;&#x4E0A;&#x6307;&#x7684;&#x662F; ABSD &#x65B9;&#x6CD5;&#x4E2D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x3002;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6F14;&#x5316;&#x662F;&#x4F7F;&#x7528;&#x7CFB;&#x7EDF;&#x6F14;&#x5316;&#x6B65;&#x9AA4;&#x53BB;&#x4FEE;&#x6539;&#x5E94;&#x7528;&#xFF0C;&#x4EE5;&#x6EE1;&#x8DB3;&#x65B0;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<p>&#x4E3B;&#x8981;&#x5305;&#x62EC;&#x4EE5;&#x4E0B;&#x516D;&#x4E2A;&#x6B65;&#x9AA4;&#x3002;</p>
<h4 id="1&#x3001;&#x9700;&#x6C42;&#x53D8;&#x52A8;&#x5F52;&#x7C7B;">1&#x3001;&#x9700;&#x6C42;&#x53D8;&#x52A8;&#x5F52;&#x7C7B;</h4>
<p>&#x9996;&#x5148;&#x5FC5;&#x987B;&#x5BF9;&#x7528;&#x6237;&#x9700;&#x6C42;&#x7684;&#x53D8;&#x5316;&#x8FDB;&#x884C;&#x5F52;&#x7C7B;&#xFF0C;&#x4F7F;&#x53D8;&#x5316;&#x7684;&#x9700;&#x6C42;&#x4E0E;&#x5DF2;&#x6709;&#x6784;&#x4EF6;&#x5BF9;&#x5E94;&#x3002;&#x5BF9;&#x627E;&#x4E0D;&#x5230;&#x5BF9;&#x5E94;&#x6784;&#x4EF6;&#x7684;&#x53D8;&#x52A8;&#xFF0C;&#x4E5F;&#x8981;&#x505A;&#x597D;&#x6807;&#x8BB0;&#xFF0C;&#x5728;&#x540E;&#x7EED;&#x5DE5;&#x4F5C;&#x4E2D;&#xFF0C;&#x5C06;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x6784;&#x4EF6;&#xFF0C;&#x4EE5;&#x5BF9;&#x5E94;&#x8FD9;&#x90E8;&#x5206;&#x53D8;&#x5316;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<h4 id="2&#x3001;&#x5236;&#x8BA2;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6F14;&#x5316;&#x8BA1;&#x5212;">2&#x3001;&#x5236;&#x8BA2;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6F14;&#x5316;&#x8BA1;&#x5212;</h4>
<p>&#x5728;&#x6539;&#x53D8;&#x539F;&#x6709;&#x7ED3;&#x6784;&#x4E4B;&#x524D;&#xFF0C;&#x5F00;&#x53D1;&#x7EC4;&#x7EC7;&#x5FC5;&#x987B;&#x5236;&#x8BA2;&#x4E00;&#x4E2A;&#x5468;&#x5BC6;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x6F14;&#x5316;&#x8BA1;&#x5212;&#xFF0C;&#x4F5C;&#x4E3A;&#x540E;&#x7EED;&#x6F14;&#x5316;&#x5F00;&#x53D1;&#x5DE5;&#x4F5C;&#x7684;&#x6307;&#x5357;&#x3002;</p>
<h4 id="3&#x3001;&#x4FEE;&#x6539;&#x3001;&#x589E;&#x52A0;&#x6216;&#x5220;&#x9664;&#x6784;&#x4EF6;">3&#x3001;&#x4FEE;&#x6539;&#x3001;&#x589E;&#x52A0;&#x6216;&#x5220;&#x9664;&#x6784;&#x4EF6;</h4>
<p>&#x5728;&#x6F14;&#x5316;&#x8BA1;&#x5212;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x53EF;&#x6839;&#x636E;&#x5728;&#x7B2C; 1 &#x6B65;&#x5F97;&#x5230;&#x7684;&#x9700;&#x6C42;&#x53D8;&#x52A8;&#x7684;&#x5F52;&#x7C7B;&#x60C5;&#x51B5;&#xFF0C;&#x51B3;&#x5B9A;&#x662F;&#x5426;&#x4FEE;&#x6539;&#x6216;&#x5220;&#x9664;&#x5B58;&#x5728;&#x7684;&#x6784;&#x4EF6;&#x3001;&#x589E;&#x52A0;&#x65B0;&#x6784;&#x4EF6;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5BF9;&#x4FEE;&#x6539;&#x548C;&#x589E;&#x52A0;&#x7684;&#x6784;&#x4EF6;&#x8FDB;&#x884C;&#x529F;&#x80FD;&#x6027;&#x6D4B;&#x8BD5;&#x3002;</p>
<h4 id="4&#x3001;&#x66F4;&#x65B0;&#x6784;&#x4EF6;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;">4&#x3001;&#x66F4;&#x65B0;&#x6784;&#x4EF6;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;</h4>
<p>&#x968F;&#x7740;&#x6784;&#x4EF6;&#x7684;&#x589E;&#x52A0;&#x3001;&#x5220;&#x9664;&#x548C;&#x4FEE;&#x6539;&#xFF0C;&#x6784;&#x4EF6;&#x4E4B;&#x95F4;&#x7684;&#x63A7;&#x5236;&#x6D41;&#x5FC5;&#x987B;&#x5F97;&#x5230;&#x66F4;&#x65B0;&#x3002;</p>
<h4 id="5&#x3001;&#x6784;&#x4EF6;&#x7EC4;&#x88C5;&#x4E0E;&#x6D4B;&#x8BD5;">5&#x3001;&#x6784;&#x4EF6;&#x7EC4;&#x88C5;&#x4E0E;&#x6D4B;&#x8BD5;</h4>
<p>&#x901A;&#x8FC7;&#x7EC4;&#x88C5;&#x652F;&#x6301;&#x5DE5;&#x5177;&#x628A;&#x8FD9;&#x4E9B;&#x6784;&#x4EF6;&#x7684;&#x5B9E;&#x73B0;&#x4F53;&#x7EC4;&#x88C5;&#x8D77;&#x6765;&#xFF0C;&#x5B8C;&#x6210;&#x6574;&#x4E2A;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x8FDE;&#x63A5;&#x4E0E;&#x5408;&#x6210;&#xFF0C;&#x5F62;&#x6210;&#x65B0;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x3002;&#x7136;&#x540E;&#x5BF9;&#x7EC4;&#x88C5;&#x540E;&#x7684;&#x7CFB;&#x7EDF;&#x6574;&#x4F53;&#x529F;&#x80FD;&#x548C;&#x6027;&#x80FD;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;</p>
<h4 id="6&#x3001;&#x6280;&#x672F;&#x8BC4;&#x5BA1;">6&#x3001;&#x6280;&#x672F;&#x8BC4;&#x5BA1;</h4>
<p>&#x5BF9;&#x4EE5;&#x4E0A;&#x6B65;&#x9AA4;&#x8FDB;&#x884C;&#x786E;&#x8BA4;&#xFF0C;&#x8FDB;&#x884C;&#x6280;&#x672F;&#x8BC4;&#x5BA1;&#x3002;&#x8BC4;&#x5BA1;&#x7EC4;&#x88C5;&#x540E;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x662F;&#x5426;&#x53CD;&#x6620;&#x9700;&#x6C42;&#x53D8;&#x52A8;&#xFF0C;&#x7B26;&#x5408;&#x7528;&#x6237;&#x9700;&#x6C42;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x7B26;&#x5408;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x5728;&#x7B2C; 2 &#x5230;&#x7B2C; 6 &#x6B65;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x8FED;&#x4EE3;&#x3002;</p>
<p>&#x4E09;&#x3001;&#x8BBA;&#x6587;&#x4E2D;&#x9700;&#x8981;&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#xFF0C;&#x9610;&#x8FF0; 6 &#x4E2A;&#x6B65;&#x9AA4;&#x7684;&#x5177;&#x4F53;&#x5E94;&#x7528;&#xFF0C;&#x6B64;&#x65F6;&#x53EF;&#x4EE5;&#x91CD;&#x70B9;&#x8BB2;&#x8FF0;&#x5176;&#x4E2D;&#x7684;2-3 &#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x4E0D;&#x5FC5;&#x9762;&#x9762;&#x4FF1;&#x5230;&#x7684;&#x8BBA;&#x8FF0;&#xFF0C;&#x6700;&#x540E;&#x8BF4;&#x660E;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x3002;</p>
<h2 id="3-&#x8BBA;&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x53CA;&#x5176;&#x5E94;&#x7528;">3. &#x8BBA;&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784;&#xFF08;Service-Oriented Architecture, SOA) &#x662F;&#x4E00;&#x79CD;&#x5E94;&#x7528;&#x6846;&#x67B6;&#xFF0C;&#x5C06;&#x65E5;&#x5E38;&#x7684;&#x4E1A;&#x52A1;&#x5E94;&#x7528;&#x5212;&#x5206;&#x4E3A;&#x5355;&#x72EC;&#x7684;&#x4E1A;&#x52A1;&#x529F;&#x80FD;&#x670D;&#x52A1;&#x548C;&#x6D41;&#x7A0B;&#xFF0C;&#x901A;&#x8FC7;&#x91C7;&#x7528;&#x826F;&#x597D;&#x5B9A;&#x4E49;&#x7684;&#x63A5;&#x53E3;&#x548C;&#x6807;&#x51C6;&#x534F;&#x8BAE;&#x5C06;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x5173;&#x8054;&#x8D77;&#x6765;&#x3002;&#x901A;&#x8FC7;&#x5B9E;&#x65BD;&#x751A;&#x4E8E; SOA &#x7684;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x3001;&#x90E8;&#x7F72;&#x548C;&#x6574;&#x5408;&#x670D;&#x52A1;&#xFF0C;&#x65E0;&#x9700;&#x4F9D;&#x8D56;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53CA;&#x5176;&#x8FD0;&#x884C;&#x5E73;&#x53F0;&#xFF0C;&#x4ECE;&#x800C;&#x63D0;&#x9AD8;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x7684;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x5E2E;&#x52A9;&#x4F01;&#x4E1A;&#x52A0;&#x5FEB;&#x53D1;&#x5C55;&#x901F;&#x5EA6;&#xFF0C;&#x964D;&#x4F4E;&#x4F01;&#x4E1A;&#x5F00;&#x53D1;&#x6210;&#x672C;&#xFF0C;&#x6539;&#x5584;&#x4F01;&#x4E1A;&#x4E1A;&#x52A1;&#x6D41;&#x7A0B;&#x7684;&#x7EC4;&#x7EC7;&#x548C;&#x8D44;&#x4EA7;&#x91CD;&#x7528;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x8BBA;&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5206;&#x6790;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BF4;&#x660E;&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x4E3B;&#x8981;&#x6280;&#x672F;&#x548C;&#x6807;&#x51C6;&#xFF0C;&#x8BE6;&#x7EC6;&#x9610;&#x8FF0;&#x6BCF;&#x79CD;&#x6280;&#x672F;&#x548C;&#x6807;&#x51C6;&#x7684;&#x5177;&#x4F53;&#x5185;&#x5BB9;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x7684;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x6784;&#x5EFA; SOA &#x67B6;&#x6784;&#x65F6;&#x9047;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x5177;&#x4F53;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;</li>
</ol>
<h3 id="&#x3010;&#x89E3;&#x6790;&#x3011;">&#x3010;&#x89E3;&#x6790;&#x3011;</h3>
<p>&#x4E00;&#x3001;&#x5E94;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x53C2;&#x4E0E;&#x7684;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x9879;&#x76EE;&#xFF0C;&#x8BF4;&#x660E;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x9762;&#x5411;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x4E3B;&#x8981;&#x6280;&#x672F;&#x6709; Web &#x670D;&#x52A1;&#x3001;ESB&#x3002;&#x6D89;&#x53CA;&#x5230;&#x7684;&#x6807;&#x51C6;&#x6709;&#xFF1A;</p>
<h4 id="1&#x3001;uddi-&#x534F;&#x8BAE;">1&#x3001;UDDI &#x534F;&#x8BAE;</h4>
<p>UDDI&#xFF08;&#x7EDF;&#x4E00;&#x63CF;&#x8FF0;&#x3001;&#x53D1;&#x73B0;&#x548C;&#x96C6;&#x6210;&#x534F;&#x8BAE;&#xFF09;&#x8BA1;&#x5212;&#x662F;&#x4E00;&#x4E2A;&#x5E7F;&#x6CDB;&#x7684;&#x3001;&#x5F00;&#x653E;&#x7684;&#x884C;&#x4E1A;&#x8BA1;&#x5212;&#xFF0C;&#x5B83;&#x4F7F;&#x5F97;&#x5546;&#x4E1A;&#x5B9E;&#x4F53;&#x80FD;&#x591F;&#xFF08;1&#xFF09;&#x5F7C;&#x6B64;&#x53D1;&#x73B0;&#xFF0C;&#xFF08;2&#xFF09;&#x5B9A;&#x4E49;&#x4ED6;&#x4EEC;&#x600E;&#x6837;&#x5728; Internet &#x4E0A;&#x4E92;&#x76F8;&#x4F5C;&#x7528;&#xFF0C;&#x5E76;&#x5728;&#x4E00;&#x4E2A;&#x5168;&#x7403;&#x7684;&#x6CE8;&#x518C;&#x4F53;&#x7CFB;&#x67B6;&#x6784;&#x4E2D;&#x5171;&#x4EAB;&#x4FE1;&#x606F;&#x3002;UDDI
&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x57FA;&#x7840;&#x7684;&#x7CFB;&#x7EDF;&#x6784;&#x7B51;&#x6A21;&#x5757;&#xFF0C;&#x4ED6;&#x4F7F;&#x5546;&#x4E1A;&#x5B9E;&#x4F53;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x3001;&#x65B9;&#x4FBF;&#x5730;&#x4F7F;&#x7528;&#x4ED6;&#x4EEC;&#x81EA;&#x8EAB;&#x7684;&#x4F01;&#x4E1A;&#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#x6765;&#x53D1;&#x73B0;&#x5408;&#x9002;&#x7684;&#x5546;&#x4E1A;&#x5BF9;&#x7B49;&#x5B9E;&#x4F53;&#xFF0C;&#x5E76;&#x4E0E;&#x5176;&#x5B9E;&#x65BD;&#x7535;&#x5B50;&#x5316;&#x7684;&#x5546;&#x4E1A;&#x8D38;&#x6613;&#x3002;
UDDI &#x540C;&#x65F6;&#x4E5F;&#x662F; Web &#x670D;&#x52A1;&#x96C6;&#x6210;&#x7684;&#x4E00;&#x4E2A;&#x4F53;&#x7CFB;&#x6846;&#x67B6;&#x3002;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x670D;&#x52A1;&#x63CF;&#x8FF0;&#x4E0E;&#x53D1;&#x73B0;&#x7684;&#x6807;&#x51C6;&#x89C4;&#x8303;&#x3002;UDDI &#x89C4;&#x8303;&#x5229;&#x7528;&#x4E86; W3C &#x548C; Internet &#x5DE5;&#x7A0B;&#x4EFB;&#x52A1;&#x7EC4;&#x7EC7;&#xFF08;IETF&#xFF09;&#x7684;&#x5F88;&#x591A;&#x6807;&#x51C6;&#x4F5C;&#x4E3A;&#x5176;&#x5B9E;&#x73B0;&#x57FA;&#x7840;&#xFF0C;&#x6BD4;&#x5982;&#x6269;&#x5C55;&#x6807;&#x6CE8;&#x8BED;&#x8A00;&#xFF08;XML&#xFF09;&#x3001;HTTP &#x548C;&#x57DF;&#x540D;&#x670D;&#x52A1;&#xFF08;DNS&#xFF09;&#x7B49;&#x534F;&#x8BAE;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5728;&#x8DE8;&#x5E73;&#x53F0;&#x7684;&#x8BBE;&#x8BA1;&#x7279;&#x6027;&#x4E2D;&#xFF0C;UDDI &#x4E3B;&#x8981;&#x91C7;&#x7528;&#x4E86;&#x5DF2;&#x7ECF;&#x88AB;&#x63D0;&#x8BAE;&#x7ED9;W3C&#x7684; SOAP&#xFF08;Simple Object Access Protocol&#xFF0C;&#x7B80;&#x5355;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x534F;&#x8BAE;&#xFF09;&#x89C4;&#x8303;&#x7684;&#x65E9;&#x671F;&#x7248;&#x672C;&#x3002;</p>
<h4 id="2&#x3001;wsdl-&#x89C4;&#x8303;">2&#x3001;WSDL &#x89C4;&#x8303;</h4>
<p>WSDL &#x662F; Web Services Description Language&#xFF08;Web &#x670D;&#x52A1;&#x63CF;&#x8FF0;&#x8BED;&#x8A00;&#xFF09;&#x7684;&#x7F29;&#x5199;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6765;&#x63CF;&#x8FF0;Web &#x670D;&#x52A1;&#x548C;&#x8BF4;&#x660E;&#x5982;&#x4F55;&#x4E0E; Web &#x670D;&#x52A1;&#x901A;&#x4FE1;&#x7684; XML &#x8BED;&#x8A00;&#x3002;&#x5B83;&#x662F; Web &#x670D;&#x52A1;&#x7684;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#x8BED;&#x8A00;&#xFF0C;&#x7531; Ariba&#x3001;Intel&#x3001;IBM&#x3001;MS &#x7B49;&#x5171;&#x540C;&#x63D0;&#x51FA;&#xFF0C;&#x901A;&#x8FC7; WSDL&#xFF0C;&#x53EF;&#x63CF;&#x8FF0; Web &#x670D;&#x52A1;&#x7684;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x5C5E;&#x6027;&#xFF1A;</p>
<ol>
<li>&#x670D;&#x52A1;&#x505A;&#x4E9B;&#x4EC0;&#x4E48;&#x2014;&#x2014;&#x670D;&#x52A1;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x64CD;&#x4F5C;&#xFF08;&#x65B9;&#x6CD5;&#xFF09;&#xFF1B;</li>
<li>&#x5982;&#x4F55;&#x8BBF;&#x95EE;&#x670D;&#x52A1;&#x2014;&#x2014;&#x548C;&#x670D;&#x52A1;&#x4EA4;&#x4E92;&#x7684;&#x6570;&#x636E;&#x683C;&#x5F0F;&#x4EE5;&#x53CA;&#x5FC5;&#x8981;&#x534F;&#x8BAE;&#xFF1B;</li>
<li>&#x670D;&#x52A1;&#x4F4D;&#x4E8E;&#x4F55;&#x5904;&#x2014;&#x2014;&#x534F;&#x8BAE;&#x76F8;&#x5173;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5982; URL&#x3002;</li>
</ol>
<p>WSDL &#x6587;&#x6863;&#x4EE5;&#x7AEF;&#x53E3;&#x96C6;&#x5408;&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x63CF;&#x8FF0; Web &#x670D;&#x52A1;&#xFF0C;WSDL &#x670D;&#x52A1;&#x63CF;&#x8FF0;&#x5305;&#x542B;&#x5BF9;&#x4E00;&#x7EC4;&#x64CD;&#x4F5C;&#x548C;&#x6D88;&#x606F;&#x7684;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x5B9A;&#x4E49;&#xFF0C;&#x7ED1;&#x5B9A;&#x5230;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x548C;&#x6D88;&#x606F;&#x7684;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x534F;&#x8BAE;&#xFF0C;&#x548C;&#x8FD9;&#x4E2A;&#x7ED1;&#x5B9A;&#x7684;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x7AEF;&#x70B9;&#x89C4;&#x8303;&#x3002;</p>
<h4 id="3&#x3001;soap-&#x534F;&#x8BAE;">3&#x3001;SOAP &#x534F;&#x8BAE;</h4>
<p>SOAP&#xFF08;Simple Object Access Protocol&#xFF09;&#x7B80;&#x5355;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x534F;&#x8BAE;&#x662F;&#x5728;&#x5206;&#x6563;&#x6216;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x7684;&#x7B80;&#x5355;&#x7684;&#x534F;&#x8BAE;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x57FA;&#x4E8E; XML &#x7684;&#x534F;&#x8BAE;&#x3002;&#x5B83;&#x5305;&#x62EC;&#x56DB;&#x4E2A;&#x90E8;&#x5206;&#xFF1A;SOAP &#x5C01;&#x88C5;&#xFF08;Envelop&#xFF09;&#xFF0C;&#x5C01;&#x88C5;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x63CF;&#x8FF0;&#x6D88;&#x606F;&#x4E2D;&#x7684;&#x5185;&#x5BB9;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x662F;&#x8C01;&#x53D1;&#x9001;&#x7684;&#xFF0C;&#x8C01;&#x5E94;&#x5F53;&#x63A5;&#x53D7;&#x5E76;&#x5904;&#x7406;&#x5B83;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5904;&#x7406;&#x5B83;&#x4EEC;&#x7684;&#x6846;&#x67B6;&#xFF1B;SOAP &#x7F16;&#x7801;&#x89C4;&#x5219;&#xFF08;Encoding
Rules&#xFF09;&#xFF0C;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x9700;&#x8981;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x7684;&#x5B9E;&#x4F8B;&#xFF1B;SOAP RPC &#x8868;&#x793A;&#xFF08;RPC Representation&#xFF09;&#xFF0C;&#x8868;&#x793A;&#x8FDC;&#x7A0B;&#x8FC7;&#x7A0B;&#x8C03;&#x7528;&#x548C;&#x5E94;&#x7B54;&#x7684;&#x534F;&#x5B9A;&#xFF1B;SOAP &#x7ED1;&#x5B9A;&#xFF08;Binding&#xFF09;&#xFF0C;&#x4F7F;&#x7528;&#x5E95;&#x5C42;&#x534F;&#x8BAE;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4E09;&#x3001;&#x8BBA;&#x6587;&#x4E2D;&#x9700;&#x8981;&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BBA;&#x8FF0;&#x6784;&#x5EFA; SOA &#x67B6;&#x6784;&#x65F6;&#x9047;&#x5230;&#x7684;&#x95EE;&#x9898;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x7684;&#xFF0C;&#x6548;&#x679C;&#x5982;&#x4F55;&#x3002;&#x6CE8;&#x610F;&#x672C;&#x4E3B;&#x9898;&#x624D;&#x662F;&#x6587;&#x7AE0;&#x7684;&#x91CD;&#x5FC3;&#x6240;&#x5728;&#x3002;</p>
<h2 id="4-&#x8BBA;-nosql-&#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#x53CA;&#x5176;&#x5E94;&#x7528;">4. &#x8BBA; NoSQL &#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x968F;&#x7740;&#x4E92;&#x8054;&#x7F51; web2.0 &#x7F51;&#x7AD9;&#x7684;&#x5174;&#x8D77;&#xFF0C;&#x4F20;&#x7EDF;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#x5728;&#x5E94;&#x5BF9; web2.0 &#x7F51;&#x7AD9;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x8D85;&#x5927;&#x89C4;&#x6A21;&#x548C;&#x9AD8;&#x5E76;&#x53D1;&#x7684; web2.0 &#x7EAF;&#x52A8;&#x6001; SNS &#x7F51;&#x7AD9;&#x4E0A;&#x5DF2;&#x7ECF;&#x663E;&#x5F97;&#x529B;&#x4E0D;&#x4ECE;&#x5FC3;&#xFF0C;&#x66B4;&#x9732;&#x4E86;&#x5F88;&#x591A;&#x96BE;&#x4EE5;&#x514B;&#x670D;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x800C;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x7684;&#x6570;&#x636E;&#x5E93;&#x5219;&#x7531;&#x4E8E;&#x5176;&#x672C;&#x8EAB;&#x7684;&#x7279;&#x70B9;&#x5F97;&#x5230;&#x4E86;&#x975E;&#x5E38;&#x8FC5;&#x901F;&#x7684;&#x53D1;&#x5C55;&#x3002;</p>
<p>NoSQL(Not only SQL )&#x7684;&#x4EA7;&#x751F;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x5927;&#x89C4;&#x6A21;&#x6570;&#x636E;&#x96C6;&#x5408;&#x53CA;&#x591A;&#x79CD;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x5E26;&#x6765;&#x7684;&#x6311;&#x6218;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5927;&#x6570;&#x636E;&#x5E94;&#x7528;&#x96BE;&#x9898;&#x3002;&#x76EE;&#x524D; NoSQL &#x6570;&#x636E;&#x5E93;&#x5E76;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x6839;&#x636E;&#x5176;&#x6240;&#x91C7;&#x7528;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x53EF;&#x4EE5;&#x5206;&#x4E3A; 4 &#x7C7B;&#xFF1A;&#x952E;&#x503C;&#xFF08;Key-Value&#xFF09;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x5E93;&#x3001;&#x5217;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x5E93;&#x3001;&#x6587;&#x6863;&#x578B;&#x6570;&#x636E;&#x5E93;&#x548C;&#x56FE;&#xFF08;Graph&#xFF09;&#x6570;&#x636E;&#x5E93;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&quot;NoSQL &#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BE6;&#x7EC6;&#x8BBA;&#x8FF0;&#x5E38;&#x89C1;&#x7684; NoSQL &#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#x53CA;&#x5176;&#x6240;&#x5305;&#x542B;&#x7684;&#x4E3B;&#x8981;&#x5185;&#x5BB9;&#xFF0C;&#x5E76;&#x8BF4;&#x660E;NoSQL &#x6570;&#x636E;&#x5E93;&#x7684;&#x4E3B;&#x8981;&#x9002;&#x7528;&#x573A;&#x666F;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x4F60;&#x5177;&#x4F53;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x5B9E;&#x9645;&#x9879;&#x76EE;&#xFF0C;&#x8BF4;&#x660E;&#x5177;&#x4F53;&#x91C7;&#x7528;&#x54EA;&#x79CD; NoSQL &#x6570;&#x636E;&#x5E93;&#x6280;&#x672F;&#xFF0C;&#x5E76;&#x8BF4;&#x660E;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x8FC7;&#x7A0B;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x6548;&#x679C;&#x3002;</li>
</ol>
<h3 id="&#x3010;&#x89E3;&#x6790;&#x3011;">&#x3010;&#x89E3;&#x6790;&#x3011;</h3>
<p>&#x4E00;&#x3001;&#x5E94;&#x7ED3;&#x5408;&#x81EA;&#x5DF1;&#x53C2;&#x4E0E;&#x7684;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x9879;&#x76EE;&#xFF0C;&#x8BF4;&#x660E;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x4E8C;&#x3001;NoSQL &#x7684;&#x4E3B;&#x8981;&#x4F18;&#x52BF;&#xFF1A;
&#xFF08;1&#xFF09;&#x907F;&#x514D;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x590D;&#x6742;&#x6027;
&#xFF08;2&#xFF09;&#x9AD8;&#x541E;&#x5410;&#x91CF;
&#xFF08;3&#xFF09;&#x9AD8;&#x6C34;&#x5E73;&#x6269;&#x5C55;&#x80FD;&#x529B;&#x548C;&#x4F4E;&#x7AEF;&#x786C;&#x4EF6;&#x96C6;&#x7FA4;
&#xFF08;4&#xFF09;&#x907F;&#x514D;&#x4E86;&#x6602;&#x8D35;&#x7684;&#x5BF9;&#x8C61;-&#x5173;&#x7CFB;&#x6620;&#x5C04;
NoSQL &#x7684;&#x7F3A;&#x70B9;&#xFF1A;
&#xFF08;1&#xFF09;&#x6570;&#x636E;&#x6A21;&#x578B;&#x548C;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;&#x6CA1;&#x6709;&#x7ECF;&#x8FC7;&#x6570;&#x5B66;&#x9A8C;&#x8BC1;
&#xFF08;2&#xFF09;&#x4E0D;&#x652F;&#x6301; ACID &#x7279;&#x6027;
&#xFF08;3&#xFF09;&#x529F;&#x80FD;&#x7B80;&#x5355;
&#xFF08;4&#xFF09;&#x6CA1;&#x6709;&#x7EDF;&#x4E00;&#x7684;&#x67E5;&#x8BE2;&#x6A21;&#x578B;
NoSQL &#x6570;&#x636E;&#x5E93;&#x7684;&#x56DB;&#x5927;&#x5206;&#x7C7B;&#xFF1A;
1&#x3001;&#x952E;&#x503C;(Key-Value)&#x5B58;&#x50A8;&#x6570;&#x636E;&#x5E93;
&#x8FD9;&#x4E00;&#x7C7B;&#x6570;&#x636E;&#x5E93;&#x4E3B;&#x8981;&#x4F1A;&#x4F7F;&#x7528;&#x5230;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x8868;&#xFF0C;&#x8FD9;&#x4E2A;&#x8868;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x952E;&#x548C;&#x4E00;&#x4E2A;&#x6307;&#x9488;&#x6307;&#x5411;&#x7279;&#x5B9A;&#x7684;&#x6570;&#x636E;&#x3002;Key/value &#x6A21;&#x578B;&#x5BF9;&#x4E8E; IT &#x7CFB;&#x7EDF;&#x6765;&#x8BF4;&#x7684;&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#x7B80;&#x5355;&#x3001;&#x6613;&#x90E8;&#x7F72;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C; DBA &#x53EA;&#x5BF9;&#x90E8;&#x5206;&#x503C;&#x8FDB;&#x884C;&#x67E5;&#x8BE2;&#x6216;&#x66F4;&#x65B0;&#x7684;&#x65F6;&#x5019;&#xFF0C;Key/value &#x5C31;&#x663E;&#x5F97;&#x6548;&#x7387;&#x4F4E;&#x4E0B;&#x4E86;&#x3002;&#x4F8B;&#x5982;&#xFF1A;Tokyo Cabinet/Tyrant, Redis, Voldemort, Oracle BDB. </p>
<p>2&#x3001;&#x5217;&#x5B58;&#x50A8;&#x6570;&#x636E;&#x5E93;&#x3002;
&#x8FD9;&#x90E8;&#x5206;&#x6570;&#x636E;&#x5E93;&#x901A;&#x5E38;&#x662F;&#x7528;&#x6765;&#x5E94;&#x5BF9;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7684;&#x6D77;&#x91CF;&#x6570;&#x636E;&#x3002;&#x952E;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x7684;&#x7279;&#x70B9;&#x662F;&#x6307;&#x5411;&#x4E86;&#x591A;&#x4E2A;&#x5217;&#x3002;&#x8FD9;&#x4E9B;&#x5217;&#x662F;&#x7531;&#x5217;&#x5BB6;&#x65CF;&#x6765;&#x5B89;&#x6392;&#x7684;&#x3002;&#x5982;&#xFF1A;Cassandra, HBase, Riak&#x3002;
HBase&#xFF1A;HBase &#x662F;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x3001;&#x9762;&#x5411;&#x5217;&#x7684;&#x5F00;&#x6E90;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x8BE5;&#x6280;&#x672F;&#x6765;&#x6E90;&#x4E8E; Fay Chang &#x6240;&#x64B0;&#x5199;&#x7684;Google &#x8BBA;&#x6587;&#x201C;Bigtable&#xFF1A;&#x4E00;&#x4E2A;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x201D;&#x3002;&#x5C31;&#x50CF; Bigtable &#x5229;&#x7528;&#x4E86; Google &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF08;File System&#xFF09;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x5206;&#x5E03;&#x5F0F;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x4E00;&#x6837;&#xFF0C;HBase &#x5728; Hadoop &#x4E4B;&#x4E0A;&#x63D0;&#x4F9B;&#x4E86;&#x7C7B;&#x4F3C;&#x4E8E; Bigtable &#x7684;&#x80FD;&#x529B;&#x3002;HBase &#x662F;Apache &#x7684;Hadoop &#x9879;&#x76EE;&#x7684;&#x5B50;&#x9879;&#x76EE;&#x3002;HBase &#x4E0D;&#x540C;&#x4E8E;&#x4E00;&#x822C;&#x7684;&#x5173;&#x7CFB;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x9002;&#x5408;&#x4E8E;&#x975E;&#x7ED3;&#x6784;&#x5316;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x5E93;&#x3002;&#x53E6;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x662F; HBase &#x57FA;&#x4E8E;&#x5217;&#x7684;&#x800C;&#x4E0D;&#x662F;&#x57FA;&#x4E8E;&#x884C;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>3&#x3001;&#x6587;&#x6863;&#x578B;&#x6570;&#x636E;&#x5E93;
&#x6587;&#x6863;&#x578B;&#x6570;&#x636E;&#x5E93;&#x7684;&#x7075;&#x611F;&#x662F;&#x6765;&#x81EA;&#x4E8E; Lotus Notes &#x529E;&#x516C;&#x8F6F;&#x4EF6;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x5B83;&#x540C;&#x7B2C;&#x4E00;&#x79CD;&#x952E;&#x503C;&#x5B58;&#x50A8;&#x76F8;&#x7C7B;&#x4F3C;&#x3002;&#x8BE5;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x636E;&#x6A21;&#x578B;&#x662F;&#x7248;&#x672C;&#x5316;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x534A;&#x7ED3;&#x6784;&#x5316;&#x7684;&#x6587;&#x6863;&#x4EE5;&#x7279;&#x5B9A;&#x7684;&#x683C;&#x5F0F;&#x5B58;&#x50A8;&#xFF0C;&#x6BD4;&#x5982; JSON&#x3002;&#x6587;&#x6863;&#x578B;&#x6570;&#x636E;&#x5E93;&#x53EF;&#x4EE5;&#x770B;&#x4F5C;&#x662F;&#x952E;&#x503C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5347;&#x7EA7;&#x7248;&#xFF0C;&#x5141;&#x8BB8;&#x4E4B;&#x95F4;&#x5D4C;&#x5957;&#x952E;&#x503C;&#x3002;&#x800C;&#x4E14;&#x6587;&#x6863;&#x578B;&#x6570;&#x636E;&#x5E93;&#x6BD4;&#x952E;&#x503C;&#x6570;&#x636E;&#x5E93;&#x7684;&#x67E5;&#x8BE2;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#x3002;&#x5982;&#xFF1A;CouchDB, MongoDb. &#x56FD;&#x5185;&#x4E5F;&#x6709;&#x6587;&#x6863;&#x578B;&#x6570;&#x636E;&#x5E93; SequoiaDB&#xFF0C;&#x5DF2;&#x7ECF;&#x5F00;&#x6E90;&#x3002;
Mongo DB&#xFF1A;Mongo DB &#x662F;&#x76EE;&#x524D;&#x5728; IT &#x884C;&#x4E1A;&#x975E;&#x5E38;&#x6D41;&#x884C;&#x7684;&#x4E00;&#x79CD;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x6570;&#x636E;&#x5E93;(NoSql),&#x5176;&#x7075;&#x6D3B;&#x7684;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#x5907;&#x53D7;&#x5F53;&#x524D; IT &#x4ECE;&#x4E1A;&#x4EBA;&#x5458;&#x7684;&#x9752;&#x7750;&#x3002;Mongo DB &#x5F88;&#x597D;&#x7684;&#x5B9E;&#x73B0;&#x4E86;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x601D;&#x60F3;(OO &#x601D;&#x60F3;),&#x5728;Mongo DB &#x4E2D;&#x6BCF;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x90FD;&#x662F;&#x4E00;&#x4E2A; Document &#x5BF9;&#x8C61;&#x3002;Mongo DB &#x6700;&#x5927;&#x7684;&#x4F18;&#x52BF;&#x5728;&#x4E8E;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x6301;&#x4E45;&#x64CD;&#x4F5C;&#x90FD;&#x65E0;&#x9700;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x624B;&#x52A8;&#x7F16;&#x5199;SQL &#x8BED;&#x53E5;,&#x76F4;&#x63A5;&#x8C03;&#x7528;&#x65B9;&#x6CD5;&#x5C31;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x7684;&#x5B9E;&#x73B0; CRUD &#x64CD;&#x4F5C;&#x3002;
Sequoia DB&#xFF1A;SequoiaDB &#x662F;&#x4E00;&#x6B3E;&#x5206;&#x5E03;&#x5F0F;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x6587;&#x6863;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x6765;&#x5B58;&#x53D6;&#x6D77;&#x91CF;&#x975E;&#x5173;&#x7CFB;&#x578B;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5176;&#x5E95;&#x5C42;&#x4E3B;&#x8981;&#x57FA;&#x4E8E;&#x5206;&#x5E03;&#x5F0F;&#xFF0C;&#x9AD8;&#x53EF;&#x7528;&#xFF0C;&#x9AD8;&#x6027;&#x80FD;&#x4E0E;&#x52A8;&#x6001;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8BBE;&#x8BA1; SequoiaDB &#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x4F5C;&#x4E3A;&#x4E00;&#x6B3E;&#x9AD8;&#x6027;&#x80FD;&#x53EF;&#x6269;&#x5C55;&#x7684; NoSQL &#x6570;&#x636E;&#x5E93;&#x4F7F;&#x7528;&#xFF0C;&#x4E5F;&#x53EF;&#x4E0E;&#x5F53;&#x524D;&#x4E3B;&#x6D41;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x6846;&#x67B6; Hadoop &#x7D27;&#x5BC6;&#x96C6;&#x6210;&#x3002;</p>
<p>4&#x3001;&#x56FE;&#x5F62;(Graph)&#x6570;&#x636E;&#x5E93;
&#x56FE;&#x5F62;&#x7ED3;&#x6784;&#x7684;&#x6570;&#x636E;&#x5E93;&#x540C;&#x5176;&#x4ED6;&#x884C;&#x5217;&#x4EE5;&#x53CA;&#x521A;&#x6027;&#x7ED3;&#x6784;&#x7684; SQL &#x6570;&#x636E;&#x5E93;&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x662F;&#x4F7F;&#x7528;&#x7075;&#x6D3B;&#x7684;&#x56FE;&#x5F62;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x6269;&#x5C55;&#x5230;&#x591A;&#x4E2A;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;NoSQL &#x6570;&#x636E;&#x5E93;&#x6CA1;&#x6709;&#x6807;&#x51C6;&#x7684;&#x67E5;&#x8BE2;&#x8BED;&#x8A00;(SQL)&#xFF0C;&#x56E0;&#x6B64;&#x8FDB;&#x884C;&#x6570;&#x636E;&#x5E93;&#x67E5;&#x8BE2;&#x9700;&#x8981;&#x5236;&#x5B9A;&#x6570;&#x636E;&#x6A21;&#x578B;&#x3002;&#x8BB8;&#x591A; NoSQL &#x6570;&#x636E;&#x5E93;&#x90FD;&#x6709; REST &#x5F0F;&#x7684;&#x6570;&#x636E;&#x63A5;&#x53E3;&#x6216;&#x8005;&#x67E5;&#x8BE2; API&#x3002;&#x5982;&#xFF1A;Neo4J, InfoGrid, Infinite Graph. </p>
<p>&#x4E09;&#x3001;&#x8BBA;&#x6587;&#x4E2D;&#x9700;&#x8981;&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5B9E;&#x9645;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BE6;&#x7EC6;&#x8BBA;&#x8FF0;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x6240;&#x91C7;&#x7528;&#x7684; noSQL &#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5E76;&#x8BE6;&#x7EC6;&#x8BF4;&#x660E;&#x5B9E;&#x65BD;&#x6548;&#x679C;&#x3002; </p>
<footer class="page-footer"><span class="copyright">Copyright &#xA9; Lacuz 2020 all right reserved&#xFF0C;powered by Gitbook</span><span class="footer-modification">&#x8BE5;&#x6587;&#x7AE0;&#x4FEE;&#x8BA2;&#x65F6;&#x95F4;&#xFF1A;
2022-10-25
</span></footer>
<script>console.log("plugin-popup....");document.onclick = function(e){ e.target.tagName === "IMG" && window.open(e.target.src,e.target.src)}</script><style>img{cursor:pointer}</style>
                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2017.html" class="navigation navigation-prev " aria-label="Previous page: 2017">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="2019.html" class="navigation navigation-next " aria-label="Next page: 2019">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2018","level":"1.3.1.11","depth":3,"next":{"title":"2019","level":"1.3.1.12","depth":3,"path":"4论文范文/历年真题/2019.md","ref":"4论文范文/历年真题/2019.md","articles":[]},"previous":{"title":"2017","level":"1.3.1.10","depth":3,"path":"4论文范文/历年真题/2017.md","ref":"4论文范文/历年真题/2017.md","articles":[]},"dir":"ltr"},"config":{"plugins":["expandable-chapters-small","splitter","code","hide-element","pageview-count","popup","tbfed-pagefooter","-sharing","sharing-plus"],"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"pluginsConfig":{"tbfed-pagefooter":{"copyright":"Copyright &copy Lacuz 2020","modify_label":"该文章修订时间：","modify_format":"YYYY-MM-DD"},"splitter":{},"search":{},"sharing-plus":{"qq":false,"all":["facebook","google","twitter","instapaper","linkedin","pocket","stumbleupon"],"douban":false,"facebook":true,"weibo":false,"instapaper":false,"whatsapp":false,"hatenaBookmark":false,"twitter":true,"messenger":false,"line":false,"vk":false,"pocket":true,"google":false,"viber":false,"stumbleupon":false,"qzone":false,"linkedin":false},"popup":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"code":{"copyButtons":true},"hide-element":{"elements":[".gitbook-link"]},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"pageview-count":{},"expandable-chapters-small":{},"sharing":{"qq":true,"qzone":true,"weibo":true,"all":["weibo","qq","qzone"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"Lacuz","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"系统架构设计师","language":"zh-hans","gitbook":"*","description":"系统架构设计师考试"},"file":{"path":"4论文范文/历年真题/2018.md","mtime":"2022-10-25T03:56:21.310Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-26T12:13:22.739Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-expandable-chapters-small/expandable-chapters-small.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-splitter/splitter.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-code/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-hide-element/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-pageview-count/plugin.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing-plus/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

