
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>2021 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="../../gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="../../gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="../../gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="../../gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="../09-题3-论基于REST服务的Web应用系统设计.html" />
    
    
    <link rel="prev" href="2020.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="../../">
            
                <a href="../../">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="../../readme.html">
            
                <a href="../../readme.html">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    第四章 论文范文
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    历年真题
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="总览.html">
            
                <a href="总览.html">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="2009.html">
            
                <a href="2009.html">
            
                    
                    2009
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="2010.html">
            
                <a href="2010.html">
            
                    
                    2010
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="2011.html">
            
                <a href="2011.html">
            
                    
                    2011
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="2012.html">
            
                <a href="2012.html">
            
                    
                    2012
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="2013.html">
            
                <a href="2013.html">
            
                    
                    2013
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="2014.html">
            
                <a href="2014.html">
            
                    
                    2014
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="2015.html">
            
                <a href="2015.html">
            
                    
                    2015
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="2016.html">
            
                <a href="2016.html">
            
                    
                    2016
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="2017.html">
            
                <a href="2017.html">
            
                    
                    2017
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="2018.html">
            
                <a href="2018.html">
            
                    
                    2018
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.12" data-path="2019.html">
            
                <a href="2019.html">
            
                    
                    2019
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.13" data-path="2020.html">
            
                <a href="2020.html">
            
                    
                    2020
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.3.1.14" data-path="2021.html">
            
                <a href="2021.html">
            
                    
                    2021
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" data-path="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html">
            
                    
                    09-题3-论基于REST服务的Web应用系统设计
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.3" data-path="../16-题2-论软件设计模式及其应用.html">
            
                <a href="../16-题2-论软件设计模式及其应用.html">
            
                    
                    16-题2-论软件设计模式及其应用
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    第五章 考试心得
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                <a href="../../5考试心得/如何跨专业考计算机高级证书.html">
            
                    
                    如何跨专业考计算机高级证书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4.2" data-path="../../5考试心得/系统架构设计师之备考攻略.html">
            
                <a href="../../5考试心得/系统架构设计师之备考攻略.html">
            
                    
                    系统架构设计师之备考攻略
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="../.." >2021</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="2021-&#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;">2021 &#x5E74;&#x7CFB;&#x7EDF;&#x67B6;&#x6784;&#x5E08;&#x8003;&#x8BD5;&#x79D1;&#x76EE;&#x4E09;</h1>
<h2 id="&#x8BBA;&#x6587;&#x8BD5;&#x9898;&#x4E00;-&#x8BBA;&#x9762;&#x5411;&#x5207;&#x9762;&#x7684;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x53CA;&#x5176;&#x5E94;&#x7528;">&#x8BBA;&#x6587;&#x8BD5;&#x9898;&#x4E00; &#x8BBA;&#x9762;&#x5411;&#x5207;&#x9762;&#x7684;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x9488;&#x5BF9;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x6240;&#x9762;&#x4E34;&#x7684;&#x89C4;&#x6A21;&#x4E0D;&#x65AD;&#x6269;&#x5927;&#x3001;&#x590D;&#x6742;&#x5EA6;&#x4E0D;&#x65AD;&#x63D0;&#x5347;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x9762;&#x5411;&#x5207;&#x9762;&#x7684;&#x7F16;&#x7A0B;&#xFF08;Aspect
Oriented Programming,AOP&#xFF09;&#x6280;&#x672F;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x6709;&#x6548;&#x7684;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x65B9;&#x6CD5;&#x3002;&#x4E3A;&#x4E86;&#x7406;&#x89E3;&#x548C;&#x5B8C;&#x6210;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x901A;&#x5E38;&#x8981;&#x628A;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x529F;&#x80FD;&#x5212;&#x5206;&#x548C;&#x5C01;&#x88C5;&#x3002;&#x4E00;&#x822C;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x67D0;&#x4E9B;&#x901A;&#x7528;&#x529F;&#x80FD;&#xFF0C;&#x5982;&#x5B89;&#x5168;&#x6027;&#x3001;&#x6301;&#x7EED;&#x6027;&#x3001;&#x65E5;&#x5FD7;&#x8BB0;&#x5F55;&#x7B49;&#x7B49;&#xFF0C;&#x5176;&#x4EE3;&#x7801;&#x662F;&#x5206;&#x6563;&#x7684;&#xFF0C;&#x8F83;&#x96BE;&#x5B9E;&#x73B0;&#x6A21;&#x5757;&#x5316;&#xFF0C;&#x4E0D;&#x5229;&#x4E8E;&#x7A0B;&#x5E8F;&#x6F14;&#x53D8;&#x3001;&#x7EF4;&#x62A4;&#x548C;&#x66F4;&#x65B0;&#x3002;AOP &#x6280;&#x672F;&#x5C06;&#x903B;&#x8F91;&#x4E0A;&#x5173;&#x7CFB;&#x677E;&#x6563;&#x7684;&#x4EE3;&#x7801;&#x5C01;&#x88C5;&#x5230;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x67D0;&#x79CD;&#x516C;&#x5171;&#x884C;&#x4E3A;&#x7684;&#x53EF;&#x91CD;&#x7528;&#x6A21;&#x5757;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x547D;&#x540D;&#x4E3A;&#x5207;&#x9762;&#xFF08;Aspect&#xFF09;. </p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x9762;&#x5411;&#x5207;&#x9762;&#x7684;&#x7F16;&#x7A0B;&#x6280;&#x672F;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x5B9E;&#x65BD;&#x7684;&#x5E94;&#x7528; AOP &#x6280;&#x672F;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x62C5;&#x4EFB;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x53D9;&#x8FF0;&#x5728;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x5B9E;&#x8DF5;&#x8FC7;&#x7A0B;&#x4F7F;&#x7528; AOP &#x6280;&#x672F;&#x5F00;&#x53D1;&#x7684;&#x5177;&#x4F53;&#x6B65;&#x9AA4;&#x3002;</li>
<li>&#x7ED3;&#x5408;&#x9879;&#x76EE;&#x5185;&#x5BB9;&#xFF0C;&#x8BBA;&#x8FF0;&#x8BE5;&#x9879;&#x76EE;&#x4F7F;&#x7528; AOP &#x6280;&#x672F;&#x7684;&#x539F;&#x56E0;&#xFF0C;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x95EE;&#x9898;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x4F7F;&#x7528; AOP &#x6280;&#x672F;&#x5E26;&#x6765;&#x7684;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x6548;&#x679C;&#x3002;</li>
</ol>
<h2 id="&#x8BD5;&#x9898;&#x4E8C;-&#x8BBA;&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x53CA;&#x5176;&#x5E94;&#x7528;">&#x8BD5;&#x9898;&#x4E8C; &#x8BBA;&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x968F;&#x7740;&#x793E;&#x4F1A;&#x4FE1;&#x606F;&#x5316;&#x8FDB;&#x7A0B;&#x7684;&#x52A0;&#x5FEB;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x53CA;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x88AB;&#x5404;&#x884C;&#x5404;&#x4E1A;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#xFF0C;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x95EE;&#x9898;&#x4E5F;&#x53D8;&#x5F97;&#x6108;&#x6765;&#x6108;&#x91CD;&#x8981;&#x3002;&#x5B83;&#x5177;&#x6709;&#x673A;&#x5BC6;&#x6027;&#x3001;&#x5B8C;&#x6574;&#x6027;&#x3001;&#x53EF;&#x7528;&#x6027;&#x3001;&#x53EF;&#x63A7;&#x6027;&#x548C;&#x4E0D;&#x53EF;&#x62B5;&#x8D56;&#x6027;&#x7B49;&#x7279;&#x5F81;&#x3002;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x7684;&#x5B89;&#x5168;&#x4FDD;&#x969C;&#x662F;&#x4EE5;&#x98CE;&#x9669;&#x548C;&#x7B56;&#x7565;&#x4E3A;&#x57FA;&#x7840;&#xFF0C;&#x5728;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x63D0;&#x4F9B;&#x5305;&#x62EC;&#x6280;&#x672F;&#x3001;&#x7BA1;&#x7406;&#x3001;&#x4EBA;&#x5458;&#x548C;&#x5DE5;&#x7A0B;&#x8FC7;&#x7A0B;&#x7684;&#x6574;&#x4F53;&#x5B89;&#x5168;&#xFF0C;&#x4EE5;&#x4FDD;&#x969C;&#x4FE1;&#x606F;&#x7684;&#x5B89;&#x5168;&#x7279;&#x5F81;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x6D89;&#x53CA;&#x5B89;&#x5168;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BF7;&#x8BE6;&#x7EC6;&#x8BBA;&#x8FF0;&#x5B89;&#x5168;&#x67B6;&#x6784;&#x8BBE;&#x8BA1;&#x4E2D;&#x9274;&#x522B;&#x6846;&#x67B6;&#x548C;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x6846;&#x67B6;&#x8BBE;&#x8BA1;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x5E76;&#x8BBA;&#x8FF0;&#x9274;&#x522B;&#x548C;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x6240;&#x9762;&#x4E34;&#x7684;&#x4E3B;&#x8981;&#x5A01;&#x80C1;&#x6709;&#x54EA;&#x4E9B;&#xFF0C;&#x8BF4;&#x660E;&#x5176;&#x5371;&#x5BB3;&#x3002;</li>
<li>&#x8BF7;&#x7B80;&#x8981;&#x8BF4;&#x660E;&#x5728;&#x4F60;&#x6240;&#x53C2;&#x4E0E;&#x9879;&#x76EE;&#x7684;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5728;&#x9274;&#x522B;&#x6846;&#x67B6;&#x548C;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x6846;&#x67B6;&#x8BBE;&#x8BA1;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#xFF0C;&#x4EE5;&#x53CA;&#x662F;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x7684;&#x3002;</li>
</ol>
<h2 id="&#x8BD5;&#x9898;&#x4E09;-&#x8BBA;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x7406;&#x89E3;&#x4E0E;&#x5E94;&#x7528;">&#x8BD5;&#x9898;&#x4E09; &#x8BBA;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x7406;&#x89E3;&#x4E0E;&#x5E94;&#x7528;</h2>
<p>&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#xFF08;Enterprise Imtcgation Plaform,EIP)&#x662F;&#x652F;&#x7279;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x96C6;&#x6210;&#x7684;&#x50CF;&#x73AF;&#x5883;&#xFF0C;&#x5176;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x662F;&#x4E3A;&#x4F01;&#x4E1A;&#x4E2D;&#x7684;&#x6570;&#x636E;&#x3001;&#x7CFB;&#x7EDF;&#x548C;&#x5E94;&#x7528;&#x7B49;&#x591A;&#x79CD;&#x5BF9;&#x8C61;&#x7684;&#x534F;&#x540C;&#x884C;&#x63D0;&#x4F9B;&#x5404;&#x79CD;&#x516C;&#x5171;&#x670D;&#x52A1;&#x53CA;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x652F;&#x6491;&#x73AF;&#x5883;&#x3002;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x80FD;&#x591F;&#x6839;&#x636E;&#x4E1A;&#x52A1;&#x6A21;&#x578B;&#x7684;&#x53D8;&#x5316;&#x5FEB;&#x901F;&#x5730;&#x8FDB;&#x884C;&#x4FE1;&#x606F;&#x7CFB;&#x7EDF;&#x7684;&#x914D;&#x7F6E;&#x548C;&#x8C03;&#x6574;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E0D;&#x540C;&#x7CFB;&#x7EDF;&#x3001;&#x5E94;&#x7528;&#x3001;&#x670D;&#x52A1;&#x6216;&#x64CD;&#x4F5C;&#x4EBA;&#x5458;&#x4E4B;&#x540C;&#x987A;&#x7545;&#x5730;&#x76F8;&#x4E92;&#x64CD;&#x4F5C;&#xFF0C;&#x8FDB;&#x800C;&#x63D0;&#x9AD8;&#x4F01;&#x4E1A;&#x9002;&#x5E94;&#x5E02;&#x573A;&#x53D8;&#x5316;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4F7F;&#x4F01;&#x4E1A;&#x80FD;&#x591F;&#x5728;&#x590D;&#x6742;&#x591A;&#x53D8;&#x7684;&#x5E02;&#x573A;&#x73AF;&#x5883;&#x4E2D;&#x751F;&#x5B58;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x7684;&#x7406;&#x89E3;&#x4E0E;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9605;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x3001;&#x91C7;&#x7528;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x8FDB;&#x884C;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x96C6;&#x6210;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BF7;&#x7ED9;&#x51FA;&#x81F3;&#x5C11; 4 &#x79CD;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x5E94;&#x5177;&#x6709;&#x7684;&#x57FA;&#x672C;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x5BF9;&#x8FD9; 4 &#x79CD;&#x529F;&#x80FD;&#x7684;&#x5185;&#x6DB5;&#x8FDB;&#x884C;&#x7B80;&#x8981;&#x9610;&#x8FF0;&#x3002;</li>
<li>&#x5177;&#x4F53;&#x9610;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x9879;&#x76EE;&#x662F;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x4F01;&#x4E1A;&#x96C6;&#x6210;&#x5E73;&#x53F0;&#x8FDB;&#x884C;&#x4F01;&#x4E1A;&#x4FE1;&#x606F;&#x96C6;&#x6210;&#x7684;&#xFF0C;&#x5E76;&#x56F4;&#x7ED5;&#x4E0A;&#x8FF0; 4 &#x79CD;&#x529F;&#x80FD;&#xFF0C;&#x8BE6;&#x7EC6;&#x8BBA;&#x8FF0;&#x5728;&#x96C6;&#x6210;&#x8FC7;&#x7A0B;&#x4E2D;&#x9047;&#x5230;&#x4E86;&#x54EA;&#x4E9B;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x7684;&#x3002;</li>
</ol>
<h2 id="&#x8BD5;&#x9898;&#x56DB;-&#x8BBA;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;">&#x8BD5;&#x9898;&#x56DB; &#x8BBA;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;</h2>
<p>&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#xFF08;Microservices Architecture)&#x662F;&#x4E00;&#x79CD;&#x67B6;&#x6784;&#x98CE;&#x683C;&#xFF0C;&#x5B83;&#x5C06;&#x4E00;&#x4E2A;&#x590D;&#x6742;&#x7684;&#x5E94;&#x7528;&#x62C6;&#x5206;&#x6210;&#x591A;&#x4E2A;&#x72EC;&#x7ACB;&#x81EA;&#x6CBB;&#x7684;&#x670D;&#x52A1;&#xFF0C;&#x670D;&#x52A1;&#x4E0E;&#x670D;&#x52A1;&#x95F4;&#x901A;&#x8FC7;&#x677E;&#x8026;&#x5408;&#x7684;&#x5F62;&#x5F0F;&#x4EA4;&#x4E92;&#xFF0C;&#x5728;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x4E2D;&#xFF0C;&#x670D;&#x52A1;&#x662F;&#x7EC6;&#x7C92;&#x5EA6;&#x7684;&#xFF0C;&#x534F;&#x8BAE;&#x662F;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x3002;&#x8FD9;&#x4E9B;&#x670D;&#x52A1;&#x901A;&#x5E38;&#x6309;&#x4E1A;&#x52A1;&#x80FD;&#x529B;&#x7EC4;&#x7EC7;&#xFF0C;&#x6709;&#x81EA;&#x8EAB;&#x7684;&#x6280;&#x672F;&#x5806;&#x6808;&#x3002;</p>
<p><strong>&#x8BF7;&#x56F4;&#x7ED5;&#x201C;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x53CA;&#x5176;&#x5E94;&#x7528;&#x201D;&#x8BBA;&#x9898;</strong>&#xFF0C;&#x4F9D;&#x6B21;&#x4ECE;&#x4EE5;&#x4E0B;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#x8FDB;&#x884C;&#x8BBA;&#x8FF0;&#x3002;</p>
<ol>
<li>&#x6982;&#x8981;&#x53D9;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x3001;&#x91C7;&#x7528;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x4EE5;&#x53CA;&#x4F60;&#x5728;&#x5176;&#x4E2D;&#x6240;&#x627F;&#x62C5;&#x7684;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x3002;</li>
<li>&#x8BF7;&#x7B80;&#x8981;&#x63CF;&#x8FF0;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x7684;&#x4F18;&#x70B9;&#x3002;</li>
<li>&#x5177;&#x4F53;&#x9610;&#x8FF0;&#x4F60;&#x53C2;&#x4E0E;&#x7BA1;&#x7406;&#x548C;&#x5F00;&#x53D1;&#x7684;&#x9879;&#x76EE;&#x662F;&#x5982;&#x4F55;&#x57FA;&#x4E8E;&#x5FAE;&#x670D;&#x52A1;&#x67B6;&#x6784;&#x8FDB;&#x884C;&#x4EF6;&#x8BBE;&#x8BA1;&#x5B9E;&#x73B0;&#x7684;&#x3002;</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="2020.html" class="navigation navigation-prev " aria-label="Previous page: 2020">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="../09-题3-论基于REST服务的Web应用系统设计.html" class="navigation navigation-next " aria-label="Next page: 09-题3-论基于REST服务的Web应用系统设计">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"2021","level":"1.3.1.14","depth":3,"next":{"title":"09-题3-论基于REST服务的Web应用系统设计","level":"1.3.2","depth":2,"path":"4论文范文/09-题3-论基于REST服务的Web应用系统设计.md","ref":"4论文范文/09-题3-论基于REST服务的Web应用系统设计.md","articles":[]},"previous":{"title":"2020","level":"1.3.1.13","depth":3,"path":"4论文范文/历年真题/2020.md","ref":"4论文范文/历年真题/2020.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":[],"pluginsConfig":{"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"4论文范文/历年真题/2021.md","mtime":"2022-10-20T17:55:30.945Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2022-10-20T18:50:19.495Z"},"basePath":"../..","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="../../gitbook/gitbook.js"></script>
    <script src="../../gitbook/theme.js"></script>
    
        
        <script src="../../gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="../../gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

